{"scopus-eid": "2-s2.0-84865722160", "originalText": "serial JL 271459 291210 291731 291892 291893 31 Solar Energy SOLARENERGY 2012-08-10 2012-08-10 2012-09-01T03:58:55 1-s2.0-S0038092X12002472 S0038-092X(12)00247-2 S0038092X12002472 10.1016/j.solener.2012.07.006 S300 S300.1 FULL-TEXT 1-s2.0-S0038092X12X00100 2015-05-14T02:30:25.053396-04:00 0 0 20121001 20121031 2012 2012-08-10T00:00:00Z articleinfo crossmark dco dateupdated tomb dateloaded datesearch indexeddate issuelist volumelist yearnav articletitlenorm authfirstinitialnorm authfirstsurnamenorm cid cids contenttype copyright dateloadedtxt docsubtype doctype doi eid ewtransactionid hubeid issfirst issn issnnorm itemstage itemtransactionid itemweight openaccess openarchive pg pgfirst pglast pii piinorm pubdateend pubdatestart pubdatetxt pubyr sectiontitle sortorder srctitle srctitlenorm srctype subheadings volfirst volissue webpdf webpdfpagecount figure table body mmlmath acknowledge affil articletitle auth authfirstini authfull authkeywords authlast misctext primabst ref specialabst alllist content subj ssids 0038-092X 0038092X false 86 86 10 10 Volume 86, Issue 10 12 3004 3008 3004 3008 201210 October 2012 2012-10-01 2012-10-31 2012 Regular Articles article fla Copyright © 2012 Elsevier Ltd. All rights reserved. CHARACTERIZATIONPIIITEXTUREDINDUSTRIALMULTICRYSTALLINESILICONSOLARCELLS LIU J 1 Introduction 2 Experimental 3 Results and discussion 3.1 Surface morphologies and reflectance 3.2 Electrical parameters 3.3 SiN x :H–Si interface and Voc 3.4 Ag–Si interface and FF 3.5 EQE and Jsc 4 Conclusions Acknowledgements References BALDACCHINI 2006 4917 4919 T BRANZ 2009 231121 H CHENG 2011 87 94 Y CROUCH 2004 1850 1852 C DUERINCKX 2002 231 246 F GANGOPADHYAY 2007 285 289 U GOETZBERGER 2003 1 46 A HER 1998 1673 1675 T JANSEN 1996 14 28 H KOYNOV 2006 203107 S KUMARAVELU 2004 108 110 G MA 2006 171907 L MACDONALD 2004 277 283 D MENNA 1995 13 24 P POULLIKKAS 2010 617 634 A TOOR 2011 103501 F XIA 2011 1574 1578 Y YOO 2006 3085 3093 J YOO 2010 730 734 J ZAIDI 2001 1200 1206 S LIUX2012X3004 LIUX2012X3004X3008 LIUX2012X3004XJ LIUX2012X3004X3008XJ item S0038-092X(12)00247-2 S0038092X12002472 1-s2.0-S0038092X12002472 10.1016/j.solener.2012.07.006 271459 2012-08-31T23:28:34.807699-04:00 2012-10-01 2012-10-31 1-s2.0-S0038092X12002472-main.pdf https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0038092X12002472/MAIN/application/pdf/34d11589dfdf73bd5bd35dd5a05dab13/main.pdf https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0038092X12002472/MAIN/application/pdf/34d11589dfdf73bd5bd35dd5a05dab13/main.pdf main.pdf pdf true 649244 MAIN 5 1-s2.0-S0038092X12002472-main_1.png https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0038092X12002472/PREVIEW/image/png/5728fc26636947193875ed696fa3c3de/main_1.png https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0038092X12002472/PREVIEW/image/png/5728fc26636947193875ed696fa3c3de/main_1.png main_1.png png 63904 849 656 IMAGE-WEB-PDF 1 1-s2.0-S0038092X12002472-si1.gif https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0038092X12002472/STRIPIN/image/gif/ba6dd83178f2493f96c089c3f7d92ed2/si1.gif https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0038092X12002472/STRIPIN/image/gif/ba6dd83178f2493f96c089c3f7d92ed2/si1.gif si1 si1.gif gif 1480 41 262 ALTIMG 1-s2.0-S0038092X12002472-si3.gif https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0038092X12002472/STRIPIN/image/gif/1d152bd6153e8540edeecdac49fd85bc/si3.gif https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0038092X12002472/STRIPIN/image/gif/1d152bd6153e8540edeecdac49fd85bc/si3.gif si3 si3.gif gif 316 17 34 ALTIMG 1-s2.0-S0038092X12002472-si2.gif https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0038092X12002472/STRIPIN/image/gif/b5ee7547f51b92f10150b3a3cdcda525/si2.gif https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0038092X12002472/STRIPIN/image/gif/b5ee7547f51b92f10150b3a3cdcda525/si2.gif si2 si2.gif gif 315 17 32 ALTIMG 1-s2.0-S0038092X12002472-gr2.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0038092X12002472/gr2/DOWNSAMPLED/image/jpeg/c9e7ddbe7d65f5e2d899b94d34905c67/gr2.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0038092X12002472/gr2/DOWNSAMPLED/image/jpeg/c9e7ddbe7d65f5e2d899b94d34905c67/gr2.jpg gr2 gr2.jpg jpg 16915 244 324 IMAGE-DOWNSAMPLED 1-s2.0-S0038092X12002472-gr2.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0038092X12002472/gr2/THUMBNAIL/image/gif/4df41d3631b6904ba2049ddf13d72f72/gr2.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0038092X12002472/gr2/THUMBNAIL/image/gif/4df41d3631b6904ba2049ddf13d72f72/gr2.sml gr2 gr2.sml sml 6220 164 217 IMAGE-THUMBNAIL 1-s2.0-S0038092X12002472-gr3.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0038092X12002472/gr3/DOWNSAMPLED/image/jpeg/56f25b606abb568c3f6d701ae77e09c1/gr3.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0038092X12002472/gr3/DOWNSAMPLED/image/jpeg/56f25b606abb568c3f6d701ae77e09c1/gr3.jpg gr3 gr3.jpg jpg 23465 189 478 IMAGE-DOWNSAMPLED 1-s2.0-S0038092X12002472-gr3.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0038092X12002472/gr3/THUMBNAIL/image/gif/affa39fc283cf87d48ca5dff8db7b0c0/gr3.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0038092X12002472/gr3/THUMBNAIL/image/gif/affa39fc283cf87d48ca5dff8db7b0c0/gr3.sml gr3 gr3.sml sml 9618 87 219 IMAGE-THUMBNAIL 1-s2.0-S0038092X12002472-gr4.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0038092X12002472/gr4/DOWNSAMPLED/image/jpeg/be986a418677c75c0a69836bcf9b53a9/gr4.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0038092X12002472/gr4/DOWNSAMPLED/image/jpeg/be986a418677c75c0a69836bcf9b53a9/gr4.jpg gr4 gr4.jpg jpg 18631 171 505 IMAGE-DOWNSAMPLED 1-s2.0-S0038092X12002472-gr4.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0038092X12002472/gr4/THUMBNAIL/image/gif/d0bad9432808ac5c5b2fc3fa274a7ada/gr4.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0038092X12002472/gr4/THUMBNAIL/image/gif/d0bad9432808ac5c5b2fc3fa274a7ada/gr4.sml gr4 gr4.sml sml 7130 74 219 IMAGE-THUMBNAIL 1-s2.0-S0038092X12002472-gr5.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0038092X12002472/gr5/DOWNSAMPLED/image/jpeg/da5b50186b7f2f961b840f91e16f1c45/gr5.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0038092X12002472/gr5/DOWNSAMPLED/image/jpeg/da5b50186b7f2f961b840f91e16f1c45/gr5.jpg gr5 gr5.jpg jpg 15762 150 515 IMAGE-DOWNSAMPLED 1-s2.0-S0038092X12002472-gr5.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0038092X12002472/gr5/THUMBNAIL/image/gif/87409b20aad16e869760461c81c63f1a/gr5.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0038092X12002472/gr5/THUMBNAIL/image/gif/87409b20aad16e869760461c81c63f1a/gr5.sml gr5 gr5.sml sml 5855 64 219 IMAGE-THUMBNAIL 1-s2.0-S0038092X12002472-gr6.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0038092X12002472/gr6/DOWNSAMPLED/image/jpeg/603775f2ac1dd58d5a9811c8fcc1bd18/gr6.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0038092X12002472/gr6/DOWNSAMPLED/image/jpeg/603775f2ac1dd58d5a9811c8fcc1bd18/gr6.jpg gr6 gr6.jpg jpg 23544 247 351 IMAGE-DOWNSAMPLED 1-s2.0-S0038092X12002472-gr6.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0038092X12002472/gr6/THUMBNAIL/image/gif/cffb5babf816fd9bd94641c1c0c2909c/gr6.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0038092X12002472/gr6/THUMBNAIL/image/gif/cffb5babf816fd9bd94641c1c0c2909c/gr6.sml gr6 gr6.sml sml 5798 154 219 IMAGE-THUMBNAIL 1-s2.0-S0038092X12002472-gr1.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0038092X12002472/gr1/DOWNSAMPLED/image/jpeg/e7d9dcebfe06a69c963dbf1570f7ac32/gr1.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0038092X12002472/gr1/DOWNSAMPLED/image/jpeg/e7d9dcebfe06a69c963dbf1570f7ac32/gr1.jpg gr1 gr1.jpg jpg 51848 390 355 IMAGE-DOWNSAMPLED 1-s2.0-S0038092X12002472-gr1.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0038092X12002472/gr1/THUMBNAIL/image/gif/7253b476b53c0048a5c05207b30513f9/gr1.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0038092X12002472/gr1/THUMBNAIL/image/gif/7253b476b53c0048a5c05207b30513f9/gr1.sml gr1 gr1.sml sml 9317 164 149 IMAGE-THUMBNAIL SE 3179 S0038-092X(12)00247-2 10.1016/j.solener.2012.07.006 Elsevier Ltd Fig. 1 Process sequence for the fabrication of PIII textured and acid textured solar cells. Fig. 2 Reflectance curves of the PIII textured and the acid textured silicon surfaces. The corresponding photographs of (a) the PIII textured and (b) the acid textured samples are inserted in the figure. Fig. 3 SEM images of the PIII textured silicon. (a) Top view and (b) cross-sectional view. Fig. 4 SEM images of the SiN x :H–Si interfaces (viewed at 10° to the normal). Fig. 5 SEM images of the Ag–Si interfaces of (a) acid textured cell and (b) PIII textured cell. Fig. 6 EQE and reflectance curves of the PIII textured and acid textured solar cell. Table 1 Electrical parameters of the PIII textured and acid textured silicon solar cells. Cell type Voc (mV) Jsc (mA/cm2) FF (%) Eff. (%) Rs (mΩ) Rsh (Ω) Irev (A) PIII textured cell 613 34.23 77.6 16.3 3.1 7.7 0.99 Acid textured cell 617 33.24 78.0 16.0 2.9 11.4 0.67 Characterization of PIII textured industrial multicrystalline silicon solar cells Jie Liu a b Bangwu Liu a Zenan Shen a Jinhu Liu a Sihua Zhong a Su Liu b Chaobo Li a Yang Xia a ⁎ a Key Laboratory of Microelectronics Devices & Integrated Technology, Institute of Microelectronics, Chinese Academy of Sciences, Beijing 100029, China b Institute of Microelectronics, School of Physical Science and Technology, Lanzhou University, Lanzhou 730000, China ⁎ Corresponding author. Tel.: +86 10 82995526; fax: +86 10 82995652. Communicated by: Associate Editor Arturo Morales-Acevedo Highlights ► Nanostructures with aspect ratios of 1:1 and reflectance of 8.0%. ► Poor field-effect passivation results in low Voc . ► Non-uniform silicon nitride layer results in low FF. ► Good antireflection results in high Jsc . ► The solar cell yields efficiency of 16.3% with Jsc of 34.23mA/cm2. Optimized textured structure is one of the most important elements for high efficiency multicrystalline silicon solar cells. In this paper, in order to incorporate low reflectance nanostructures into conventional industrial solar cells, structures with aspect ratios of about 1:1 and average reflectance of 8.0% have been generated using plasma immersion ion implantation. A sheet resistance of 56.9Ω/sq has been obtained by adjusting the phosphorous diffusion conditions, while the thickness of the silicon nitride vary in 70–80nm by extending the deposition time by 100s. Under the conventional co-firing conditions, a solar cell with efficiency of 16.3% and short-circuit current density 34.23mA/cm2 has been fabricated. Keywords Plasma immersion ion implantation Nanostructures Multicrystalline silicon solar cells Electrical parameters 1 Introduction Multicrystalline silicon (mc-Si) solar cells currently account for about 60% worldwide photovoltaic (PV) production due to the low cost (Goetzberger et al., 2003; Gangopadhyay et al., 2007; Poullikkas, 2010). However, the efficiency of the mc-Si is about 1–2% lower than that of the single crystalline cells. One of the most important reasons for this difference is the lack of an effective method to texture mc-Si. In industry, acid solution is always used to texture mc-Si to decrease surface reflection. However, the reflectance of acid textured wafer is still as high as 23%, which limits its applications for high-efficient solar cells (Cheng et al., 2011). In order to further reduce the reflectance, types of approaches have been used to produce “black silicon”, such as metal-catalyzed etching (Koynov et al., 2006; Branz et al., 2009; Toor et al., 2011), femtosecond laser pulses (Her et al., 1998; Crouch et al., 2004; Baldacchini et al., 2006) and reactive ion etching (Jansen et al., 1996; Schnell et al., 2000; Macdonald et al., 2004; Yoo et al., 2006; Yoo, 2010). We previously demonstrated a 15.68%-efficient single crystalline solar cell based on plasma immersion ion implantation (PIII) textured structures (Xia et al., 2011). These structures exhibit high aspect ratios of about 7:1 and low reflectance of 1.79%. However, the short-circuit current (Jsc ) of the cell is much lower than expected, indicating that there is a mismatch between these PIII textured structures and conventional fabrication process. In order to incorporate PIII textured structures into conventional fabrication techniques, a number of technical issues have to be faced and solved. Some of them are listed as follows. (1) The lowest reflection structures with high aspect ratios may not be suitable for solar cells due to high surface area. There is a competition between improved absorption and increased surface recombination. (2) Phosphorus is easy to diffuse into nanostructured substrate under the same diffusion conditions and thereby, highly doped n+ emitter with high Auger recombination will be formed, which will result in a low Isc . (3) Under the same deposition conditions of silicon nitride (SiN x :H), the depths of passivation layers are always thinner than that of acid textured cells due to the enlarged surface area and thereby, resulting in a low open-circuit voltage (Voc ). (4) The deposited SiN x :H layer is always non-uniform due to the nanostructures, which will affect the uniformity of glass layer after co-firing. The thick areas of SiN x :H layer are always incompletely etched while the thin areas have been done, which will result in a high series resistance (Rs ) and a low fill factor (FF). In this paper, in order to balance the competition between absorption and surface recombination, optimized structures have been produced by adjusting PIII parameters. The surface morphology and reflectance will be investigated. The diffusion conditions has been adjusted to obtain the same sheet resistance for PIII textured silicon, while a comparable thickness of silicon nitride has been deposited by adjusting deposition conditions. The electrical parameters of the PIII textured solar cell will be investigated in detail. 2 Experimental P-type multicrystalline samples, with thickness of 200±20μm, area of 156mm×156mm and resistivity of 1–3Ωcm, were used in the experiments. After a damage removal etching in 10% NaOH solution, part of the samples (group 1) were textured by PIII in SF6/O2 (SF6:O2 =3:1, by volume) gases, others (group 2) were performed in HF/HNO3/H2O (HF/HNO3/H2O=1:5:3, by volume) solutions at 9°C for 220s. After the texturing process, solar cells were fabricated by utilizing conventional fabrication techniques, i.e. phosphorous diffusion, phosphosilicate glass (PSG) removal, edge etching, SiN x :H deposition, metal printing & baking and co-firing. The diffusion and deposition conditions are different for group 1 and group 2. The diffusion temperature of group 1 was 10°C lower than group 2, while the deposition time of SiN x :H layer for group 2 was 800s, which was extended to 900s for group 1. The process sequence for the fabrication of solar cells was shown in Fig. 1 . Both the surface morphologies and the interfaces of SiN x :H–Si and Ag–Si were investigated by a scanning electron microscope. The surface reflectance was examined by a UV–VIS–NIR spectrophotometer equipped with an integrating sphere detector. The sheet resistance was tested by four point probe, while the external quantum efficiency (EQE) was performed on a quantum efficiency measurement system. The current–voltage measurements were performed under AM 1.5 illumination conditions. 3 Results and discussion 3.1 Surface morphologies and reflectance The photographs of the PIII textured silicon and the acid textured samples are inserted in Fig. 2 . It can be found that the surface of the PIII textured silicon appears black, whereas that of the acid textured silicon shows gray. The different colors can be understood from the different surface reflectance, which have been tested in the wavelength range from 300 to 1100nm and are shown in Fig. 2. It is obvious that the surface reflectance of the PIII textured silicon is lower than that of the acid textured silicon among the whole monitored region. Average reflectance (Ra ) is defined as: (1) R a = ∫ 300 1100 R ( λ ) N ( λ ) d λ ∫ 300 1100 N ( λ ) d λ Wherein R ( λ ) is wavelength-dependent reflectance, N ( λ ) is the solar flux under AM 1.5 standard conditions (Menna et al., 1995). By calculation, the Ra of the PIII textured surface is as low as 8.0%, while that of the acid textured silicon is 24.4%. This strong absorption is originated from the PIII textured structures. The top and cross-sectional views of the PIII textured silicon are shown in Fig. 3 a and b, respectively. It can be found that inverted pyramid-like structures with diameters of ∼200nm and depths of ∼200nm have been generated on substrate surface. These nanostructures, with silicon fraction increasing smoothly as a function of the depth across the textured layer, behave as multi antireflective layers, thereby resulting in the low reflectance over a broad wavelength range (Ma et al., 2006). 3.2 Electrical parameters The electrical parameters of the PIII textured and acid textured are listed in Table 1 . It can be seen that the Voc of the PIII textured cell is 613mV, which is lower than that of acid textured silicon. This may be attributed to the poor passivation of SiN x :H. With a Jsc of 34.23mA/cm2 and a FF of 77.6%, the PIII textured cell yields an efficiency of 16.3%. In order to further investigate the characterization of the PIII textured cell, we monitor the interface of SiN x :H–Si, the interface of Ag–Si and EQE of the cells. 3.3 SiN x :H–Si interface and Voc The passivation of PECVD SiN x :H layers can be achieved by surface and bulk passivation (Duerinckx and Szlufcik, 2002). Fig. 4 shows the SEM images of the SiN x :H–Si interfaces of the acid textured cell and the PIII textured cell. It can be found that a uniform SiN x :H layer with thickness of 78nm has been deposited on acid textured surface, while a non-uniform SiN x :H layer with thickness of 70–80nm has been deposited on nanostructured surface, indicating that the comparable thickness of SiN x :H layers have been deposited on PIII textured silicon and acid textured silicon by adjust deposition parameters. The uniformity of SiN x :H layer will partially influence the quality of passivation. On the other hand, the surface area of PIII textured silicon is larger than that of acid textured silicon, which should increase surface defect states and low the quality of passivation. Another reason for the low Voc is the ion damage layers introduced in PIII process (Zaidi et al., 2001; Kumaravelu et al., 2004), which will increase the defect states underneath the textured surface and cause degradation of Voc . 3.4 Ag–Si interface and FF Fig. 5 shows the SEM images of the Ag–Si interfaces after co-firing. It can be found that a uniform glass layer beset with medium-sized Ag particles has been formed between the acid textured emitter and Ag grid. This could help in achieving good quality ohmic contacts and high FF. On the other hand, we observe that a non-uniform glass layer has been achieved between the PIII textured emitter and Ag grid. The main reason for this non-uniform is that the SiN x :H layer at the top of the structures is easy to fire through, which will result in the thin glass layer and increase the saturation current and decrease the Rsh . At the bottom of the structures, the layer is difficult to fire through due to the surface tension of silver paste, which will result in the thick glass layer and increase the Rs . This high Rs of 3.1mΩ together with the low Rsh of 7.7Ω results in the low FF of 77.6%. 3.5 EQE and Jsc Fig. 6 shows the external quantum efficiency (EQE) and reflectance curves of the PIII textured cell and acid textured cell. It can be found that the average reflectance of the PIII textured and acid textured surfaces with SiN x :H layer are 3.1% and 8.6%, respectively. Assuming that the transmission is zero, there is a relational expression between reflectance (R) and absorption (A): A =1−R, so about 6.0% absolute incident light can be absorbed by the PIII textured cell. However, the Jsc of the acid textured cell is 33.24mA/cm2, which improves to 34.23mA/cm2 for PIII textured cell (a 2.6% gain). From Fig. 6 it can be found that the EQE of the PIII textured cell is lower than that of acid textured cell in the 300–450nm wavelength regions, while the reflectance of the PIII textured cell is obviously lower than that of acid textured cell. It is clear that the enhanced absorption has not been translated into electrical current predominantly due to the surface recombination, which may be caused by the large surface area and “dead layers” due to a heavily doped Silicon. The doping concentration can be characterized by sheet resistance. The sheet resistance of the PIII textured silicon and acid textured silicon is 56.9Ω/sq and 57.8Ω/sq, respectively, indicating that the “dead layers” is not the reason for the large surface recombination. The surface damage also should account for the low EQE in this region. On the other hand, the EQE of the PIII textured cell is higher in the wavelength of 450–840nm, indicating that more electrical current has been generated due to the enhanced absorption. 4 Conclusions The nanostructure textured surface with low aspect ratios of about 1:1 and low reflectance of 8.0% has been produced using plasma immersion ion implantation (PIII). By decreasing the diffusion temperature and extending the deposition time, 70–80nm silicon nitride layer has been deposited on 56.9Ω/sq emitter. The solar cell based on the emitter yields an efficiency of 16.3% with a short-circuit current density of 34.23mA/cm2, which can be further improved by optimizing the deposition process and the co-firing process. Acknowledgements This work was supported by the National Natural Science Foundation of China (Nos. 607227003 and 61106060) and the Instrument Developing Project of the Chinese Academy Sciences (No. YZ200755). References Baldacchini et al., 2006 T. Baldacchini J.E. Carey M. Zhou Superhydrophobic surfaces prepared by microstructuring silicon using a femtosecond laser Langmuir 22 2006 4917 4919 Branz et al., 2009 H.M. Branz V.E. Yost S. Ward Nanostructured black silicon and the optical reflectance of graded-density surfaces Appl. Phys. Lett. 94 2009 231121 Cheng et al., 2011 Y.-T. Cheng J.-J. Ho S.-Yeu. Tsai Efficiency improved by acid texturization for multi-crystalline silicon solar cells Sol. Energy 85 2011 87 94 Crouch et al., 2004 C.H. Crouch J.E. Carey J.M. Warrender Comparison of structure and properties of femtosecond and nanosecond laser-structured silicon Appl. Phys. Lett. 84 2004 1850 1852 Duerinckx and Szlufcik, 2002 F. Duerinckx J. Szlufcik Defect passivation of industrial multicrystalline solar cells based on PECVD silicon nitride Sol. Energy Mater. Sol. Cells 72 2002 231 246 Gangopadhyay et al., 2007 U. Gangopadhyay S.K. Dhungel Basu Comparative study of different approaches of multicrystalline silicon texturing for solar cell fabrication Sol. Energy Mater. Sol. Cells 91 2007 285 289 Goetzberger et al., 2003 A. Goetzberger C. Hebling H.-W. Schock Photovoltaic materials history status and outlook Mater. Sci. Eng. Res. 40 2003 1 46 Her et al., 1998 T.-H. Her R.J. Finlay C. Deliwala S. Wu Microstructuring of silicon with femtosecond laser pulses Appl. Phys. Lett. 73 1998 1673 1675 Jansen et al., 1996 H. Jansen H. Gardeniers M. de Boer A survey on the reactive ion etching of silicon in microtechnology J. Micromech. Microeng. 6 1996 14 28 Koynov et al., 2006 S. Koynov M.S. Brandt M. Stutzmann Black nonreflecting silicon surfaces for solar cells Appl. Phys. Lett. 88 2006 203107 Kumaravelu et al., 2004 G. Kumaravelu M.M. Alkaisi A. Bittar Damage studies in dry etched textured silicon surfaces Curr. Appl. Phys. 4 2004 108 110 Ma et al., 2006 L.L. Ma Y.C. Zhou N. Jiang Wide-band “black silicon” based on porous silicon Appl. Phys. Lett. 88 2006 171907 Macdonald et al., 2004 D.H. Macdonald A. Cuevas M.J. Kerr Texturing industrial multicrystalline silicon solar cells Sol. Energy 76 2004 277 283 Menna et al., 1995 P. Menna G.D. Francia V.L. Ferrara Porous silicon in solar cells: a review and a description of its application as an AR coating Sol. Energy Mater. Sol. Cells 37 1995 13 24 Poullikkas, 2010 A. Poullikkas Technology and market future prospects of photovoltaic systems Int. Energy & Environ. Found. 1 2010 617 634 Schnell et al., 2000 Schnell, M., Ludemann, R., Schaefer, S., et al., 2000. Plasma surface texturization for multicystalline silicon solar cells. In: Proc. 29th IEEE Photovolatic Specialists Conf.; pp. 367–370. Toor et al., 2011 F. Toor H.M. Branz M.R. Page Multi-scale surface texture to improve blue response of nanoporous black silicon solar cells Appl. Phys. Lett. 99 2011 103501 Xia et al., 2011 Y. Xia B.W. Liu J. Liu A novel method to produce black silicon for solar cells Sol. Energy 85 2011 1574 1578 Yoo et al., 2006 J.S. Yoo I.O. Parm U. Gangopadhyay Black silicon layer formation for application in solar cells Sol. Energy Mater. Sol. Cells 90 2006 3085 3093 Yoo, 2010 J. Yoo Reactive ion etching (RIE) technique for application in crystalline silicon solar cells Sol. Energy 84 2010 730 734 Zaidi et al., 2001 S.H. Zaidi D.S. Ruby J.M. Gee Characterization of random reactive ion etched-textured silicon solar cells IEEE Trans. Electron Dev. 48 2001 1200 1206", "scopus-id": "84865722160", "coredata": {"eid": "1-s2.0-S0038092X12002472", "dc:description": "Optimized textured structure is one of the most important elements for high efficiency multicrystalline silicon solar cells. In this paper, in order to incorporate low reflectance nanostructures into conventional industrial solar cells, structures with aspect ratios of about 1:1 and average reflectance of 8.0% have been generated using plasma immersion ion implantation. A sheet resistance of 56.9Ω/sq has been obtained by adjusting the phosphorous diffusion conditions, while the thickness of the silicon nitride vary in 70–80nm by extending the deposition time by 100s. Under the conventional co-firing conditions, a solar cell with efficiency of 16.3% and short-circuit current density 34.23mA/cm2 has been fabricated.", "openArchiveArticle": "false", "prism:coverDate": "2012-10-31", "openaccessUserLicense": null, "prism:aggregationType": "Journal", "prism:url": "https://api.elsevier.com/content/article/pii/S0038092X12002472", "dc:creator": [{"@_fa": "true", "$": "Liu, Jie"}, {"@_fa": "true", "$": "Liu, Bangwu"}, {"@_fa": "true", "$": "Shen, Zenan"}, {"@_fa": "true", "$": "Liu, Jinhu"}, {"@_fa": "true", "$": "Zhong, Sihua"}, {"@_fa": "true", "$": "Liu, Su"}, {"@_fa": "true", "$": "Li, Chaobo"}, {"@_fa": "true", "$": "Xia, Yang"}], "link": [{"@_fa": "true", "@rel": "self", "@href": "https://api.elsevier.com/content/article/pii/S0038092X12002472"}, {"@_fa": "true", "@rel": "scidir", "@href": "https://www.sciencedirect.com/science/article/pii/S0038092X12002472"}], "dc:format": "application/json", "openaccessType": null, "pii": "S0038-092X(12)00247-2", "prism:volume": "86", "prism:publisher": "Elsevier Ltd.", "dc:title": "Characterization of PIII textured industrial multicrystalline silicon solar cells", "prism:copyright": "Copyright © 2012 Elsevier Ltd. All rights reserved.", "openaccess": "0", "prism:issn": "0038092X", "prism:issueIdentifier": "10", "dcterms:subject": [{"@_fa": "true", "$": "Plasma immersion ion implantation"}, {"@_fa": "true", "$": "Nanostructures"}, {"@_fa": "true", "$": "Multicrystalline silicon solar cells"}, {"@_fa": "true", "$": "Electrical parameters"}], "openaccessArticle": "false", "prism:publicationName": "Solar Energy", "prism:number": "10", "openaccessSponsorType": null, "prism:pageRange": "3004-3008", "prism:endingPage": "3008", "pubType": "fla", "prism:coverDisplayDate": "October 2012", "prism:doi": "10.1016/j.solener.2012.07.006", "prism:startingPage": "3004", "dc:identifier": "doi:10.1016/j.solener.2012.07.006", "openaccessSponsorName": null}, "objects": {"object": [{"@category": "thumbnail", "@height": "41", "@width": "262", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0038092X12002472-si1.gif?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "ALTIMG", "@size": "1480", "@ref": "si1", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "17", "@width": "34", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0038092X12002472-si3.gif?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "ALTIMG", "@size": "316", "@ref": "si3", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "17", "@width": "32", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0038092X12002472-si2.gif?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "ALTIMG", "@size": "315", "@ref": "si2", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "244", "@width": "324", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0038092X12002472-gr2.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "16915", "@ref": "gr2", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "164", "@width": "217", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0038092X12002472-gr2.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "6220", "@ref": "gr2", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "189", "@width": "478", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0038092X12002472-gr3.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "23465", "@ref": "gr3", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "87", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0038092X12002472-gr3.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "9618", "@ref": "gr3", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "171", "@width": "505", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0038092X12002472-gr4.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "18631", "@ref": "gr4", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "74", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0038092X12002472-gr4.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "7130", "@ref": "gr4", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "150", "@width": "515", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0038092X12002472-gr5.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "15762", "@ref": "gr5", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "64", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0038092X12002472-gr5.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "5855", "@ref": "gr5", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "247", "@width": "351", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0038092X12002472-gr6.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "23544", "@ref": "gr6", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "154", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0038092X12002472-gr6.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "5798", "@ref": "gr6", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "390", "@width": "355", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0038092X12002472-gr1.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "51848", "@ref": "gr1", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "164", "@width": "149", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0038092X12002472-gr1.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "9317", "@ref": "gr1", "@mimetype": "image/gif"}]}, "link": {"@rel": "abstract", "@href": "https://api.elsevier.com/content/abstract/scopus_id/84865722160"}}