{"scopus-eid": "2-s2.0-84894636406", "originalText": "serial JL 271987 291210 291718 291892 31 Materials Science in Semiconductor Processing MATERIALSSCIENCEINSEMICONDUCTORPROCESSING 2014-02-22 2014-02-22 2014-03-11T12:47:26 1-s2.0-S1369800114000407 S1369-8001(14)00040-7 S1369800114000407 10.1016/j.mssp.2014.01.030 S300 S300.1 FULL-TEXT 1-s2.0-S1369800114X00041 2015-05-15T05:55:30.776054-04:00 0 0 20140601 20140630 2014 2014-02-22T00:00:00Z articleinfo crossmark dco dateupdated tomb dateloaded datesearch indexeddate volumelist yearnav articletitlenorm authfirstinitialnorm authfirstsurnamenorm cid cids contenttype copyright dateloadedtxt docsubtype doctype doi eid ewtransactionid hubeid issn issnnorm itemstage itemtransactionid itemweight openaccess openarchive pg pgfirst pglast pii piinorm pubdateend pubdatestart pubdatetxt pubyr sectiontitle sortorder srctitle srctitlenorm srctype subheadings suppl volfirst volissue webpdf webpdfpagecount figure table body mmlmath acknowledge affil articletitle auth authfirstini authfull authkeywords authlast primabst ref alllist content subj ssids 1369-8001 13698001 true 22 22 C Volume 22 10 64 68 64 68 201406 June 2014 2014-06-01 2014-06-30 2014 Original Research Articles article fla Copyright © 2014 Elsevier Ltd. All rights reserved. STUDYDEFECTREMOVALETCHINGBLACKSILICONFORSOLARCELLS XIAO G 1 Introduction 2 Experimental 3 Results and discussion 4 Conclusions Acknowledgment References PARM 2002 97 105 I VAZSONYI 1999 179 188 E GONZALEZDIAZ 2009 295 298 B XIA 2011 1574 1578 Y KONTERMANN 2012 390 395 S DIMITROV 2013 1 4 D NOSITSCHKA 2003 227 237 W KUMARAVELU 2004 108 110 G LEE 2011 66 68 K YOO 2009 333 337 J ZHONG 2013 200 204 S MENNA 1995 13 24 P HADOBAS 2000 161 164 K SHIM 2012 J XIAOX2014X64 XIAOX2014X64X68 XIAOX2014X64XG XIAOX2014X64X68XG item S1369-8001(14)00040-7 S1369800114000407 1-s2.0-S1369800114000407 10.1016/j.mssp.2014.01.030 271987 2014-03-11T13:01:30.020882-04:00 2014-06-01 2014-06-30 1-s2.0-S1369800114000407-main.pdf https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S1369800114000407/MAIN/application/pdf/9941986d051ca1e1b597e86441041d7c/main.pdf https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1369800114000407/MAIN/application/pdf/9941986d051ca1e1b597e86441041d7c/main.pdf main.pdf pdf true 1213706 MAIN 5 1-s2.0-S1369800114000407-main_1.png https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S1369800114000407/PREVIEW/image/png/40ad6370fcd238537274a975c56bc187/main_1.png https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1369800114000407/PREVIEW/image/png/40ad6370fcd238537274a975c56bc187/main_1.png main_1.png png 52649 849 656 IMAGE-WEB-PDF 1 1-s2.0-S1369800114000407-si0001.gif https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S1369800114000407/STRIPIN/image/gif/29f25a5832dd50fd8dd840f3bcb04883/si0001.gif https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1369800114000407/STRIPIN/image/gif/29f25a5832dd50fd8dd840f3bcb04883/si0001.gif si0001 si0001.gif gif 1054 40 128 ALTIMG 1-s2.0-S1369800114000407-gr4.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S1369800114000407/gr4/DOWNSAMPLED/image/jpeg/6d1ba6cc0fdac4d18f1cb7aa7afc982d/gr4.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1369800114000407/gr4/DOWNSAMPLED/image/jpeg/6d1ba6cc0fdac4d18f1cb7aa7afc982d/gr4.jpg gr4 gr4.jpg jpg 27257 279 339 IMAGE-DOWNSAMPLED 1-s2.0-S1369800114000407-gr3.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S1369800114000407/gr3/DOWNSAMPLED/image/jpeg/b543d1e9ee0d6bd4487dee36b6803466/gr3.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1369800114000407/gr3/DOWNSAMPLED/image/jpeg/b543d1e9ee0d6bd4487dee36b6803466/gr3.jpg gr3 gr3.jpg jpg 35584 258 339 IMAGE-DOWNSAMPLED 1-s2.0-S1369800114000407-gr2.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S1369800114000407/gr2/DOWNSAMPLED/image/jpeg/8aed3b342be9a48630008c5483ce8e4a/gr2.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1369800114000407/gr2/DOWNSAMPLED/image/jpeg/8aed3b342be9a48630008c5483ce8e4a/gr2.jpg gr2 gr2.jpg jpg 125507 687 565 IMAGE-DOWNSAMPLED 1-s2.0-S1369800114000407-gr1.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S1369800114000407/gr1/DOWNSAMPLED/image/jpeg/f476a6104d7806263d60ce6fb32efec2/gr1.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1369800114000407/gr1/DOWNSAMPLED/image/jpeg/f476a6104d7806263d60ce6fb32efec2/gr1.jpg gr1 gr1.jpg jpg 39714 318 301 IMAGE-DOWNSAMPLED 1-s2.0-S1369800114000407-gr4.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S1369800114000407/gr4/THUMBNAIL/image/gif/17c186a634eed76d010ba974e84d8e32/gr4.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1369800114000407/gr4/THUMBNAIL/image/gif/17c186a634eed76d010ba974e84d8e32/gr4.sml gr4 gr4.sml sml 5214 164 199 IMAGE-THUMBNAIL 1-s2.0-S1369800114000407-gr3.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S1369800114000407/gr3/THUMBNAIL/image/gif/064077220863c3675791deae0870bff9/gr3.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1369800114000407/gr3/THUMBNAIL/image/gif/064077220863c3675791deae0870bff9/gr3.sml gr3 gr3.sml sml 6918 164 215 IMAGE-THUMBNAIL 1-s2.0-S1369800114000407-gr2.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S1369800114000407/gr2/THUMBNAIL/image/gif/359057f6bc47ec6b578ff9b1d614fb41/gr2.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1369800114000407/gr2/THUMBNAIL/image/gif/359057f6bc47ec6b578ff9b1d614fb41/gr2.sml gr2 gr2.sml sml 8109 164 135 IMAGE-THUMBNAIL 1-s2.0-S1369800114000407-gr1.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S1369800114000407/gr1/THUMBNAIL/image/gif/7eb5a2611e262ad08f4ea27054fe9b59/gr1.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1369800114000407/gr1/THUMBNAIL/image/gif/7eb5a2611e262ad08f4ea27054fe9b59/gr1.sml gr1 gr1.sml sml 10330 164 155 IMAGE-THUMBNAIL MATSCI 1825 S1369-8001(14)00040-7 10.1016/j.mssp.2014.01.030 Elsevier Ltd Fig. 1 The procedure of fabricating multicrystalline black silicon solar cell with nine steps. Fig. 2 SEM of microstructures of acid textured wafer and black silicon wafers with different DRE conditions. Fig. 3 Reflectance of all the wafers with conditions from C1 to C6 before deposition of SiN x layer. Fig. 4 Internal quantum efficiency of solar cells with conditions from C1 to C6. Table 1 Conditions of DRE process. Conditions Black silicon or not Solutions used in DRE Ratio of each component Etching time C1 No – – – C2 Yes HNO3+HF+H2O 20:1:35 (volume) 3min C3 Yes HNO3+HF+H2O 20:1:35 (volume) 4min C4 Yes NaNO2+HF+H2O 6.4g:10ml:240ml 20min C5 Yes NaNO2+HF+H2O 6.4g:10ml:240ml 30min C6 Yes – – – Table 2 Performance of solar cells of conditions from C1 to C6. V oc means the open circuit voltage. J sc is the short circuit current density. P mp is the maximal power. FF means the fill factor, and E ff is the photoelectric conversion efficiency. Conditions V oc (V) J sc (mA/cm2) P mp (W) FF (%) E ff (%) C1 0.617 35.11 4.075 77.27 16.74 C2 0.616 35.72 4.175 77.96 17.15 C3 0.618 35.77 4.184 77.71 17.19 C4 0.623 35.99 4.249 77.82 17.46 C5 0.617 35.74 4.158 77.45 17.09 C6 0.612 34.89 4.005 77.10 16.46 The study of defect removal etching of black silicon for solar cells Gao Xiao a b Bangwu Liu a ⁎ Jinhu Liu a Zheng Xu b a Key Laboratory of Microelectronics Devices & Integrated Technology, Institute of Microelectronics, Chinese Academy of Sciences, Beijing 100029,China Key Laboratory of Microelectronics Devices & Integrated Technology Institute of Microelectronics Chinese Academy of Sciences Beijing 100029 China b Institute of Solar Energy in School of Science, Beijing Jiaotong University, Beijing 100044, China Institute of Solar Energy in School of Science Beijing Jiaotong University Beijing 100044 China ⁎ Corresponding author. Tel.: +86 10 82995823; fax: +86 10 82995652. To enhance the absorption of incident light of solar cells, multicrystalline black silicon has been successfully fabricated by plasma immersion ion implantation using SF6 and O2. After that a defect removal etching (DRE) process under different conditions has been performed to slow down the surface recombination by decreasing surface area and plasma etching damage. The surface microstructures, reflectance and internal quantum efficiency have been investigated by a field emission scanning electron microscope, a spectrophotometer and a quantum efficiency measurement system, respectively. It is found that the height and density of nanohills on the surface of black silicon decreases with increase in time of DRE, and the surface reflectance decreases with increase in height and density of nanohills. The internal quantum efficiency(IQE) of solar cells with a DRE process shows a large improvement than that without a DRE process, so as the performance of conversion efficiency. The best performance of the solar cells with a DRE process shows the conversion efficiency, open circuit voltage and short circuit current density as high as 17.46%, 623mV and 35.99mA/cm2, showing an improvement of conversion efficiency of 0.72% than that of conventional acid textured cells. Keywords Black silicon Solar cell Defect removal etching Conversion efficiency 1 Introduction Reducing surface reflectance is a very important way to improve the efficiency of solar cells by enhancing light absorption. Generally, surface reflectance can be reduced by depositing an anti-reflection coating (ARC), such as SiN x [1]. However, surface texturing is a more effective way because it forms some permanent structures on the surface. For monocrystalline silicon, anisotropic etching in alkaline solution is widely used in experiments and industry to reduce surface reflectance by shaping randomly “pyramids” [2]. For multicrystalline silicon, isotropic etching in acid solution is an effective way and widely used technique [3]. The reflectance of monocrystalline silicon can be decreased as low as 11% after surface texturing, but it is still as high as 25% of multicrystalline silicon. To reduce surface reflectance furthermore, especially for multicrystalline silicon, nanostructures have been produced on the surface through all kinds of ways, which make black silicon wafer and so called “black silicon” [4]. There are several ways to fabricate black silicon. Kontermann et al. made a monocrystalline black silicon solar cell prototype through a femtosecond laser pulse process and obtained the highest efficiency of 4.5% without any emitter diffusion step [5]. Dimitrov and Du formed nanostructures through an electroless treatment in an acidic aqueous solution of Na2S2O8 and AgNO3 onto the random pyramids, and obtained the best solar cell with efficiency of 17.5% [6]. Reactive ion etching (RIE) and plasma immersion ion implantation (PIII) are other ways to form nanostructures widely used [7], but Kumaravelu et al. found that ion etching would bring defects in nanostructures, and nanostructures on the surface could enlarge the surface area obviously, which may decrease the minority carriers lifetime seriously [8]. This means that a defect removal etching (DRE) process is needed to improve the performance of black silicon solar cells. Lee et al. made black multicrystalline silicon solar cells by RIE progress with a DRE step, of which the efficiency can reach as high as 16.32% compared to 15.62% of conventional acid textured solar cells [9]. This proved that a DRE process could greatly improve the performance of black silicon solar cells [10]. In this paper, black silicon wafers have been made by plasma immersion ion implantation. To study the DRE process, different conditions of DRE have been established. All the wafers have been made for solar cells and the influence of different DRE processes will be investigated at length. 2 Experimental Commercially available p-type doped multicrystalline silicon wafers with thickness of 180–220μm and area of 156mm×156mm were used. Fig. 1 shows the procedure of fabricating multicrystalline black silicon solar cells. First, the saw damage removal (SDR) process was performed in 10% NaOH solution at 80°C. Then, black silicon was fabricated by a plasma immersion ion implantation process of all the wafers with the following conditions. The SF6/O2 gas ratio was 3:1, the radio frequency was 13.56MHz of which the power was 900W, the etching time was 4min and no DC bias voltage was used. After that, a DRE process with different conditions shown in Table 1 was performed to remove the surface defect at 23°C (the mass fractions of HNO3 and HF used are 70% and 40%, respectively). All the wafers were then phosphorus doped through a thermal diffusion process with POCl3 as the dopant source at a temperature of 825°C. Afterward, the edge etching process was performed in the environment of CF4 and O2 plasma for 40min, and a phosphosilicate glass (PSG) layer removal was realized by using HF solution with volume fraction of 10%. Silicon–nitride layer (SiN x ) with thickness of 80nm was then grown by plasma enhanced chemical vapor deposition (PECVD). Finally, back surface field (BSF) as well as front and back metallization was processed by a screen-printing technique, and then all the wafers were dealt with a co-firing process in a conveyer belt furnace. The microstructures of black silicon were investigated by a field emission scanning electron microscope (SEM). Surface reflectance in wavelength from 300nm to 1100nm was examined by a ultraviolet–visible–near infrared (UV–vis–NIR) spectrophotometer with an integrating sphere detector. The internal quantum efficiency (IQE) was measured by a Solar Cell Scan 100 quantum efficiency measurement system. 3 Results and discussion The microstructures of black silicon after the DRE process with different conditions are shown in Fig. 2. The surface of each wafer from C2 to C6 is covered by nanohills of different height and density. C1 has no nanohill because it is not dealt with a PIII process to make black silicon and just an acid textured wafer. C6 shows the original microstructures of black silicon with no DRE process, covered with nanohills having a very high density and height, which are formed by the competition of ion etching, passivation and bombardment [11]. It can be seen that the height and density of nanohills of black silicon wafers etched from C5 to C2 decrease while using different DRE conditions. The DRE process can be explained using two steps. First, the surface of silicon wafer can be oxidized by HNO3 or NaNO2 so that a film of oxide fabricates onto the surface. Then, the oxide film will be etched by HF, leading to reduction of density and height of the nanohills. The nanohills of black silicon wafers etched by C2 and C3 have a much lower density and height than that of wafers etched by C4 and C5. It can be explained that the oxidizability of HNO3 is much stronger than that of NaNO2. In addition, it is obvious that the more time the DRE process lasts, the lower the density and height of nanohills, no matter what kind of solutions is used. Surface reflectance of all the wafers after the DRE process has been measured by a UV–vis–NIR spectrophotometer with an integrating sphere detector over the wavelength ranging from 300nm to 1100nm, as shown in Fig. 3. The average reflectance is defined as [12] R a = ∫ 300 1100 R ( λ ) N ( λ ) d y ∫ 300 1100 N ( λ ) d y where R(λ) is the total reflectance, and N(λ) is the solar flux under AM1.5 standard conditions. It is found that black silicon without any DRE process has the lowest reflectance, of which the average reflectance is just 3.99%. After different DRE processes from C2 to C5, reflectance increased by various degrees, but was still much lower than that of acid textured wafer, of which the reflectance is as high as 25.31%. With increased etching time, the reflectance increased as well no matter which solutions were used in the DRE process. The average reflectance of wafers etched by C2 and C3 increased from 20.99% to 22.07%, and that of wafers etched by C4 and C5 increased from 13.39% to 15.62%, respectively. This can be explained by two factors. Firstly, the nanohills of black silicon could remarkably increase the reflected times, so that incident light has a lot more opportunities to be absorbed by the wafer. Secondly, a diffraction effect may exist to make the zero-order reflection very weak, as the dimension of the nanohills corresponds to the wavelength of incident light [13]. Obviously it can be seen that as the conditions change from C6 to C1, reflectance increases gradually. This phenomenon can be attributed to the decrease in the height and density of nanohills, leading to fewer reflected times and a weaker diffraction effect. Fig. 4 shows the internal quantum efficiency of solar cells made by silicon wafers with conditions from C1 to C6. It can be seen that the IQE of the solar cells dealt with a DRE process is much higher than that without a DRE process in wavelength between 300nm and 1100nm. This can be explained by two factors. Firstly, it is obvious that the black silicon solar cells without the DRE process have the largest surface area due to the highest density and height of nanohills. Commonly, the surface has a lot of effective recombination centers consisting of dangling bonds and traps, which could badly prevent the collection of carriers. The larger the surface area is, the more recombination centers will be. Secondly, the surface defect introduced by plasma etching during the black silicon fabrication progress may also become effective recombination centers. The DRE process can effectively clean these defects so that the collection of carriers can be greatly improved. We can see that the IQE of black silicon solar cells without the DRE process is even lower than that of acid textured cells. This proved that the surface recombination of black silicon solar cells without the DRE process is much more significant than conventional acid textured solar cells, though the reflectance is much lower. On the other hand, it can be seen that the IQE of the cells with different DRE processes is nearly the same. These phenomena can be explained by the following factors: the wafers etched by HNO3/HF have a higher reflectance, but lower surface damage; the wafers etched by NaNO2/HF have a lower reflectance, but relatively higher surface damage due to larger surface area. These two factors are in a balance so that the IQE of two conditions shows nearly no change. The performance of solar cells with different conditions from C1 to C6 is listed in Table 2. It can be seen that the solar cell with condition C4 has the best performance with the highest conversion efficiency, open circuit voltage and short circuit current density, of which the values are 17.46%, 623mV and 35.99mA/cm2, respectively. It is remarkable that this cell does not have the lowest reflectance. From this we can find that to obtain a higher conversion efficiency and a better performance, a balance between surface reflectance and recombination should be found. For black silicon solar cells, an extraordinary low surface reflectance consequentially leads to a very high recombination, due to the large surface area and plasma etching defect if PIII progress was taken. For example, the black silicon solar cell without any DRE process (C6) shows the lowest conversion efficiency which is only 16.46%, even lower than the acid textured solar cell with the efficiency of 16.74%. Compared to the acid textured cell, all the cells which dealt with the DRE process have a better performance, no matter which HNO3/HF or NaNO2/HF solutions were used. This result is proved by other studies as well. For example, Shim et al. [14] and some researchers found that solar cells dealt with an RIE process (similar to PIII) have a lower conversion efficiency than that of acid textured solar cells. After the DRE process, a large improvement in efficiency was seen. This is mainly owed to the improvement in IQE by a decrease in surface recombination and plasma etching defect. The best cell, C4, shows an improvement of conversion efficiency of 0.72% than that of acid textured solar cells. 4 Conclusions Black multicrystalline silicon has been successfully fabricated by plasma immersion ion implantation (PIII). A defect removal etching (DRE) process with different conditions has been taken subsequently. The height and density of nanohills on the surface decrease with increase in etching time. The surface reflectance of all the wafers decreases with increase in height and density of nanohills. All the wafers with different etching conditions have been made for solar cells. The IQE of cells with a DRE process shows a large improvement than that without a DRE process, owing to decrease in surface recombination and plasma etching defect. Besides, solar cells dealt with the DRE process show a better performance than that without theDRE process and that by acid textured solar cells. The best performance of solar cells shows the conversion efficiency, open circuit voltage and short circuit current density as high as 17.46%, 623mV and 35.99mA/cm2, respectively, of which the condition of DRE process is NaNO2/HF/H2O (6.4g:10ml:240ml) with etching time of 20min. Acknowledgment This work was supported by the National Natural Science Foundation of China (Grant no. 61106060), the Knowledge Innovation Program of the Chinese Academy of Sciences (Grant no. Y2YF028001) and the National High-tech R&D Program of China (Grant no. 2012AA052401). References [1] I.O Parm K. Kim D.G. Lim Sol. Energy Mater. Sol. Cells 74 1–4 2002 97 105 [2] E. Vazsonyi K. de Clercq R. Einhaus Sol. Energy Mater. Sol. Cells 57 2 1999 179 188 [3] B. Gonzalez-Diaz R. Guerrero-Lemus B. Diaz-Herrera Mater. Sci. Eng. B 159–160 2009 295 298 [4] Yang Xia Bangwu Liu Jie Liu Sol. Energy 85 7 2011 1574 1578 [5] S. Kontermann T. Gimpel A.L. Baumann Energy Proc. 27 2012 390 395 [6] Dimitre Z. Dimitrov Chen-Hsun Du Appl. Surf. Sci. 266 2013 1 4 [7] W.A. Nositschka O. Voigt P. Manshanden Sol. Energy Mater. Sol. Cells 80 2 2003 227 237 [8] G. Kumaravelu M.M. Alkaisi A. Bittarm Curr. Appl. Phys. 4 2–4 2004 108 110 [9] K. Lee Man-Hyo Ha J.H. Kim Sol. Energy Mater. Sol. Cells 95 1 2011 66 68 [10] J. Yoo G. Yu J. Yi Mater. Sci. Eng. B 159-160 2009 333 337 [11] Sihua Zhong Bangwu Liu Yang Xia Sol. Energy Mater. Sol. Cells 108 2013 200 204 [12] P. Menna G. Di Francia V. La Ferrara Sol. Energy Mater. Sol. Cells 37 1995 13 24 [13] K. Hadobas S. Kirsch A. Carl Nanotechnology 11 2000 161 164 [14] Ji-Myung Shim Hyun-Woo Lee Kyeong-Yeon Cho Int. J. Photoenergy 2012", "scopus-id": "84894636406", "coredata": {"eid": "1-s2.0-S1369800114000407", "dc:description": "To enhance the absorption of incident light of solar cells, multicrystalline black silicon has been successfully fabricated by plasma immersion ion implantation using SF6 and O2. After that a defect removal etching (DRE) process under different conditions has been performed to slow down the surface recombination by decreasing surface area and plasma etching damage. The surface microstructures, reflectance and internal quantum efficiency have been investigated by a field emission scanning electron microscope, a spectrophotometer and a quantum efficiency measurement system, respectively. It is found that the height and density of nanohills on the surface of black silicon decreases with increase in time of DRE, and the surface reflectance decreases with increase in height and density of nanohills. The internal quantum efficiency(IQE) of solar cells with a DRE process shows a large improvement than that without a DRE process, so as the performance of conversion efficiency. The best performance of the solar cells with a DRE process shows the conversion efficiency, open circuit voltage and short circuit current density as high as 17.46%, 623mV and 35.99mA/cm2, showing an improvement of conversion efficiency of 0.72% than that of conventional acid textured cells.", "openArchiveArticle": "false", "prism:coverDate": "2014-06-30", "openaccessUserLicense": null, "prism:aggregationType": "Journal", "prism:url": "https://api.elsevier.com/content/article/pii/S1369800114000407", "dc:creator": [{"@_fa": "true", "$": "Xiao, Gao"}, {"@_fa": "true", "$": "Liu, Bangwu"}, {"@_fa": "true", "$": "Liu, Jinhu"}, {"@_fa": "true", "$": "Xu, Zheng"}], "link": [{"@_fa": "true", "@rel": "self", "@href": "https://api.elsevier.com/content/article/pii/S1369800114000407"}, {"@_fa": "true", "@rel": "scidir", "@href": "https://www.sciencedirect.com/science/article/pii/S1369800114000407"}], "dc:format": "application/json", "openaccessType": null, "pii": "S1369-8001(14)00040-7", "prism:volume": "22", "prism:publisher": "Elsevier Ltd.", "dc:title": "The study of defect removal etching of black silicon for solar cells", "prism:copyright": "Copyright © 2014 Elsevier Ltd. All rights reserved.", "openaccess": "0", "prism:issn": "13698001", "dcterms:subject": [{"@_fa": "true", "$": "Black silicon"}, {"@_fa": "true", "$": "Solar cell"}, {"@_fa": "true", "$": "Defect removal etching"}, {"@_fa": "true", "$": "Conversion efficiency"}], "openaccessArticle": "false", "prism:publicationName": "Materials Science in Semiconductor Processing", "openaccessSponsorType": null, "prism:pageRange": "64-68", "prism:endingPage": "68", "pubType": "fla", "prism:coverDisplayDate": "June 2014", "prism:doi": "10.1016/j.mssp.2014.01.030", "prism:startingPage": "64", "dc:identifier": "doi:10.1016/j.mssp.2014.01.030", "openaccessSponsorName": null}, "objects": {"object": [{"@category": "thumbnail", "@height": "40", "@width": "128", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1369800114000407-si0001.gif?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "ALTIMG", "@size": "1054", "@ref": "si0001", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "279", "@width": "339", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1369800114000407-gr4.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "27257", "@ref": "gr4", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "258", "@width": "339", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1369800114000407-gr3.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "35584", "@ref": "gr3", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "687", "@width": "565", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1369800114000407-gr2.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "125507", "@ref": "gr2", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "318", "@width": "301", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1369800114000407-gr1.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "39714", "@ref": "gr1", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "164", "@width": "199", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1369800114000407-gr4.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "5214", "@ref": "gr4", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "164", "@width": "215", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1369800114000407-gr3.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "6918", "@ref": "gr3", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "164", "@width": "135", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1369800114000407-gr2.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "8109", "@ref": "gr2", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "164", "@width": "155", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1369800114000407-gr1.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "10330", "@ref": "gr1", "@mimetype": "image/gif"}]}, "link": {"@rel": "abstract", "@href": "https://api.elsevier.com/content/abstract/scopus_id/84894636406"}}