{"scopus-eid": "2-s2.0-84954482027", "originalText": "serial JL 271533 291210 291719 291720 291790 291893 291940 31 Applied Surface Science APPLIEDSURFACESCIENCE 2015-10-09 2015-10-09 2015-11-11 2015-11-11 2019-04-26T19:31:55 1-s2.0-S0169433215024332 S0169-4332(15)02433-2 S0169433215024332 10.1016/j.apsusc.2015.10.035 S300 S300.3 FULL-TEXT 1-s2.0-S0169433215X00328 2019-04-26T22:38:18.246725Z 0 0 20151201 2015 2015-10-09T01:28:19.822263Z absattachment articleinfo articletitlenorm authfirstinitialnorm authfirstsurnamenorm cid cids contenttype copyright crossmark dateloaded dateloadedtxt datesearch datesort dateupdated dco docsubtype doctype doi eid ewtransactionid hubeid indexeddate issn issnnorm itemstage itemtransactionid itemweight openaccess openarchive pg pgfirst pglast pii piinorm pubdatestart pubdatetxt pubyr sortorder srctitle srctitlenorm srctype ssids alllist content subj subheadings suppl tomb volfirst volissue volumelist webpdf webpdfpagecount yearnav figure table body mmlmath acknowledge affil articletitle auth authfirstini authfull authkeywords authlast grantnumber grantsponsor highlightsabst primabst ref specialabst 0169-4332 01694332 true 357 357 PB Volume 357, Part B 67 1830 1835 1830 1835 20151201 1 December 2015 2015-12-01 2015 article fla Copyright © 2015 Elsevier B.V. All rights reserved. HIGHLYEFFICIENTINDUSTRIALLARGEAREABLACKSILICONSOLARCELLSACHIEVEDBYSURFACENANOSTRUCTUREDMODIFICATION LI P 1 Introduction 2 Experimental 3 Results and discussion 4 Conclusion Acknowledgements References DOSHI 1997 7826 7837 P LUQUE 2011 A HANDBOOKPHOTOVOLTAICSCIENCEENGINEERING NAGEL 1999 245 260 H PREVO 2007 791 799 B PREMOLI 1994 2018 2024 A BRANZ 2009 231121 H KOYNOV 2006 203107 S SAI 2007 3333 H LI 2000 2572 X CAO 2011 7411 7414 Y SHEN 2004 5694 5696 M YOO 2010 730 734 J STRIEMER 2002 2980 2982 C OH 2012 743 748 J WANG 2013 9752 9759 W ZHAO 2014 714 719 Z KANE 1985 578 583 D PROC18THIEEEPHOTOVOLTAICSPECIALISTSCONFERENCEIEEEPVSCLASVEGAS MEASUREMENTEMITTERSATURATIONCURRENTBYACONTACTLESSPHOTOCONDUCTIVITYDECAYMETHOD MANKAD 2013 137 146 T KIMMERLE 2014 101 106 A FISCHER 2003 B LOSSANALYSISCRYSTALLINESILICONSOLARCELLSUSINGPHOTOCONDUCTANCEQUANTUMEFFICIENCYMEASUREMENTS LIX2015X1830 LIX2015X1830X1835 LIX2015X1830XP LIX2015X1830X1835XP 2017-11-11T00:00:00Z http://creativecommons.org/licenses/by-nc-nd/4.0/ item S0169-4332(15)02433-2 S0169433215024332 1-s2.0-S0169433215024332 10.1016/j.apsusc.2015.10.035 271533 2019-04-26T22:38:18.246725Z 2015-12-01 1-s2.0-S0169433215024332-main.pdf https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433215024332/MAIN/application/pdf/c4e8c58e8dde952f0fcb823ecd61aacb/main.pdf main.pdf pdf true 1866075 MAIN 6 1-s2.0-S0169433215024332-main_1.png https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433215024332/PREVIEW/image/png/2d2115d0ffa30c68a7de4f4251a7da5d/main_1.png main_1.png png 56995 849 656 IMAGE-WEB-PDF 1 1-s2.0-S0169433215024332-fx1.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433215024332/fx1/THUMBNAIL/image/gif/45cd75612d19e8e39aaa00ffc75306cb/fx1.sml fx1 true fx1.sml sml 16969 151 219 IMAGE-THUMBNAIL 1-s2.0-S0169433215024332-gr1.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433215024332/gr1/THUMBNAIL/image/gif/059790bbfc381d7a23ec9b617aed7704/gr1.sml gr1 gr1.sml sml 25125 164 166 IMAGE-THUMBNAIL 1-s2.0-S0169433215024332-gr2.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433215024332/gr2/THUMBNAIL/image/gif/576e693436962a29ad051c284dbf05ad/gr2.sml gr2 gr2.sml sml 37435 154 219 IMAGE-THUMBNAIL 1-s2.0-S0169433215024332-gr3.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433215024332/gr3/THUMBNAIL/image/gif/ad23c5bcc4615ff300b207462de1c5cd/gr3.sml gr3 gr3.sml sml 18476 163 107 IMAGE-THUMBNAIL 1-s2.0-S0169433215024332-gr4.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433215024332/gr4/THUMBNAIL/image/gif/8ec4bb2653254ca5ccdc1df47b68a1ac/gr4.sml gr4 gr4.sml sml 14526 164 109 IMAGE-THUMBNAIL 1-s2.0-S0169433215024332-gr5.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433215024332/gr5/THUMBNAIL/image/gif/b0fb47444aeb536ccb29bf7c63213f9b/gr5.sml gr5 gr5.sml sml 14196 163 219 IMAGE-THUMBNAIL 1-s2.0-S0169433215024332-gr6.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433215024332/gr6/THUMBNAIL/image/gif/597d443e55e28bec397e46cc907527f2/gr6.sml gr6 gr6.sml sml 16985 155 219 IMAGE-THUMBNAIL 1-s2.0-S0169433215024332-gr7.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433215024332/gr7/THUMBNAIL/image/gif/3ca60d1ae0b3103313ef32342c801750/gr7.sml gr7 gr7.sml sml 16544 158 219 IMAGE-THUMBNAIL 1-s2.0-S0169433215024332-fx1.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433215024332/fx1/DOWNSAMPLED/image/jpeg/2e1bad1a5c12e8948ebe700b01dc818b/fx1.jpg fx1 true fx1.jpg jpg 14861 200 289 IMAGE-DOWNSAMPLED 1-s2.0-S0169433215024332-gr1.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433215024332/gr1/DOWNSAMPLED/image/jpeg/9bc47fe100363c14be38f461b471ae96/gr1.jpg gr1 gr1.jpg jpg 75363 334 339 IMAGE-DOWNSAMPLED 1-s2.0-S0169433215024332-gr2.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433215024332/gr2/DOWNSAMPLED/image/jpeg/4200b78e6f2fbde1399a3bdb2695e131/gr2.jpg gr2 gr2.jpg jpg 103752 475 677 IMAGE-DOWNSAMPLED 1-s2.0-S0169433215024332-gr3.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433215024332/gr3/DOWNSAMPLED/image/jpeg/6d10a771d9569693776dd93a0de934f8/gr3.jpg gr3 gr3.jpg jpg 95084 599 393 IMAGE-DOWNSAMPLED 1-s2.0-S0169433215024332-gr4.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433215024332/gr4/DOWNSAMPLED/image/jpeg/1a82cc0169cf326aad4542bfa65d027d/gr4.jpg gr4 gr4.jpg jpg 89038 566 376 IMAGE-DOWNSAMPLED 1-s2.0-S0169433215024332-gr5.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433215024332/gr5/DOWNSAMPLED/image/jpeg/7db29ba2ec0b28ae85ba898085751eb7/gr5.jpg gr5 gr5.jpg jpg 44959 288 386 IMAGE-DOWNSAMPLED 1-s2.0-S0169433215024332-gr6.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433215024332/gr6/DOWNSAMPLED/image/jpeg/c504b0c050be21479113ae7161a953e6/gr6.jpg gr6 gr6.jpg jpg 50269 273 386 IMAGE-DOWNSAMPLED 1-s2.0-S0169433215024332-gr7.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433215024332/gr7/DOWNSAMPLED/image/jpeg/97975e8e378c3eceb37a635b4cc8a577/gr7.jpg gr7 gr7.jpg jpg 42973 272 376 IMAGE-DOWNSAMPLED 1-s2.0-S0169433215024332-fx1_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433215024332/fx1/HIGHRES/image/jpeg/c512ad3b6506c194c01e7eea8b089957/fx1_lrg.jpg fx1 true fx1_lrg.jpg jpg 136579 886 1281 IMAGE-HIGH-RES 1-s2.0-S0169433215024332-gr1_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433215024332/gr1/HIGHRES/image/jpeg/3ee78933b1cf05c81d744e968f811f03/gr1_lrg.jpg gr1 gr1_lrg.jpg jpg 361922 1479 1500 IMAGE-HIGH-RES 1-s2.0-S0169433215024332-gr2_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433215024332/gr2/HIGHRES/image/jpeg/e259c5e618cabb5a1b020666ec418332/gr2_lrg.jpg gr2 gr2_lrg.jpg jpg 789805 2101 2996 IMAGE-HIGH-RES 1-s2.0-S0169433215024332-gr3_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433215024332/gr3/HIGHRES/image/jpeg/de46177c9a3708a79247a0ac32b00368/gr3_lrg.jpg gr3 gr3_lrg.jpg jpg 594187 2655 1742 IMAGE-HIGH-RES 1-s2.0-S0169433215024332-gr4_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433215024332/gr4/HIGHRES/image/jpeg/b30808c1a2f358a00ce28d68f5633cea/gr4_lrg.jpg gr4 gr4_lrg.jpg jpg 664492 2509 1667 IMAGE-HIGH-RES 1-s2.0-S0169433215024332-gr5_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433215024332/gr5/HIGHRES/image/jpeg/e771fa5a42c4c3d1bd584988ca2cc5dc/gr5_lrg.jpg gr5 gr5_lrg.jpg jpg 209716 1274 1708 IMAGE-HIGH-RES 1-s2.0-S0169433215024332-gr6_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433215024332/gr6/HIGHRES/image/jpeg/3a4ada2594691d7ed4408af9f8aeffdb/gr6_lrg.jpg gr6 gr6_lrg.jpg jpg 219698 1207 1708 IMAGE-HIGH-RES 1-s2.0-S0169433215024332-gr7_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433215024332/gr7/HIGHRES/image/jpeg/40cdc18d85d046a716c999cee6914cb8/gr7_lrg.jpg gr7 gr7_lrg.jpg jpg 206256 1206 1667 IMAGE-HIGH-RES 1-s2.0-S0169433215024332-si1.gif https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433215024332/STRIPIN/image/gif/d15b85b49950a3dac1c8701fd2f85491/si1.gif si1 si1.gif gif 1352 38 345 ALTIMG 1-s2.0-S0169433215024332-si2.gif https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433215024332/STRIPIN/image/gif/5c333fa54898bac1d38fe6933232d54d/si2.gif si2 si2.gif gif 1138 40 223 ALTIMG 1-s2.0-S0169433215024332-si3.gif https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433215024332/STRIPIN/image/gif/2d5921f1be79b658e5f222d8c95f2400/si3.gif si3 si3.gif gif 985 40 222 ALTIMG 1-s2.0-S0169433215024332-si4.gif https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433215024332/STRIPIN/image/gif/f01f958e20d9df13ca007656ae0afef5/si4.gif si4 si4.gif gif 563 34 104 ALTIMG APSUSC 31516 S0169-4332(15)02433-2 10.1016/j.apsusc.2015.10.035 Elsevier B.V. Fig. 1 Processing sequences of our four solar cells presented in Table 1. The dashed boxes highlight the steps that were different in the four process flows. Fig. 2 (a) SEM images of silicon with pyramidal surface. (b) SEM images of silicon with nanotextured surface. (c) SEM images of silicon with nanotextured surface and additionally subjected to TMAH modification for 30s. (d) SEM images of silicon with nanotextured surface and additionally subjected to TMAH modification for 60s. The enlarged SEM images of nanopores structures are shown in the insets of b, c, and d (scale bars, 250nm). Fig. 3 Reflectance vs. wavelength curves: (a) pyramid-textured silicon, nanotextured silicon, nanotextured silicon with 30s TMAH modification, and nanotextured silicon with 60s TMAH modification. (b) Passivated by SiN x using the substrate sample in (a). Fig. 4 (a) Minority carrier lifetimes and (b) Auger corrected inverse effective lifetime as a function of injection level for nanotextured surface silicon with TMAH modification for 0s, 15s, 30s, 45s, and 60s. The samples are presented in Table 1. The solid line is the tangent line at the injection point to determine the saturation current density. The variation of saturation current densities as a function of modification time is shown in the inset of (b). Fig. 5 Evaluation of S eff (left y-axis) and S loc (right y-axis) as a function of TMAH modification time (bottom x-axis) and A Nano/A Micro (top x-axis). Fig. 6 I–V characteristic of the best nanotextured 156×156mm2 crystalline solar cells. Fig. 7 Internal quantum efficiency of reference solar cell, and solar cells that were nanotextured without TMAH modification and that were nanotextured with TMAH modification for 30s and 60s. Table 1 Summary of the average electrical parameters of reference solar cells (R), nanotextured solar cells without any modification (S1), nanotextured solar cells with 30s TMAH modification (S2) and nanotextured solar cells with 60s TMAH modification (S3). The average values are calculated from 5 to 10 cells. Group V OC (mV) J SC (mA/cm2) FF (%) η (%) S1 620.38±2.27 36.47±0.33 78.85±0.26 17.84±0.12 S2 636.73±0.36 37.81±0.08 78.92±0.16 19.00±0.04 S3 633.93±2.10 37.43±0.19 77.25±0.30 18.33±0.13 R 636.93±1.20 37.36±0.17 79.09±0.13 18.82±0.11 Highly efficient industrial large-area black silicon solar cells achieved by surface nanostructured modification Ping Li a Yi Wei a Zengchao Zhao a Xin Tan b Jiming Bian a Yuxuan Wang a Chunxi Lu c Aimin Liu a c ⁎ a School of Physics & Optoelectronic Engineering, Dalian University of Technology, Dalian, 116024, China School of Physics & Optoelectronic Engineering, Dalian University of Technology Dalian 116024 China b Jinzhou Huachang Photovoltaic Technology Co., Ltd., Jinzhou, 121000, China Jinzhou Huachang Photovoltaic Technology Co., Ltd. Jinzhou 121000 China c College of New Energy, Bohai University, Jinzhou, 121013, China College of New Energy, Bohai University Jinzhou 121013 China ⁎ Corresponding author at: School of Physics & Optoelectronic Engineering, Dalian University of Technology, Dalian, 116024, China. Tel.: +86 411 84709285; fax: +86 411 84709285. Graphical abstract SEM images of silicon with nanotextured surface and additionally subjected to TMAH modification for 30s. Traditional black silicon solar cells show relatively low efficiencies due to the high surface recombination occurring at the front surfaces. In this paper, we present a surface modification process to suppress surface recombination and fabricate highly efficient industrial black silicon solar cells. The Ag-nanoparticle-assisted etching is applied to realize front surface nanostructures on silicon wafers in order to reduce the surface reflectance. Through a further tetramethylammonium hydroxide (TMAH) treatment, the carrier recombination at and near the surface is greatly suppressed, due to a lower surface dopant concentration after the surface modification. This modified surface presents a low reflectivity in a range of 350–1100nm. Large-area solar cells with an average conversion efficiency of 19.03% are achieved by using the TMAH treatment of 30s. This efficiency is 0.18% higher than that of standard silicon solar cells with pyramidal surfaces, and also a remarkable improvement compared with black silicon solar cells without TMAH modifications. Keywords Solar cell Black silicon Nanostructure TMAH modification 1 Introduction Surface texturing and antireflection coating on the front surface are known to be very important to reduce the surface reflection and thereby enhance the efficiency of solar cells. Conventionally, a random pyramidal structure formed by wet anisotropic potassium hydroxide (KOH) etching combined with surface antireflection coatings (ARCs) like silicon nitride (SiN x ) based on interference is the industrial method used to reduce the reflection of mono-crystalline silicon surface [1,2]. However, the SiN x ARCs deposited on pyramidal structures works only in a narrow spectral range, around 600nm, and at small angles of incident photons [2–5]. Recently, the black silicon has drawn great attention for nearly ideal photo-absorption across the solar spectrum. The near-zero reflection is obtain by forming the layer with gradually varying refractive index between the air and silicon surface, which is due to the fact that the surface nanostructures are smaller than the incident light wavelength [6–8]. Several methods have been used to fabricate black silicon, including metal-assisted etching [9,10], laser-induced etching [11], reactive-ion etching [12] and electro-chemical etching [13]. In the past, several authors reported improvements in the conversion efficiency of P-type black silicon solar cells. Oh et al. reported 18.2% efficient silicon solar cells on 0.8081cm2 float zone (FZ) material, without any antireflection coating layer [14]. Wang et al. presented a 0.92cm2-large p-type black silicon solar cells passivated with ALD Al2O3 with an efficiency of 18.2% [15]. Our group has previously developed a 17.3%-efficient 156×156mm2-large black silicon solar cells using metal-nanoparticle-assisted chemical etching without any antireflection coating layer [16]. The black silicon solar cell structure has potential for achieving high efficiencies in mass production for nearly ideal photo-absorption across the solar spectrum. However, at present, the efficiency of “black silicon” solar cells is far lower than the commercially available silicon solar cells with the same process except the surface texture method, which is due to increasing surface recombination and Auger recombination as a result of the large surface area and high doping concentration [14,16]. In this paper, the nanotextured front surface, fabricated using Ag nanoparticles after anisotropic KOH etching, is used to reduce the reflectance of silicon surface. The tetramethylammonium hydroxide (TMAH) is added to modify the surface of nanotextured silicon and control the dopant concentration of the emitter. We optimize the process for large-area mono-crystalline solar cell with nanotextured surface, and achieved a conversion efficiency up to 19.03% for a large 156×156mm2 mono-crystalline solar cell with nanotextured surface. 2 Experimental As base material, we used 156×156mm2-large p-type Czochralski (CZ) silicon wafers with resistivity of 1–3Ωcm and thickness of 200±10μm. After the saw damage removal, all wafers were immersed into aqueous alkaline solutions with KOH (2wt%) and IPA (2wt%) at 80°C for 25min to form pyramidal structures. After the pyramid-texturing process, the wafers were arranged as back-to-back and immersed into 5wt% hydrofluoric acid (HF) solution for 30s and then immersed in deionized (DI) water. Thus, etching resulted in formation of the nanostructure only on the front surface of the wafers. The Ag nanoparticles were electroless-deposited on the silicon surface by immersing the wafer in 0.001mol/L AgNO3 and 1vol% HF solution for 90s. Then the wafer covered by Ag nanoparticles was immersed in a mixed solution of 10vol% HF and 2vol% hydrogen peroxide (H2O2) and DI water for 25s to form the nanostructure silicon surface. Afterward, the wafers were immersed into the solution containing NH4OH:H2O2:DI in a 1:1:5 volume ratio volume for 5min to remove Ag nanoparticles. After clean the wafer, phosphorus diffusion was carried out in a standard industrial diffusion furnace with optimized process and the edge isolation etching was made by reactive ion etching. The phosphosilicate glass (PSG) layer, formed during diffusion, was removed by 5wt% HF solution. Subsequently, a 0.05% TMAH solution was used for treatment for 30s or 60s to modify the nanostructures and reduce the surface phosphorus doping concentration. The SiN x coating was deposited by plasma enhanced chemical vapor deposition (PECVD). The front and back metallization of passivated black silicon wafers were carried out using standard screen-printing with Ag-paste and Al-paste respectively, followed by co-firing in a lamp-heated belt furnace. In addition, we also produce some traditional pyramid-textured silicon solar cells with standard production process. The complete cell fabrication process flow is shown in Fig. 1 . Finally, we produced four kinds of silicon solar cells: traditional pyramid-textured silicon solar cells as reference (group R), nanotextured solar cells without any modification (group S1), nanotextured solar cells with 30s TMAH modification (group S2) and nanotextured solar cells with 60s TMAH modification (group S3). The surface morphology of black silicon was analyzed using a Hitachi S-4800 field emission scanning electron microscope (FESEM), and the silicon surface reflection was measured with a Varian Cary 6000i spectrometer using an integrating sphere. The passivated wafers were characterized by quasi-steady-state photoconductance (QSSPC) instrument (WCT-120 by Siton Consulting) at an injection level of Δn =1015 cm3. The quantum efficiencies and photovoltaic conversion efficiencies of these solar cells were tested by Quality Supervision & Testing Center of Chemical and Physical Power Sources of Ministry of Information Industry. 3 Results and discussion For comparison, the cross-sectional SEM images of the Si wafers subjected to KOH texturing and Ag-assisted etching, and that have modified nanostructures are both presented. Fig. 2(a) is a SEM image of pyramid-textured silicon obtained by etching in alkaline solution. Fig. 2(b) shows the SEM image of nanostructure of black silicon without any modification. It can be seen that the nanopores with a depth of 150–250nm and a diameter less than 50nm are formed on the pyramid-textured surface. As shown in Fig. 2(c–d), a majority of the pores of the nanotextured silicon surface modified by 30s TMAH treatment are about 80nm in depth and 150–250nm in diameter, as for the surface modified by 60s TMAH, the depth of the pores decreased to less than 50nm and the diameter increased to 300–400nm. It can be seen that the nanotextured surface area decreases with the TMAH modification because of the reduction in the depth and increase in the pore diameter. Fig. 3(a) shows the reflectance of pyramid-textured silicon surface, nanotextured silicon surface after 30s TMAH modification, nanotextured silicon surface after 60s TMAH modification and nanotextured silicon surface without any modification. The reflectance of the nanotextured silicon wafers are apparently lower than that of the pyramid-textured silicon wafer among the whole wavelength range. The solar-spectrum-weighted average reflectance in the entire wavelength range between 350 and 1100nm, is 11.3% and 3.9% for pyramid-textured and nanotextured Si wafer, respectively. This is a consequence of the equivalent to a graded index of refraction between air and silicon wafer, when the nanotextured structures are smaller than the wavelength of incident light [6–10]. The average reflectance of nanotextured Si wafer is increased to 6.89% and 9.14% after TMAH treatment for 30s and 60s, respectively. It is a high reflectance for the so-called “black silicon”, but it is still much smaller than the reflectance of the pyramid-textured silicon. Fig. 3(b) shows the reflectance of wafers after the phosphorus diffusion and passivation. SiN x film was still applied as the passivation coating and further ARCs combination with nanostructures on surface, resulting in reduced reflectance. We found that the SiN x film based on quarter-wave-length layers deposited on pyramided silicon wafer perform well only in the wavelength range between 550 and 700nm (<3.5%) and the average reflectance is 5.33% in the wavelength range between 350 and 1100nm. The SiN x coating also reduced the reflectance of nanotextured silicon wafers. The average reflectance in the wavelength range between 350 and 1100nm was 3.78% and decreased to 2.16% after the SiN x film was deposited. The average reflectance of the nanotextured wafer subjected to TMAH modification for 30s and 60s was further reduced to 3.51% and 4.58%, respectively. We found that the wafers exhibit a low reflectance because of the combination of the SiN x films and the nanotextured silicon. The effective carrier lifetime and the emitter saturation current for the wafer were used to characterize the influence of the surface modification with TMAH solution. The test wafers with phosphorus diffusion and SiN x passivation on both sides were utilized in the measurements of the effective carrier lifetime. Here, we introduce an enlargement area factor, defined as A Nano/A Micro, where A Nano is the effective area of the nanotextures and A Micro is the area of pyramid surface [14]. Fig. 4(a) shows how the effective carrier lifetime increases with the TMAH modification time. At an injection level of 1015 cm−3, the lifetime of nanotextured wafer was only 16.74μs. The lifetimes of wafers were increased to 35.76μs, 42.0μs, 45.93μs and 49.83μs after etching in TMAH solution for 15s, 30s, 45s and 60s, respectively. An significantly increase in the effective carrier lifetime was observed, probably as a result of the decrease in the surface area and the suppression of carrier recombination at the emitter region due to the lower dopant concentration. The effective lifetime for samples can be expressed as follows [17,18]: (1) 1 τ eff − 1 τ Auger = 1 τ SRH + J 0 e ( front ) + J 0 e ( back ) N A + Δ n q n i 2 W where, τ Auger and τ SRH is the bulk Auger lifetime and bulk Shockley–Read–Hall (SRH) lifetime, respectively. N A is the dopant density of the wafer, Δn is the excess carrier concentration, n i is the intrinsic carrier density and W is the wafer thickness. J 0e(front) and J 0e(back) are the saturation current densities of the front and back emitter regions, respectively. J 0e can be calculate by the derivative of the (τ eff − τ Auger), provided that the measurement is taken in high injection where τ SRH is constant. In the case of double side nanotextured, diffused and passivated samples, J 0e = J 0e(front)= J 0e(back). So J 0e can be calculate by [19,20]: (2) J 0 e = q n i 2 W 2 d d Δ n 1 τ eff − 1 τ Auger Fig. 4(b) shows the saturation current density of nanotextured wafer with and without TMAH modification. It can be seen that the J 0e decrease with the modification time within 60s. The value of J 0e decreased sharply at modification time 15s, and then decreased with further increasing the modification time. The J 0e of nanotextured sample was 754fA/cm2, and then decreased to 420fA/cm2, 322fA/cm2, 285fA/cm2 and 270fA/cm2 after 15s, 30s, 45s and 60s TMAH modification. The decrease of J 0e indicates that lower recombination in emitter region or surface. The emitter can be defined as a virtual surface positioned at the edge of the depletion region, and emitter recombination can be considered as a special case of surface recombination (S eff) [20]: (3) S eff = S eff F = S eff B ≈ J 0 e N A + Δ n q n i 2 S eff as function of the modification time is shown in Fig. 5 , S eff can be counted as follows [14]: (4) S eff = A Nano A Micro S loc where S loc is the local effective surface recombination velocity, which includes recombination at the surface and the doped region near the surface. If the effective surface recombination velocity is independent of the enlargement in the surface area, S loc of samples without TMAH modification and with different modification time will be similar. Fig. 5 shows the S eff and S loc as function of different modification time within 60s. It clearly shows that S eff decreases with the increase of modification time within 60s. The variation of S eff as function of modification time reduces as modification time increases. As shown in Fig. 5, it was found that the value of S loc decrease from 185cm/s to 127cm/s after 15s TMAH modification, and then decrease to 112cm/s after another 15s. This result confirmed our assumption that the increase of τ eff is due to both of the reduction of surface area and the suppression of Auger recombination in emitter by TMAH modification. The value of S loc does not change significantly with the increase in the modification time to 45s. Our results showed that the optimized modification time is around 30s, at this time, the P dopant concentration was significantly reduced. The value of S loc increased to 132cm/s with 60s TMAH modification, which is due to non-uniformity in the surface emitter for the over surface etching. Table 1 shows the open circuit voltage (V OC), short circuit current density (J SC), fill-factor (FF), and efficiency (η) of group S1, group S2, group S3 and the group R measured under AM 1.5G. We found that the V OC, J SC and η of the group S2 were enhanced 16.35mV, 1.34mA/cm2 and 1.16% (absolute) compared with group S1, though group S2 showed lower reflectance. A high V OC was achieved due to (a) the reduced surface recombination owing to the decrease in surface area after TMAH modification and (b) the suppression of the Auger recombination in the emitter, which was because of the removal of the “dead layer” using the TMAH solution. This suppression of recombination has positive influence on the passivation of group S2 cells and enhances the collection efficiency of electrons, which results in a higher J SC and η. However, the η of group S3 decreased to 18.33% due to the slightly decrease in V OC, J SC and the sharply decrease in FF. The decrease of J SC could be attributed to the reduction of absorption at surface region for the excessively etching time. The low fill factor was caused by the increase in the series resistance owing to the high sheet resistance (over 120Ω/□). We also prepared an industry-standard mono-crystalline solar cell with pyramid-textured surface, and the electrical performance was presented in Table 1. The J SC and η of our best black silicon solar cells with TMAH modification are higher than those of the industrial-standard mono-crystalline solar cell, which could be attributed to the lower reflectance of the black silicon solar cells. A nanotextured silicon solar cells has achieved a 19.03% (V OC =0.638V, J SC =9.05A, FF=78.80%) efficiency on 156×156mm2 crystalline silicon wafer. The I–V characteristic is shown in Fig. 6 . Fig. 7 shows the IQE of the group S1, S2, S3 and R as a function of wavelength range between 350 and 1100nm. It also shows an appreciable difference in the wavelength range between 350 and 650nm between the group S1 and others. The higher dopant concentration in the emitter of group S1, increases the photons absorbed in the emitter and space charge region, which corresponds to an incident wavelength between 350 and 650nm [14]. The IQE of group S2 and group S3 were improved in the wavelength range between 350 and 650nm, suggesting that TMAH modification effectively suppress the emitter carrier recombination. Fig. 7 shows a similar IQE between groups S2 and S3, the IQE was slightly enhanced after additional 30s TMAH modification. Compared to standard pyramid-textured solar cells (group R), the nanotextured solar cells subjected to TMAH modification (groups S2 and S3) have lower IQE in the wavelength between 350 and 450nm, because of the enhanced surface recombination due to the enlarged surface area. 4 Conclusion Nano-textured front silicon surface and emitter modification were realized using TMAH solution after phosphorus diffusion. Significant improvements in V OC and J SC were observed leading to increased solar cell efficiency for modified nanotextured surface compared to the traditional nanotextured surface. We found that the Auger recombination in nanotextured emitters is very high because of the high dopant concentration due to the large bare surface region instead of the pyramid-textured surface in diffusion. The TMAH solution is used to reduce the surface area and suppress the Auger recombination in emitter after phosphorus diffusion. An increase of 1.16% in cell efficiency was achieved with a gain of 16.34mV in V OC and 1.34mA/cm2 in J SC. This was achieved by the reduction in the Auger recombination in emitter and the decreases in the surface area. Finally, our best solar cells with nanotextured front surface exhibit higher conversion efficiency than traditional pyramid-textured mono-crystalline silicon solar cells. Nano-textured front surface silicon therefore presents great potential for industrial applications. Acknowledgements The authors would like to thank Lili Wang for the SEM measurements and Tao Hu for the EQE measurements. This work is supported by National High-tech R &D Program of China (863 Program) under Grant No.2011AA050516. References [1] P. Doshi G.E. Jellison A. Rohatgi Characterization and optimization of absorbing plasma-enhanced chemical vapor deposited antireflection coatings for silicon photovoltaics Appl. Opt. 36 1997 7826 7837 [2] A. Luque S. Hegedus Handbook of Photovoltaic Science and Engineering 2011 John Wiley & Sons [3] H. Nagel A.G. Aberle R. Hezel Optimised antireflection coatings for planar silicon solar cells using remote PECVD silicon nitride and porous silicon dioxide Prog. Photovolt. 7 1999 245 260 [4] B.G. Prevo E.W. Hon O.D. Velev Assembly and characterization of colloid-based antireflective coatings on multicrystalline silicon solar cells J. Mater. Chem. 17 2007 791 799 [5] A. Premoli M.L. Rastello Minimax refining of wideband antireflection coatings for wide angular incidence Appl. Opt. 33 1994 2018 2024 [6] H.M. Branz V.E. Yost S. Ward K.M. Jones B. To P. Stradins Nanostructured black silicon and the optical reflectance of graded-density surfaces Appl. Phys. Lett. 94 2009 231121 [7] S. Koynov M.S. Brandt M. Stutzmann Black nonreflecting silicon surfaces for solar cells Appl. Phys. Lett. 88 2006 203107 [8] H. Sai H. Fujii K. Arafune Y. Ohshita Y. Kanamori H. Yugami M. Yamaguchi Wide-angle antireflection effect of subwavelength structures for solar cells Jpn. J. Appl. Phys. 46 2007 3333 [9] X. Li P.W. Bohn Metal-assisted chemical etching in HF/H[sub 2]O[sub 2] produces porous silicon Appl. Phys. Lett. 77 2000 2572 [10] Y. Cao A. Liu H. Li Y. Liu F. Qiao Z. Hu Y. Sang Fabrication of silicon wafer with ultra low reflectance by chemical etching method Appl. Surf. Sci. 257 2011 7411 7414 [11] M. Shen C.H. Crouch J.E. Carey E. Mazur Femtosecond laser-induced formation of submicrometer spikes on silicon in water Appl. Phys. Lett. 85 2004 5694 5696 [12] J. Yoo Reactive ion etching (RIE) technique for application in crystalline silicon solar cells Sol. Energy 84 2010 730 734 [13] C.C. Striemer P.M. Fauchet Dynamic etching of silicon for broadband antireflection applications Appl. Phys. Lett. 81 2002 2980 2982 [14] J. Oh H.C. Yuan H.M. Branz An 18.2%-efficient black-silicon solar cell achieved through control of carrier recombination in nanostructures Nat. Nanotechnol. 7 2012 743 748 [15] W.-C. Wang C.-W. Lin H.-J. Chen C.-W. Chang J.-J. Huang M.-J. Yang B. Tjahjono J.-J. Huang W.-C. Hsu M.-J. Chen Surface passivation of efficient nanotextured black silicon solar cells using thermal atomic layer deposition ACS Appl. Mater. Interfaces 5 2013 9752 9759 [16] Z. Zhao P. Li Y. Wei C. Lu X. Tan A. Liu 17.3% efficient black silicon solar cell without dielectric antireflection coating Sol. Energy 110 2014 714 719 [17] D.E. Kane R.M. Swanson Measurement of the emitter saturation current by a contactless photoconductivity decay method Proc. 18th IEEE Photovoltaic Specialists Conference (IEEE PVSC), Las Vegas 1985 578 583 [18] T. Mankad R.A. Sinton J. Swirhun A. Blum Inline bulk-lifetime prediction on as-cut multicrystalline silicon wafers Energy Proced. 38 2013 137 146 [19] A. Kimmerle P. Rothhardt A. Wolf R.A. Sinton Increased reliability for J0-analysis by QSSPC Energy Proced. 55 2014 101 106 [20] B. Fischer Loss Analysis of Crystalline Silicon Solar Cells Using Photoconductance and Quantum Efficiency Measurements 2003 Cuvillier", "scopus-id": "84954482027", "coredata": {"eid": "1-s2.0-S0169433215024332", "dc:description": "Traditional black silicon solar cells show relatively low efficiencies due to the high surface recombination occurring at the front surfaces. In this paper, we present a surface modification process to suppress surface recombination and fabricate highly efficient industrial black silicon solar cells. The Ag-nanoparticle-assisted etching is applied to realize front surface nanostructures on silicon wafers in order to reduce the surface reflectance. Through a further tetramethylammonium hydroxide (TMAH) treatment, the carrier recombination at and near the surface is greatly suppressed, due to a lower surface dopant concentration after the surface modification. This modified surface presents a low reflectivity in a range of 350–1100nm. Large-area solar cells with an average conversion efficiency of 19.03% are achieved by using the TMAH treatment of 30s. This efficiency is 0.18% higher than that of standard silicon solar cells with pyramidal surfaces, and also a remarkable improvement compared with black silicon solar cells without TMAH modifications.", "openArchiveArticle": "false", "prism:coverDate": "2015-12-01", "openaccessUserLicense": null, "prism:aggregationType": "Journal", "prism:url": "https://api.elsevier.com/content/article/pii/S0169433215024332", "dc:creator": [{"@_fa": "true", "$": "Li, Ping"}, {"@_fa": "true", "$": "Wei, Yi"}, {"@_fa": "true", "$": "Zhao, Zengchao"}, {"@_fa": "true", "$": "Tan, Xin"}, {"@_fa": "true", "$": "Bian, Jiming"}, {"@_fa": "true", "$": "Wang, Yuxuan"}, {"@_fa": "true", "$": "Lu, Chunxi"}, {"@_fa": "true", "$": "Liu, Aimin"}], "link": [{"@_fa": "true", "@rel": "self", "@href": "https://api.elsevier.com/content/article/pii/S0169433215024332"}, {"@_fa": "true", "@rel": "scidir", "@href": "https://www.sciencedirect.com/science/article/pii/S0169433215024332"}], "dc:format": "application/json", "openaccessType": null, "pii": "S0169-4332(15)02433-2", "prism:volume": "357", "prism:publisher": "Elsevier B.V.", "dc:title": "Highly efficient industrial large-area black silicon solar cells achieved by surface nanostructured modification", "prism:copyright": "Copyright © 2015 Elsevier B.V. All rights reserved.", "openaccess": "0", "prism:issn": "01694332", "dcterms:subject": [{"@_fa": "true", "$": "Solar cell"}, {"@_fa": "true", "$": "Black silicon"}, {"@_fa": "true", "$": "Nanostructure"}, {"@_fa": "true", "$": "TMAH modification"}], "openaccessArticle": "false", "prism:publicationName": "Applied Surface Science", "openaccessSponsorType": null, "prism:pageRange": "1830-1835", "prism:endingPage": "1835", "pubType": "fla", "prism:coverDisplayDate": "1 December 2015", "prism:doi": "10.1016/j.apsusc.2015.10.035", "prism:startingPage": "1830", "dc:identifier": "doi:10.1016/j.apsusc.2015.10.035", "openaccessSponsorName": null}, "objects": {"object": [{"@category": "thumbnail", "@height": "151", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433215024332-fx1.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "16969", "@ref": "fx1", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "164", "@width": "166", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433215024332-gr1.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "25125", "@ref": "gr1", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "154", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433215024332-gr2.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "37435", "@ref": "gr2", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "163", "@width": "107", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433215024332-gr3.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "18476", "@ref": "gr3", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "164", "@width": "109", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433215024332-gr4.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "14526", "@ref": "gr4", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "163", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433215024332-gr5.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "14196", "@ref": "gr5", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "155", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433215024332-gr6.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "16985", "@ref": "gr6", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "158", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433215024332-gr7.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "16544", "@ref": "gr7", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "200", "@width": "289", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433215024332-fx1.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "14861", "@ref": "fx1", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "334", "@width": "339", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433215024332-gr1.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "75363", "@ref": "gr1", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "475", "@width": "677", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433215024332-gr2.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "103752", "@ref": "gr2", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "599", "@width": "393", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433215024332-gr3.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "95084", "@ref": "gr3", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "566", "@width": "376", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433215024332-gr4.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "89038", "@ref": "gr4", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "288", "@width": "386", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433215024332-gr5.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "44959", "@ref": "gr5", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "273", "@width": "386", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433215024332-gr6.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "50269", "@ref": "gr6", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "272", "@width": "376", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433215024332-gr7.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "42973", "@ref": "gr7", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "886", "@width": "1281", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433215024332-fx1_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "136579", "@ref": "fx1", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "1479", "@width": "1500", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433215024332-gr1_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "361922", "@ref": "gr1", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "2101", "@width": "2996", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433215024332-gr2_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "789805", "@ref": "gr2", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "2655", "@width": "1742", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433215024332-gr3_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "594187", "@ref": "gr3", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "2509", "@width": "1667", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433215024332-gr4_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "664492", "@ref": "gr4", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "1274", "@width": "1708", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433215024332-gr5_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "209716", "@ref": "gr5", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "1207", "@width": "1708", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433215024332-gr6_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "219698", "@ref": "gr6", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "1206", "@width": "1667", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433215024332-gr7_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "206256", "@ref": "gr7", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "38", "@width": "345", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433215024332-si1.gif?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "ALTIMG", "@size": "1352", "@ref": "si1", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "40", "@width": "223", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433215024332-si2.gif?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "ALTIMG", "@size": "1138", "@ref": "si2", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "40", "@width": "222", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433215024332-si3.gif?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "ALTIMG", "@size": "985", "@ref": "si3", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "34", "@width": "104", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433215024332-si4.gif?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "ALTIMG", "@size": "563", "@ref": "si4", "@mimetype": "image/gif"}]}, "link": {"@rel": "abstract", "@href": "https://api.elsevier.com/content/abstract/scopus_id/84954482027"}}