{"scopus-eid": "2-s2.0-84857786398", "originalText": "serial JL 271495 291210 291731 291732 291746 291809 291864 291865 291892 291893 31 Solar Energy Materials and Solar Cells SOLARENERGYMATERIALSSOLARCELLS 2011-05-20 2011-05-20 2012-02-29T01:54:31 1-s2.0-S0927024811002601 S0927-0248(11)00260-1 S0927024811002601 10.1016/j.solmat.2011.05.003 S300 S300.1 FULL-TEXT 1-s2.0-S0927024812X00035 2015-05-15T03:20:14.179583-04:00 0 0 20120501 20120531 2012 2011-05-20T00:00:00Z articleinfo crossmark dco dateupdated tomb dateloaded datesearch indexeddate volumelist yearnav absattachment articletitlenorm authfirstinitialnorm authfirstsurnamenorm cid cids confeditor contenttype copyright dateloadedtxt docsubtype doctype doi eid ewtransactionid hubeid issn issnnorm itemstage itemtransactionid itemweight openaccess openarchive pg pgfirst pglast pii piinorm pubdateend pubdatestart pubdatetxt pubyr sectiontitle sortorder srctitle srctitlenorm srctype subheadings suppl vol volfirst volissue webpdf webpdfpagecount figure table body mmlmath acknowledge affil articletitle auth authfirstini authfull authkeywords authlast primabst ref specialabst alllist content subj ssids 0927-0248 09270248 100 100 C Volume 100 7 33 38 33 38 201205 May 2012 2012-05-01 2012-05-31 2012 Photovoltaics, Solar Energy Materials, and Technologies: Cancun 2010 Xavier Mathew Special Issue Articles article fla Copyright © 2011 Elsevier B.V. All rights reserved. SILVERCATALYZEDNANOTEXTURINGSILICONSURFACESFORSOLARCELLAPPLICATIONS SRIVASTAVA S 1 Introduction 2 Experimental details 2.1 Sample preparation 2.2 Solar cell fabrication 3 Results and discussion 3.1 Nano-texturing 3.2 I–V measurements 3.3 IQE and LBIC measurements 4 Conclusion Acknowledgement References GREEN 1995 M SILICONSOLARCELLSADVANCEDPRINCIPLESPRACTICE RICHARDS 2004 253 281 B ZHAO 1998 1991 1993 J SINGH 2001 103 113 P MENNA 1995 13 24 P KANAMORI 1999 1422 1424 Y HADOBAS 2000 161 164 K BODEN 2008 133108 133110 S CHOW 1987 1281 1286 T SAI 2006 201116(1) 201116(3) H WANG 2007 061105(1) 061105(3) S SUN 2007 231105(1) 231105(3) C ZHANG 2006 1440 1443 G KOYNOV 2006 203107(1) 203107(3) S GANDHI 2009 S VLSIFABRICATIONPRINCIPLESSILICONGALLIUMARSENIDE SRIVASTAVA 2010 1506 1511 S BRANZ 2009 231121(1) 231121(3) H KUMAR 2010 2267 2276 D LI 2000 2572 2574 X SPROUL 1994 2851 2854 A SRIVASTAVAX2012X33 SRIVASTAVAX2012X33X38 SRIVASTAVAX2012X33XS SRIVASTAVAX2012X33X38XS item S0927-0248(11)00260-1 S0927024811002601 1-s2.0-S0927024811002601 10.1016/j.solmat.2011.05.003 271495 2012-03-03T01:09:35.248581-05:00 2012-05-01 2012-05-31 1-s2.0-S0927024811002601-main.pdf https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024811002601/MAIN/application/pdf/da6428cded7f0eaced961a4611eba8a0/main.pdf https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024811002601/MAIN/application/pdf/da6428cded7f0eaced961a4611eba8a0/main.pdf main.pdf pdf true 1064595 MAIN 6 1-s2.0-S0927024811002601-main_1.png https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024811002601/PREVIEW/image/png/a1e6e23ff78989269d90079132143fee/main_1.png https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024811002601/PREVIEW/image/png/a1e6e23ff78989269d90079132143fee/main_1.png main_1.png png 62316 849 656 IMAGE-WEB-PDF 1 1-s2.0-S0927024811002601-si0001.gif https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024811002601/STRIPIN/image/gif/4e1e595f4cfd05bb9d37e29192856a83/si0001.gif https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024811002601/STRIPIN/image/gif/4e1e595f4cfd05bb9d37e29192856a83/si0001.gif si0001 si0001.gif gif 379 14 87 ALTIMG 1-s2.0-S0927024811002601-fx1.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024811002601/fx1/DOWNSAMPLED/image/jpeg/c67a7ce76dc1d2525fcf46750ad01565/fx1.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024811002601/fx1/DOWNSAMPLED/image/jpeg/c67a7ce76dc1d2525fcf46750ad01565/fx1.jpg fx1 true fx1.jpg jpg 21292 150 188 IMAGE-DOWNSAMPLED 1-s2.0-S0927024811002601-fx1.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024811002601/fx1/THUMBNAIL/image/gif/5243c7069c4a4f862119040f8abe205f/fx1.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024811002601/fx1/THUMBNAIL/image/gif/5243c7069c4a4f862119040f8abe205f/fx1.sml fx1 true fx1.sml sml 7671 164 205 IMAGE-THUMBNAIL 1-s2.0-S0927024811002601-gr1.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024811002601/gr1/DOWNSAMPLED/image/jpeg/8718bd2681be52d7ac71b41cc7dde52a/gr1.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024811002601/gr1/DOWNSAMPLED/image/jpeg/8718bd2681be52d7ac71b41cc7dde52a/gr1.jpg gr1 gr1.jpg jpg 52931 474 387 IMAGE-DOWNSAMPLED 1-s2.0-S0927024811002601-gr1.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024811002601/gr1/THUMBNAIL/image/gif/9f9f23a4c27ef6cf16232cbc18c6485f/gr1.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024811002601/gr1/THUMBNAIL/image/gif/9f9f23a4c27ef6cf16232cbc18c6485f/gr1.sml gr1 gr1.sml sml 7030 164 134 IMAGE-THUMBNAIL 1-s2.0-S0927024811002601-gr2.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024811002601/gr2/DOWNSAMPLED/image/jpeg/8ac1fef0f4b2c02a5e3d5654a2a0436f/gr2.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024811002601/gr2/DOWNSAMPLED/image/jpeg/8ac1fef0f4b2c02a5e3d5654a2a0436f/gr2.jpg gr2 gr2.jpg jpg 33043 241 301 IMAGE-DOWNSAMPLED 1-s2.0-S0927024811002601-gr2.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024811002601/gr2/THUMBNAIL/image/gif/79f8d81319918159ccfc61d8a6deca91/gr2.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024811002601/gr2/THUMBNAIL/image/gif/79f8d81319918159ccfc61d8a6deca91/gr2.sml gr2 gr2.sml sml 7579 164 205 IMAGE-THUMBNAIL 1-s2.0-S0927024811002601-gr3.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024811002601/gr3/DOWNSAMPLED/image/jpeg/d46a748d5611af1bd38cc016612c4dd2/gr3.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024811002601/gr3/DOWNSAMPLED/image/jpeg/d46a748d5611af1bd38cc016612c4dd2/gr3.jpg gr3 gr3.jpg jpg 109926 427 565 IMAGE-DOWNSAMPLED 1-s2.0-S0927024811002601-gr3.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024811002601/gr3/THUMBNAIL/image/gif/bcc6291046c4cf6a234e2927b1c6e5cf/gr3.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024811002601/gr3/THUMBNAIL/image/gif/bcc6291046c4cf6a234e2927b1c6e5cf/gr3.sml gr3 gr3.sml sml 17407 164 217 IMAGE-THUMBNAIL 1-s2.0-S0927024811002601-gr4.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024811002601/gr4/DOWNSAMPLED/image/jpeg/28795d92655107dfb8cebe64731e45be/gr4.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024811002601/gr4/DOWNSAMPLED/image/jpeg/28795d92655107dfb8cebe64731e45be/gr4.jpg gr4 gr4.jpg jpg 34014 245 301 IMAGE-DOWNSAMPLED 1-s2.0-S0927024811002601-gr4.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024811002601/gr4/THUMBNAIL/image/gif/431a1f93a4317c7a3d3ae7d2374847b9/gr4.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024811002601/gr4/THUMBNAIL/image/gif/431a1f93a4317c7a3d3ae7d2374847b9/gr4.sml gr4 gr4.sml sml 6575 164 201 IMAGE-THUMBNAIL 1-s2.0-S0927024811002601-gr5.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024811002601/gr5/DOWNSAMPLED/image/jpeg/3ef8837c5c4278013251ff3b6ef80600/gr5.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024811002601/gr5/DOWNSAMPLED/image/jpeg/3ef8837c5c4278013251ff3b6ef80600/gr5.jpg gr5 gr5.jpg jpg 41562 266 387 IMAGE-DOWNSAMPLED 1-s2.0-S0927024811002601-gr5.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024811002601/gr5/THUMBNAIL/image/gif/83630294e70be9f41a1679cfac11919a/gr5.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024811002601/gr5/THUMBNAIL/image/gif/83630294e70be9f41a1679cfac11919a/gr5.sml gr5 gr5.sml sml 6406 150 219 IMAGE-THUMBNAIL 1-s2.0-S0927024811002601-gr6.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024811002601/gr6/DOWNSAMPLED/image/jpeg/e631e4fdbacfa31e02d27b717755dec9/gr6.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024811002601/gr6/DOWNSAMPLED/image/jpeg/e631e4fdbacfa31e02d27b717755dec9/gr6.jpg gr6 gr6.jpg jpg 77957 453 386 IMAGE-DOWNSAMPLED 1-s2.0-S0927024811002601-gr6.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024811002601/gr6/THUMBNAIL/image/gif/4e018a3e0efde14ac3b58106b2589f82/gr6.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024811002601/gr6/THUMBNAIL/image/gif/4e018a3e0efde14ac3b58106b2589f82/gr6.sml gr6 gr6.sml sml 11733 164 140 IMAGE-THUMBNAIL SOLMAT 5717 S0927-0248(11)00260-1 10.1016/j.solmat.2011.05.003 Elsevier B.V. Fig. 1 Schematic of nT-silicon solar cells processing. Steps (i–iii) correspond to the nano-texturization process and steps (iv–vi) to fabrication of solar cells. Fig. 2 Reflectivity (R λ ) versus wavelength (λ) curves of polished (CMP), aT-Si, nT-Si (prepared for different texturization time durations) and nT-mc-Si surface (the best reflectivity). The curves are identified by numbers as: (1) CMP, (2) aT-Si; (3) nT-Si (15s), (4) nT-Si (30s), (5) nT-Si (45s), (6) nT-Si(60s), (7) nT-Si (90s), (8) nT-Si (120s) and (9) nT-mc-Si (30s). The inset shows the variation of average R λ (in 400–1000nm range) of different nT-Si surface with increasing texturing time (t etch). Fig. 3 SEM images of nT-Si surfaces textured for (a) 30, (b) 60 and (c) 90s. Corresponding cross-sectional SEM images of the nT-Si are shown in the inset of respective figures. The wide and longer pores are indicated by arrows in the inset of Fig. 3c; (d) Representative SEM image of nT-mc-Si surface showing the uniform nano-texturization across the grain boundaries. Fig. 4 Illuminated I–V curves for the planar control cell and the nT-Si solar cells under one sun conditions. Fig. 5 IQE and reflectance curves for planar control and 30s nT-Si solar cells. Marginal decrease in the IQE of nT-Si cell compared with the control planar cell can be seen in the short wavelength region. Fig. 6 Spatial distribution of reflectance and light induced current of the control and 30s nT-Si solar cells. (a) and (b) are reflectance maps for control and 30s nT-Si solar cell, respectively; and (c) and (d) are LBIC maps for control and 30s nT-Si solar cell, respectively. Scales of the reflectance and current maps for the two solar cells are shown right below the map along with the minimum and maximum limit of the respective parameter. These maps were recorded with excitation laser of wavelength 855nm. Table 1 Comparison of various solar cell performance parameters for the control cell and nT-Si solar cells made on surfaces textured for different time durations (30, 60 and 90s). Cell type J sc (mA/cm 2 ) V oc (mV) FF η (%) R s (Ω) R sh (Ω) J oe (nA/cm 2 ) Planar control cell 23.9 570 0.76 10.45 0.46 1308 27 30s nT-Si solar cell 28.9 578 0.71 11.70 3.31 622 10 60s nT-Si solar cell 25.2 579 0.72 10.47 0.64 114 18 90s nT-Si solar cell 18.4 569 0.75 7.9 0.85 1214 47 Silver catalyzed nano-texturing of silicon surfaces for solar cell applications Sanjay K. Srivastava ⁎ Dinesh Kumar Vandana Mukul Sharma Ravi Kumar P.K. Singh National Physical Laboratory, Council of Scientific and Industrial Research (CSIR), Dr. K.S. Krishnan Marg, New Delhi-110012, India ⁎ Corresponding author. Tel.: +91 11 45608617; fax: +91 11 45609310. We report a relatively simple process for fast nano-texturing of p-type (100) silicon surface using silver catalyzed wet chemical etching in aqueous hydrofluoric acid and hydrogen peroxide solution at room temperature. In this approach, a fine textured black surface was achieved in about 15–30s duration with reflectivity less than 4% in 400–1000nm range. The reflectivity versus texturization time has been investigated and co-related with morphological characteristics of the nano-textured-silicon (nT-Si) surfaces. The nano-texturization process is also applicable in multi-crystalline silicon. Further, n+–p–p+ structured solar cells have been fabricated on such nT-Si substrates following the standard fabrication protocol. Significant improvement in short circuit current density (>20%) and efficiency (∼1.25% absolute) has been achieved compared with planar control cell without deterioration of other performance parameters (such as open circuit voltage and fill factor). Light beam induced current measurements have also been carried out to show the spatial distribution of the light trapping and current in the planar and the nT-Si solar cells. Graphical abstract R λ versus λ curves of polished (CMP), alkaline texture (aT-Si), nano-texture (nT-Si; prepared for different texturization times) and nT-mc-Si surface. The curves are identified by numbers (1) CMP, (2) aT-Si, (3) nT-Si (15s), (4) nT-Si (30s), (5) nT-Si (45s), (6) nT-Si (60s), (7) nT-Si (90s), (8) nT-Si (120s) and (9) nT-mc-Si (30s). The inset shows the variation of average R λ (in the 400–1000nm range) of different nT-Si surfaces with increasing texturing time. Highlights ► Silver catalyzed wet nano-texturing of silicon is a simple, fast and low cost process. ► Fine textured black surface with reflectivity <4% in 400–1000nm is achieved. ► Ag-catalyzed nano-texturing is also applicable in multi-crystalline silicon. ► Nano-texturing improves J sc significantly (>20%) without affecting V oc and FF. ► Nano-texturing process can be adopted in the standard cell fabrication protocols. Keywords Silicon solar cells Wet etching Nano-texturing Antireflection coating LBIC 1 Introduction Polished silicon surface has a high natural reflectivity (>35%) with a strong spectral dependence and therefore, minimization of reflection losses is extremely important for efficient silicon solar cells. Usually, transparent quarter wavelength layers of silicon oxide (SiO x ), silicon nitride (Si x N y ) or titanium oxide (TiO x ) with intermediate or gradient refractive indices are used as antireflection coating (ARC) [1, pp. 345,2]. These coatings have resonant structures and work effectively only in a limited spectral range. A variety of other approaches have also been developed to minimize the reflection losses through modifying surface topography [3,4] wherein the losses are reduced by surface texturing using anisotropic etching generally done in aqueous alkaline solution. However, this process is limited to single crystalline silicon (c-Si) only [1,4] and not very effective in multi-crystalline silicon (mc-Si) due to different orientations of grains. Porous silicon, formed by electrochemical etching, is another such approach to reduce reflection loss in the range of 5–8% [5]. Another promising approach to minimize reflectivity utilizes a nano-textured (nT) surface, comprising features on the nanometer scale. Such surfaces are called sub-wavelength structures (SWSs) [6]. The SWSs are the surface relief structures with dimensions smaller than the wavelength of incident light. Hadobas et al. [7] have shown that surfaces based on SWSs can reduce surface reflection to minimum at 600nm for SWSs layer depth (d) to wavelength (λ) ratio 0.4 and effectively to zero for the higher ratio (⪢0.4) [7]. Moth-eye structures are typical example of SWS surfaces and a number of attempts have been made to achieve the low reflecting silicon surface [8,9] using this approach. To date, different dry etching methods based on reactive ion etching (RIE) [10], employing selective etching through alumina template, silicon dioxide (SiO2) micro-masks, catalytic action of various metals and nano-imprint lithography have been developed for the fabrication of SWS surfaces to produce ‘black silicon’[6–14]. However, the process complexity, low throughput and cost are big concerns for these methods and therefore, limit their applications such as for silicon solar cells in particular. Recently, Koynov et al. [15] reported gold (Au) catalyzed process for nano-texturing of silicon surface suppressing reflection loss below 5% wherein Au thin film (1–2nm) was pre-deposited on polished silicon by the thermal evaporation technique. However, in our view Au-assisted process is deleterious to the solar cell device as it is a known lifetime killing metal impurity [16] and traces of which may kill the solar cell performance completely. Thus, development of a simple process to prepare low reflecting surface and integration of such surface into silicon solar cell fabrication needs to be explored. In our earlier study, we have found that silicon nanowire (SiNW) arrays prepared via wet chemical etching of silicon in aqueous hydrofluoric acid (HF) and silver nitrate (AgNO3) solution can reduce reflection as low as ∼2% [17]. However, SiNW arrays solar cells had technical problems associated with the inherent SiNW arrays structural characteristics such as non-compact metal contact formation, enhanced surface area, etc. besides processing related issues [18]. Such problems could be minimized in the nano-textured-silicon (nT-Si) surfaces. Therefore, motivation for the present investigation was to develop a relatively simple process for the preparation of nT-Si surface with excellent antireflection property, which should be compatible with silicon solar cells fabrication protocol. In this paper, we report a relatively simple and fast process for nano-texturing of p-Si surface using Ag-catalyzed wet chemical etching in aqueous HF and hydrogen peroxide (H2O2) solution at room temperature wherein wafer-scale black nT-Si surface can be obtained in a very short duration (about 15–30s) with reflectivity (R λ ) below 4% in 400–1000nm range. The reflectivity versus texturization time has been investigated and co-related with morphological features of the nT-Si surfaces. Further, we have demonstrated that the nT-Si process can easily be integrated in conventional silicon solar cells fabrication protocol. Measurements such as current–voltage (I–V), quantum efficiency and light beam induced current (LBIC) have shown a significant improvement in nT-Si solar cell performance compared with planar cell made on polished silicon. 2 Experimental details 2.1 Sample preparation The nT-Si samples were prepared using (100) p-type (1.2±0.05Ωcm, boron doped), Czochralski (CZ) silicon wafers of 325±10μm thickness. All the samples used in the present investigation have the same material specifications. In the very first step of the process, as-cut or lapped wafers were etched using HF and nitric acid (HNO3) solution or concentrated potassium hydroxide (KOH) solution to remove surface damages (∼15μm from each side) caused by saw wires, etc. This step is essential in solar cells fabrication. After damage removal the chemical polishing or alkaline texturization (in 2% KOH+20% iso-propyl alcohol solution at 80°C for 30min) was carried out. In the case of Ag-catalyzed nano-texturization, both chemically polished (CP) and commercially available chemically mechanically polished (CMP) wafers were used. It was noticed that nano-texturization of silicon wafers was not affected by the initial wafer surface morphology (CP or CMP silicon). The silicon wafers were sequentially cleaned with acetone, de-ionized (DI) water and boiled in piranha solution using sulfuric acid (H2SO4) and H2O2 in 3:1 (vol.) ratio for 60min. The wafers were then rinsed thoroughly with DI water followed by 5% HF solution dip to remove native oxide. The nano-texturization process included two steps, and schematic of these are shown in the steps (i–iii) in Fig. 1. In step (i) a thin layer of Ag film (∼5nm) was deposited over the polished Si (CP or CMP) using the electro-less metal deposition (EMD) at room temperature in aqueous 4M HF solution containing 0.008M AgNO3 for 10s followed by DI water rinse. In this process no external electric current (or electrodes) is required. The EMD process, in an ionic metal containing HF solution, is based on micro-electrochemical redox reaction in which both cathodic and anodic reactions occur simultaneously at the metal/semiconductor interface. This resulted in a thin layer of Ag nano-islands uniformly distributed over the entire sample area. After deposition of the Ag nano-islands film, wafers were thoroughly rinsed in DI water and dried in nitrogen for the next processing step. In step (ii) Ag deposited silicon wafers were immersed in H2O2:HF:DI water::1:2:10 (vol.) solution at room temperature for different time durations (15–120s) for Ag-catalyzed texturization. The polished Si surface turned uniformly black within 15–30s. The residual Ag nanoparticles from the nT-Si were removed completely by etching in ammonia (NH3) and H2O2 solution in 3:1 (vol.) ratio at room temperature. Finally, the nT samples (as shown in step iii) were rinsed with DI water, blown dry in nitrogen and subjected to further investigations. Morphology of the samples was examined by scanning electron microscope (SEM; Model LEO 440 VP) and reflectivity measurements were carried out using spectrophotometer (Shimadzu; Model UV 3101PC with an integrating sphere) in 350–1200nm wavelength range. It is also important to mention that the present nano-texturization process is equally applicable to mc-Si wafers wherein lapped mc-Si wafers were subjected to nano-texturization after damage removal. 2.2 Solar cell fabrication Solar cells were fabricated on CMP, CP, alkaline (KOH) textured (aT-Si) and nano-textured-silicon (nT-Si were prepared using both as-cut and commercially available CMP wafers) of identical electrical/electronic properties (resistivity, orientation, thickness, etc.) in the same batch. For the co-relation of the reflectivity data with nT-Si solar cells performance, only the results of nT-Si cells fabricated on CMP (as starting wafers) are reported. This is because no significant difference was observed in the CP and CMP based nT-cell performances. The cells made on CMP wafers were used as control in our process because of their known reflectivity as well as for comparison of the cells performance having different surface morphologies (anisotropically textured and nT surfaces). In true sense a comparison with anisotropically textured (aT) cell would be interesting but the reflectivity of aT-surface depends on several parameters such as temperature, time and etching solution concentration used to create random pyramids [4]. The n+–p–p+ structure based solar cells were fabricated by conventional cell fabrication protocol [4], the schematic of which is given in Fig. 1 (steps iv–vi). After RCA cleaning, the wafers having different morphologies were subjected to phosphorus diffusion using solid dopant disc source at 920°C followed by Al layer deposition on the rear surface by e-beam evaporation and alloying in inert ambient at 850°C using rapid thermal processing (RTP; Annealsys, Model: As-One 150) to form back surface field (BSF). The front metal contacts were made by Ti/Ag deposition through metal masks using e-beam evaporation followed by contact sintering in forming gas in the RTP. Finally, ∼2.4×2.4cm2 solar cells were diced from the wafer for the electrical characterization. It is to be mentioned that samples of nT-Si (two each of 30, 60 and 90s), two CMP, two CP wafers and two aT-Si wafers, i.e., a total 12 wafers were processed in one batch (and a number of such batches were processed to see the reproducibility of the results in terms of processing). The results were repeatable from batch to batch (within ±5%). It is to be noted that the data reported in the paper are the representative values of the cell parameter for a particular type of cell's surface morphology. Electrical characterization of the solar cells were carried out using an I–V and spectral response system (Bunkoh-Keiki Co., Model: CEP-25HS-50 SR) under AM 1.5G spectral irradiance (100mW/cm2 at 25°C). The reflectance and LBIC mapping of solar cells were measured using a commercial mapping system (Semilab, Model: WT 2000 PV) with a diode laser of wavelength 855nm and spot size of 100μm. 3 Results and discussion 3.1 Nano-texturing Fig. 2 shows reflectivity (R λ ) versus wavelength curves of the CMP, aT-Si, nT-Si surfaces (for varying texturing time) and nT surface prepared on chemically polished mc-Si wafer (with the best R λ ). The reflection spectrum of the polished silicon (both CMP and CP) surface shows the typical high R λ (∼34%) whereas average R λ achieved in aT-Si is∼11.9% in the 400–1000nm wavelength range. In the case of nT-Si samples, the average R λ is reduced to less than 4% for 15–30s nT-Si surfaces. The variation of average R λ with texturing time (t etch) for nT-Si samples is shown in the inset of Fig. 2. This clearly shows that the average R λ of nT-Si increases gradually with increasing texturing time. The origin of the low reflectivity produced by the nano-texturization can be understood from the morphology of the etched Si surface as shown in Fig. 3 wherein Fig. 3a, b and c shows the top surface morphology of the 30, 60 and 90s nT-Si, respectively. The corresponding cross-sectional view of the samples is also shown in the respective insets of Fig. 3. From Fig. 3a it can be seen that surface with nano-pores of diameter 40–100nm and vertical depth of 300–400nm is obtained in 30s nT-Si. Longer texture time produces relatively wider and deeper pores (see arrows in inset of Fig. 3c). The 60s (90s) nT-Si surface has pores of diameter ∼100–200nm (∼300–600nm) and vertical depth ∼500–600nm (∼900–1000nm). Pores density is found to vary with texturing time and is estimated to be ∼6×109, ∼2×109 and ∼5×108 per cm2 for 30, 60 and 90s nT-Si samples, respectively. The fractional area occupied by Si as a function of the depth across the textured layer gradually increases as can be seen from the respective cross-sectional images (insets of Fig. 3a–c). This may cause a gradual increase in the fractional density of Si (and therefore the graded refractive index) along the depth of the pores (at the interface of nT and non-textured silicon). Such structures have close resemblance with SWSs [12,15]. As mentioned earlier R λ reduces to minimum for the textured layer depth (d) to wavelength (λ) ratio greater than 0.4 [7], therefore, a texture of only 300–400nm in depth should be enough to suppress the reflection losses in the entire spectral range of interest for silicon solar cells [15]. We have realized the lowest R λ in 15–30s textured surfaces in the spectral range 400–1000nm (minimum and maximum d/λ ratio is equal to 0.4 and 1 considering d=400nm and λ max =1000nm and λ min=400nm). Branz et al. [19] have shown graded index “black silicon” surface using Au-assisted etching of silicon and deduced a ‘Scaling law’ using the measured depth dependence on wavelength. In our case the value of reflectivity increases gradually with etching time, which is opposite to the observation made in Ref. [19]. This observation is puzzling and needs further investigations in terms of surface morphology and better understanding of etching mechanism. However, the deep and wider pores seen particularly in 90s textured silicon (inset of Fig. 3c) may disturb the gradual increase in fractional coverage of Si causing abrupt change of effective refractive index at the nT surface and silicon (non-textured silicon region) interface. Consequently, longer texturing duration will result in substantial change in refractive index at the interface and hence increased reflection. Therefore, 15–30s texturing of the silicon surface is good enough to minimize reflectivity below 4% (in the entire usable spectral range) for silicon solar cells. It is to be noted that the texturization of the polished silicon was also tried without thin Ag layer in the same solution (H2O2:HF:DI water::1:2:10) at room temperature where the texturization process was very slow and no significant change in the reflectivity could be observed. Therefore, nano-texturization of the silicon may be attributed to the catalytic action of the Ag nano-islands and, therefore, an analogy can be drawn from Ag assisted growth of SiNWs in aqueous HF and AgNO3 solution [20] where the continuous galvanic displacement of Si via formation of many local nano-electrochemical cells on the silicon surface takes place. In brief, the Ag nanoparticles act as cathode and silicon surface in contact with the Ag nanoparticles as anode. H2O2 act as oxidizing agent and injects hole in the Si valence band facilitated by Ag nanoparticles [21]. Silicon surface in contact with Ag is locally oxidized, which is subsequently etched away by HF. As mentioned earlier, the nano-texturization process was applied on mc-Si also and the best average R λ <3% has been achieved (for 30s texturing) in 400–1000nm wavelength range as can be seen from Fig. 2. A representative SEM micrograph of the textured mc-wafers is also shown in Fig. 3d. This clearly demonstrates the effectiveness of the Ag-catalyzed nano-texturization process in mc-Si wafers and its versatility for both c-Si and mc-Si. 3.2 I–V measurements Fig. 4 shows illuminated I–V characteristics of the control cell made on planar surface and nT-Si solar cells for different periods of texturing time. The solar cell parameters such as short circuit current density (J sc), open circuit voltage (V oc), fill factor (FF), efficiency (η), series (R s ) and shunt (R sh) resistances and emitter dark saturation current density (J oe) for all cells are summarized in Table 1. Among the three nT-Si based solar cells, as expected, the 30s nT-Si solar cell has shown the best performance. In this cell, the J sc is 28.9mA/cm2 and η is 11.7% compared with 23.9mA/cm2 and 10.45%, respectively, on the control cell. It has V oc∼578mV and FF of ∼0.71 and corresponding values in the control cell are 570mV and 0.76, respectively. The V oc and FF for all the three nT-Si solar cells (30, 60 and 90s) are almost comparable (within ∼2% and∼6%, respectively) to the control cell. It indicates that good quality electrical contacts could be realized on nT-Si solar cells. The variations in FF of the four cells could be attributed to the different values of parasitic resistances such as shunt and series resistances (Table 1). For example, the lowest FF in the case of 30s nT-Si cell could be attributed to the high series and low shunt resistances. These variations could be due to the different surface morphology of the textured surfaces that needs fine tuning of process parameters for individual type of cells. In summary, nT-silicon provides significant improvement in J sc (>20%) and η (∼1.25% absolute) compared to its planar counterpart primarily due to the enhanced light absorption in the former. The decrease in J sc for 60 and 90s nT-Si based cells may be attributed to the relatively higher R λ values. The cells fabricated on aT-Si samples showed ∼7–10% gain in the J sc as compared to that on CMP based planar cell which is significantly less than the value realized on nT-Si cells (>20%). V oc and FF of the aT-Si cells were practically the same as that of planar control cell. Also, the improvement in J sc in nT-mc-Si was between 15–20% compared to planar cells made on chemically polished mc-Si. The details of nT-mc-Si solar cells will be published elsewhere. 3.3 IQE and LBIC measurements Internal quantum efficiency (IQE) of the planar control cell and the best nT-Si based cell are compared in Fig. 5 along with the reflectivity of the cell surfaces (but R λ measured before making metal contacts), which is practically the same (<5% in the 400–1000nm range) even after high temperature processing such as phosphorous diffusion, BSF alloying and harsh chemical process steps such as phosphor–silicate glass removal. However, the IQE in the nT-Si based cell is reduced slightly in the short wavelength region, which could be attributed to following: (i) the quality of the emitter and as a consequence small contribution from λ<500nm (as reflected in the IQE data in the short wavelength region), (ii) lack of surface passivation and (iii) optimization of process parameters of different type of surfaces individually (presently all the samples are processed in the single batch). In order to assess the role of surface recombination, the surface recombination velocity (S eff,) was calculated by measuring the effective minority carrier lifetime (τ eff,) on the CMP, aT-Si and the 30s nT-Si wafers (without giving any passivation treatment) using the microwave based photoconductance decay (μ-PCD) method (Semilab; Model WT 2000). The measured average τ eff, values were 6.2, 5.3 and 3.6μs, respectively. It indicates that the τ eff, in nT-Si samples decrease by a factor of ∼1.7 compared to the CMP Si wafer. The limiting S eff, was calculated using the following expression [22]: S eff , = W / 2 τ eff , where W is the wafer thickness. The calculated S eff, were 2620 (CMP), 3066 (aT-Si) and 4514cm/s (nT-Si). The increased S eff, in nT-Si samples may be attributed to the enlarged effective surface area (A eff) of nano-textured surface. The S eff, for aT-Si and nT-Si are ∼1.2 and ∼1.7 times that of CMP wafers. Therefore, the A eff for aT-Si and nT-Si surfaces may be estimated as ∼1.2× and ∼1.7× that of the planar surfaces and hence more contribution (per unit area) towards surface recombination losses is expected. It is to be noted that our estimation of area is almost correct because in aT-Si case, the area increase is ∼1.2× (w.r.t. planar surface) which is close to the 1.3× calculated theoretically in the ideal case. The increase in A eff depends on the quality of the alkaline texturization and is always lower than 1.3×. Therefore, V oc and quantum efficiency in our case is affected but only marginally due to increased surface area. The performance of the nT-Si based solar cell was further confirmed by LBIC measurements. The spatial variation of the reflectance and current in the solar cells in control cell and the best nT-Si cell (30s nT-Si cell) are shown in Fig. 6a and b, respectively. It is clear from the maps that reflectance is reduced to ∼4–5% uniformly over the entire active area (excluding metal regions) of 30s nT-Si solar cell (see Fig. 6b) which re-confirm our claim of low reflectance on the finished nT-Si solar cells. Effect of reduced R λ is also reflected in the spatial current distribution shown in Fig. 6c and d for the control and 30s nT-Si solar cells, respectively. A comparison of Fig. 6d and c clearly shows an overall current enhancement in the nT-Si cell (average current values 85.17 and 55.03μA for 30s nT-Si and control planar cell, respectively). This corroborates with the results shown in Fig. 4. Although, the solar cell performance in terms of efficiency is rather low but the purpose of the work is to give a “proof of concept” of application (as ARC) and compatibility of Ag-catalyzed nano-texturization process in conventional solar cell processing. The gaps in processing such as surface passivation and related aspects will be incorporated in our future reports. 4 Conclusion We have developed a simple and fast Ag-catalyzed chemical process for nano-texturization of silicon surface wherein reflectivity <4% can be achieved in the usable spectral range for silicon solar cells. Significant improvement (>20%) in the short circuit current density and efficiency (∼1.25% absolute) has been demonstrated in the nT-Si solar cells compared to the planar cell. The quantum efficiency analysis reveals relatively inferior response in short wavelength region for nT-Si based solar cell that may be due to the increased surface area of nano-textured surface compared with the planar surface. An effective passivation of the surface can further improve the efficiency of the nT-Si based solar cells. Silver catalyzed electro-less nano-texturing is a simple, fast and low cost process to realize an effective low reflective Si surface, which has potential for silicon solar cells, although there is a lot of scope to improve the process to exploit the full potential of nano-textured surface in silicon solar cells. Acknowledgement The present work is sponsored by the Council of Scientific and Industrial Research (CSIR), India under SUPRA institutional project (Grant code: SIP-17). Authors are also thankful to Mr. K.N. Sood and Dr. M. Kar for SEM and reflectivity measurements of the samples. One of the authors, D.K. is grateful to the University Grant Commission, India for providing research fellowship. References [1] M.A. Green Silicon Solar Cells: Advanced Principles and Practice 1995 Bridge Sydney pp. 345–356 [2] B.S. Richards Comparison of TiO2 and other dielectric coatings for buried contact solar cells: a review Prog. Photovolt.: Res. Appl. 12 2004 253 281 [3] J. Zhao A. Wang M.A. Green F. Ferrazza 19.8% efficient “honeycomb” textured multicrystalline and 24.4% monocrystalline silicon solar cells Appl. Phys. Lett. 73 1998 1991 1993 [4] P.K. Singh R. Kumar M. Lal S.N. Singh B.K. Das Effectiveness of silicon in aqueous alkaline solutions Sol. Energy Mater. Sol. Cells 70 2001 103 113 [5] P. Menna G.D. Francia V.L. Ferrara Porous silicon in solar cells: a review and a description of its application as an AR coating Sol. Energy Mater. Sol. Cells 37 1995 13 24 [6] Y. Kanamori M. Sasaki K. Hane Broadband antireflection gratings fabricated upon silicon substrates Opt. Lett. 24 1999 1422 1424 [7] K. Hadobas S. Kirsch A. Carl M. Acet E.F. Wassermann Reflection properties of nanostructure-arrayed silicon surfaces Nanotechnology 11 2000 161 164 [8] S.A. Boden, D.M. Bagnall, Bio-mimetic subwavelength surface for near-zero reflection sunrise to sunset, in: Proceedings of the 4th World Conference on Photovoltaic Energy Conversion, Hawaii, 2006, pp. 1358–1361. [9] S.A. Boden D.M. Bagnall Tunable reflection minima of nanostructured antireflective surfaces Appl. Phys. Lett. 93 2008 133108 133110 [10] T.P. Chow P.A. Maciel G.M. Fanelli Reactive ion etching of silicon in CCl4 and HCl plasmas J. Electrochem. Soc. 134 1987 1281 1286 [11] H. Sai H. Fujii K. Arafune Y. Ohshita M. Yamaguchi Y. Kanamori H. Yugami Antireflective sub-wavelength structures on crystalline Si fabricated using directly formed anodic porous alumina masks Appl. Phys. Lett. 88 2006 201116(1) 201116(3) [12] S. Wang X.Z. Yu H.T. Fan Simple lithographic approach for sub-wavelength structure antireflection Appl. Phys. Lett. 91 2007 061105(1) 061105(3) [13] C.H. Sun W.L. Min N.C. Linn P. Jiang Templated fabrication of large area sub-wavelength antireflection gratings on silicon Appl. Phys. Lett. 91 2007 231105(1) 231105(3) [14] G. Zhang J. Zhang G.Y. Xie Z.F. Liu H.B. Shao Cicada wings: a stamp from nature for nanoimprint lithography Small 2 2006 1440 1443 [15] S. Koynov M.S. Brandt M. Srutzmann Black non-reflecting silicon surfaces for solar cells Appl. Phys. Lett. 88 2006 203107(1) 203107(3) [16] S.K. Gandhi VLSI Fabrication Principles: Silicon and Gallium Arsenide second ed. 2009 Willey India pp. 194–196 (Chapter 4) [17] S.K. Srivastava D. Kumar P.K. Singh M. Kar M. Husain V. Kumar Excellent antireflection properties of vertical silicon nanowire arrays Sol. Energy Mater. Sol. Cells 94 2010 1506 1511 [18] S.K. Srivastava, D. Kumar, P.K. Singh, V. Kumar, Silicon nanowire arrays based “black silicon” solar cells, in: Proceedings of the 34 IEEE Photovoltaic Specialists Conference, Philadelphia, United States, 2009, pp. 1851–1856, doi:10.1109/PVSC.2009.5411524. [19] H.M. Branz V.E. Yost S. Ward K.M. Jones B. To P. Stradins Nanostructured black silicon and the optical reflectance of graded-density surfaces Appl. Phys. Lett. 94 2009 231121(1) 231121(3) [20] D. Kumar S.K. Srivastava P.K. Singh K.N. Sood V.N. Singh N. Dilawar M. Husain Room temperature growth of wafer-scale silicon nanowire arrays and their Raman characteristics J. Nanopart. Res. 12 2010 2267 2276 [21] X. Li P.W. Bohn Metal-assisted chemical etching in HF/H2O2 produces porous silicon Appl. Phys. Lett 77 2000 2572 2574 [22] A.B. Sproul Dimensionless solution of the equation describing the effect of surface recombination of carrier decay in semiconductors J. Appl. Phys. 76 1994 2851 2854", "scopus-id": "84857786398", "coredata": {"eid": "1-s2.0-S0927024811002601", "dc:description": "We report a relatively simple process for fast nano-texturing of p-type (100) silicon surface using silver catalyzed wet chemical etching in aqueous hydrofluoric acid and hydrogen peroxide solution at room temperature. In this approach, a fine textured black surface was achieved in about 15–30s duration with reflectivity less than 4% in 400–1000nm range. The reflectivity versus texturization time has been investigated and co-related with morphological characteristics of the nano-textured-silicon (nT-Si) surfaces. The nano-texturization process is also applicable in multi-crystalline silicon. Further, n+–p–p+ structured solar cells have been fabricated on such nT-Si substrates following the standard fabrication protocol. Significant improvement in short circuit current density (>20%) and efficiency (∼1.25% absolute) has been achieved compared with planar control cell without deterioration of other performance parameters (such as open circuit voltage and fill factor). Light beam induced current measurements have also been carried out to show the spatial distribution of the light trapping and current in the planar and the nT-Si solar cells.", "openArchiveArticle": "false", "prism:coverDate": "2012-05-31", "openaccessUserLicense": null, "prism:aggregationType": "Journal", "prism:url": "https://api.elsevier.com/content/article/pii/S0927024811002601", "dc:creator": [{"@_fa": "true", "$": "Srivastava, Sanjay K."}, {"@_fa": "true", "$": "Kumar, Dinesh"}, {"@_fa": "true", "$": "Vandana,"}, {"@_fa": "true", "$": "Sharma, Mukul"}, {"@_fa": "true", "$": "Kumar, Ravi"}, {"@_fa": "true", "$": "Singh, P.K."}], "link": [{"@_fa": "true", "@rel": "self", "@href": "https://api.elsevier.com/content/article/pii/S0927024811002601"}, {"@_fa": "true", "@rel": "scidir", "@href": "https://www.sciencedirect.com/science/article/pii/S0927024811002601"}], "dc:format": "application/json", "openaccessType": null, "pii": "S0927-0248(11)00260-1", "prism:volume": "100", "prism:publisher": "Elsevier B.V.", "dc:title": "Silver catalyzed nano-texturing of silicon surfaces for solar cell applications", "prism:copyright": "Copyright © 2011 Elsevier B.V. All rights reserved.", "prism:issueName": "Photovoltaics, Solar Energy Materials, and Technologies: Cancun 2010", "openaccess": "0", "prism:issn": "09270248", "dcterms:subject": [{"@_fa": "true", "$": "Silicon solar cells"}, {"@_fa": "true", "$": "Wet etching"}, {"@_fa": "true", "$": "Nano-texturing"}, {"@_fa": "true", "$": "Antireflection coating"}, {"@_fa": "true", "$": "LBIC"}], "openaccessArticle": "false", "prism:publicationName": "Solar Energy Materials and Solar Cells", "openaccessSponsorType": null, "prism:pageRange": "33-38", "prism:endingPage": "38", "pubType": "fla", "prism:coverDisplayDate": "May 2012", "prism:doi": "10.1016/j.solmat.2011.05.003", "prism:startingPage": "33", "dc:identifier": "doi:10.1016/j.solmat.2011.05.003", "openaccessSponsorName": null}, "objects": {"object": [{"@category": "thumbnail", "@height": "14", "@width": "87", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024811002601-si0001.gif?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "ALTIMG", "@size": "379", "@ref": "si0001", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "150", "@width": "188", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024811002601-fx1.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "21292", "@ref": "fx1", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "164", "@width": "205", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024811002601-fx1.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "7671", "@ref": "fx1", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "474", "@width": "387", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024811002601-gr1.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "52931", "@ref": "gr1", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "164", "@width": "134", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024811002601-gr1.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "7030", "@ref": "gr1", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "241", "@width": "301", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024811002601-gr2.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "33043", "@ref": "gr2", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "164", "@width": "205", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024811002601-gr2.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "7579", "@ref": "gr2", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "427", "@width": "565", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024811002601-gr3.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "109926", "@ref": "gr3", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "164", "@width": "217", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024811002601-gr3.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "17407", "@ref": "gr3", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "245", "@width": "301", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024811002601-gr4.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "34014", "@ref": "gr4", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "164", "@width": "201", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024811002601-gr4.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "6575", "@ref": "gr4", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "266", "@width": "387", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024811002601-gr5.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "41562", "@ref": "gr5", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "150", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024811002601-gr5.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "6406", "@ref": "gr5", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "453", "@width": "386", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024811002601-gr6.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "77957", "@ref": "gr6", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "164", "@width": "140", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024811002601-gr6.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "11733", "@ref": "gr6", "@mimetype": "image/gif"}]}, "link": {"@rel": "abstract", "@href": "https://api.elsevier.com/content/abstract/scopus_id/84857786398"}}