{"scopus-eid": "2-s2.0-84870491985", "originalText": "serial JL 271533 291210 291719 291720 291790 291893 291940 31 Applied Surface Science APPLIEDSURFACESCIENCE 2012-10-22 2012-10-22 2014-08-07T01:20:07 1-s2.0-S0169433212018041 S0169-4332(12)01804-1 S0169433212018041 10.1016/j.apsusc.2012.10.079 S300 S300.3 FULL-TEXT 1-s2.0-S0169433212X00242 2015-05-14T05:31:34.736618-04:00 0 0 20130101 2013 2012-10-22T00:00:00Z absattachment articleinfo articletitlenorm authfirstinitialnorm authfirstsurnamenorm cid cids contenttype copyright crossmark dateloaded dateloadedtxt datesearch datesort dateupdated dco docsubtype doctype doi eid ewtransactionid hubeid indexeddate issn issnnorm itemstage itemtransactionid itemweight openaccess openarchive pg pgfirst pglast pii piinorm pubdatestart pubdatetxt pubyr sectiontitle sortorder srctitle srctitlenorm srctype subheadings suppl tomb volfirst volissue volumelist webpdf webpdfpagecount yearnav figure table e-component body acknowledge affil appendices articletitle auth authfirstini authfull authkeywords authlast primabst ref specialabst alllist content subj ssids 0169-4332 01694332 false 264 264 C Volume 264 97 621 624 621 624 20130101 1 January 2013 2013-01-01 2013 Regular papers article fla Copyright © 2012 Elsevier B.V. All rights reserved. FORMATIONNANOSTRUCTUREDEMITTERFORSILICONSOLARCELLSUSINGCATALYTICSILVERNANOPARTICLES LI D 1 Introduction 2 Experimental details 2.1 Materials 2.2 The preparation of silver nanoparticles 2.3 Characterization 3 Results and discussion 3.1 Structure characterization and the reflectance characteristics 3.2 Performance of the nanotextured silicon solar cells 4 Conclusion Acknowledgments Appendix A Supplementary data References CAMPBELL 1987 243 249 P SINGH 2001 103 113 P GREEN 1995 M SILICONSOLARCELLSADVANCEDPRINCIPLESPRACTICE STEPHENS 1977 19 29 R KOOIJ 1999 178 180 E KROTKUS 1997 267 273 A GONZALEZDIAZ 2006 473 B MARRERO 2009 2648 2650 N SANJAY 2012 33 38 K LI 2000 2572 2574 X ZHIPENGHUANG 2011 285 308 CHARTIER 2008 5509 5516 C XINGU 2011 025703 BUMSUNGKIM 2009 2415 2417 TSUJINO 2006 1527 1532 K HITOSHISAI 2007 3333 3336 TSUJINOA 2006 100 110 K TAOLIU 2011 628 631 XUEWENGENG 2012 98 107 DIANPENGQI 2009 7769 7772 LIX2013X621 LIX2013X621X624 LIX2013X621XD LIX2013X621X624XD item S0169-4332(12)01804-1 S0169433212018041 1-s2.0-S0169433212018041 10.1016/j.apsusc.2012.10.079 271533 2014-08-06T23:53:59.904498-04:00 2013-01-01 1-s2.0-S0169433212018041-main.pdf https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433212018041/MAIN/application/pdf/353728aaa2a46c84bd19eba9bcf6b2d9/main.pdf https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0169433212018041/MAIN/application/pdf/353728aaa2a46c84bd19eba9bcf6b2d9/main.pdf main.pdf pdf true 552757 MAIN 4 1-s2.0-S0169433212018041-main_1.png https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0169433212018041/PREVIEW/image/png/d0f847c44e7918b6d379057bcac689a0/main_1.png https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433212018041/PREVIEW/image/png/d0f847c44e7918b6d379057bcac689a0/main_1.png main_1.png png 55851 849 656 IMAGE-WEB-PDF 1 1-s2.0-S0169433212018041-mmc1.docx https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433212018041/mmc1/MAIN/application/msword/24cf5c82ac1dae06314fb38c2f4bfa2f/mmc1.docx https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0169433212018041/mmc1/MAIN/application/msword/24cf5c82ac1dae06314fb38c2f4bfa2f/mmc1.docx mmc1 mmc1.docx docx 7214741 APPLICATION 1-s2.0-S0169433212018041-gr4.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433212018041/gr4/DOWNSAMPLED/image/jpeg/22d0c870d9b6b20281cfdb3a9938f8de/gr4.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0169433212018041/gr4/DOWNSAMPLED/image/jpeg/22d0c870d9b6b20281cfdb3a9938f8de/gr4.jpg gr4 gr4.jpg jpg 34357 256 678 IMAGE-DOWNSAMPLED 1-s2.0-S0169433212018041-gr3.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433212018041/gr3/DOWNSAMPLED/image/jpeg/877f4b7986e07ae9e5529b5b19b30bbb/gr3.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0169433212018041/gr3/DOWNSAMPLED/image/jpeg/877f4b7986e07ae9e5529b5b19b30bbb/gr3.jpg gr3 gr3.jpg jpg 22842 233 301 IMAGE-DOWNSAMPLED 1-s2.0-S0169433212018041-gr2.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433212018041/gr2/DOWNSAMPLED/image/jpeg/b4904cd745db6acf96f6d57ae0963139/gr2.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0169433212018041/gr2/DOWNSAMPLED/image/jpeg/b4904cd745db6acf96f6d57ae0963139/gr2.jpg gr2 gr2.jpg jpg 19409 276 376 IMAGE-DOWNSAMPLED 1-s2.0-S0169433212018041-gr1.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433212018041/gr1/DOWNSAMPLED/image/jpeg/7ba5924003a11289985f487ad3abe7f4/gr1.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0169433212018041/gr1/DOWNSAMPLED/image/jpeg/7ba5924003a11289985f487ad3abe7f4/gr1.jpg gr1 gr1.jpg jpg 65855 499 602 IMAGE-DOWNSAMPLED 1-s2.0-S0169433212018041-fx1.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433212018041/fx1/DOWNSAMPLED/image/jpeg/58437bef7b8f95f1b96bdb39497bca98/fx1.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0169433212018041/fx1/DOWNSAMPLED/image/jpeg/58437bef7b8f95f1b96bdb39497bca98/fx1.jpg fx1 true fx1.jpg jpg 19562 169 500 IMAGE-DOWNSAMPLED 1-s2.0-S0169433212018041-gr4.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433212018041/gr4/THUMBNAIL/image/gif/229dc2e18fb86e5ad651c5e03e255bc8/gr4.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0169433212018041/gr4/THUMBNAIL/image/gif/229dc2e18fb86e5ad651c5e03e255bc8/gr4.sml gr4 gr4.sml sml 3337 83 219 IMAGE-THUMBNAIL 1-s2.0-S0169433212018041-gr3.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433212018041/gr3/THUMBNAIL/image/gif/bc314a7d70c64230368c46e3855623dc/gr3.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0169433212018041/gr3/THUMBNAIL/image/gif/bc314a7d70c64230368c46e3855623dc/gr3.sml gr3 gr3.sml sml 4721 164 212 IMAGE-THUMBNAIL 1-s2.0-S0169433212018041-gr2.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433212018041/gr2/THUMBNAIL/image/gif/f62cac96c0086906d8aceb910a8d7e3c/gr2.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0169433212018041/gr2/THUMBNAIL/image/gif/f62cac96c0086906d8aceb910a8d7e3c/gr2.sml gr2 gr2.sml sml 3880 161 219 IMAGE-THUMBNAIL 1-s2.0-S0169433212018041-gr1.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433212018041/gr1/THUMBNAIL/image/gif/8d5fcaa157841b252329ea9e0222be8c/gr1.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0169433212018041/gr1/THUMBNAIL/image/gif/8d5fcaa157841b252329ea9e0222be8c/gr1.sml gr1 gr1.sml sml 14867 164 198 IMAGE-THUMBNAIL 1-s2.0-S0169433212018041-fx1.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433212018041/fx1/THUMBNAIL/image/gif/33068c8b79f36e4e4b2ee882912ca9c7/fx1.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0169433212018041/fx1/THUMBNAIL/image/gif/33068c8b79f36e4e4b2ee882912ca9c7/fx1.sml fx1 true fx1.sml sml 4115 74 219 IMAGE-THUMBNAIL APSUSC 24460 S0169-4332(12)01804-1 10.1016/j.apsusc.2012.10.079 Elsevier B.V. Fig. 1 Cross-sectional SEM micrographs of Si wafers etched by a size-controlled Ag catalyzed process for different times. (a) Before etching; (b) 2min; (c) 3min; (d) 5min. Fig. 2 The thickness of nanoporous layer in different etching times. Fig. 3 Reﬂectance spectra of the nanotextured Si wafers with different etching times. Fig. 4 I–V characteristics of the nanotextured solar cells (a) without SiN x , and (b) with SiN x under 1 sun illumination. Table 1 Photovoltaic parameters of the experimental cell with nanotextured surface (without/with SiN x coating): reference cell 1 and experimental cell 1 refer to the samples without SiN x coating. Reference cell 2 and experimental cell 2 refer to the samples with SiN x coating. Category I sc (A) V oc (V) R s (mΩ) R sh (Ω) FF E ff (%) J oe (A) Reference cell 1 4.514 0.6054 6.790 54.65 0.7773 13.72 2.335 Experimental cell 1 5.101 0.6117 8.200 77.05 0.7813 15.70 0.5365 Reference cell 2 4.984 0.6164 7.430 166.6 0.7927 15.73 0.06439 Experimental cell 2 5.439 0.6187 10.07 10.64 0.7277 15.82 0.07881 Formation of nanostructured emitter for silicon solar cells using catalytic silver nanoparticles Dan Li a Lei Wang a Dongsheng Li a Ning Zhou a Zhiqiang Feng b Xiaoping Zhong b Deren Yang a ⁎ a State Key Laboratory of Silicon Materials and Department of Materials Science and Engineering, Zhejiang University, Hangzhou 310027, China b Zhejiang Shuqimeng Photovoltaic Technology Co., Ltd., Hangzhou 310027, China ⁎ Corresponding author. Tel.: +86 571 87951667; fax: +86 571 87952322. Graphical abstract Highlights ► Nanoporous silicon was made on the emitter by size-controlled Ag nanoparticles catalyzed etching. ► The reflectivity of the nanoporous surface and electrical properties of the solar cells were characterized. ► The efficiency improvement was mainly due to the significantly increasing of short-circuit current. ► We report a nanoporous silicon solar cell with a 15.7%-efficiency without any passivation coating. A simple process for nanotexturing on the emitter of silicon solar cells using catalyzed wet chemical etching by size-controlled silver nanoparticles was reported. A fine textured black surface was achieved to realize the low light reflectivity less than 5%. After screen printing and firing by the industrial standard fabrication protocol, we obtained the nanotextured Si solar cells with 15.7%-efficiency without any additional antireflection (AR) coating. This result suggests that the inexpensive metal-assisted wet chemical nanotexture method is prospective to be used in photovoltaic industry. Keywords Silicon solar cell Nanoporous silicon Antireflection Ag nanoparticles Chemical etching 1 Introduction In order to maximize the amount of absorbed incident light which can be converted to electricity, minimization of surface reflection losses is required strongly for high efficiency silicon solar cells. Typically, the reflectance is normally reduced in crystalline silicon by applying pyramidal texturing [1,2] and antireﬂection (AR) layers deposition [3] on the surface. However, the average reflectance (>10%) in the wavelength range of 400–1100nm after current pyramid texture process is still high, which prevents improving the conversion efficiency of solar cells further. Furthermore, the interference single-layer structure of AR coating works only in a narrow spectral range and a limited angular of incident photons and the fabrication is expensive due to using vacuum equipments compared to chemical methods. The nanoporous structures provide a promising approach to minimize surface reﬂection and replace conventional AR interference layers in Si solar cells [4]. In generally, the nanoporous surface can be formed by chemical etching in HF/HNO3 solutions or forward-biased electrochemical anodic etching [5–8]. In recent years, metal-assisted chemical etching has attracted increasing attention in the potential solar cell application for nanotexturing. Because it is a simple, fast and low cost process to reduce the reﬂectance of Si surface [9–13]. However, among the previous reports, the nanoporous layer was made on p-type silicon surface directly or the emitter surface which the screen printing process had applied on [13–16]. In the former case, the complicated nanoporous structure would impede the formation of a p–n junction [13,17]. Furthermore, in the solar cell fabrication procedure (phosphorus diffusion and phosphorosilicate glass removing), the nanoporous structure would be damaged or even disappeared. In addition, residual noble metals would also be detrimental to minority carrier lifetime of silicon and then to the efficiency of solar cells. In the latter case, metal grid would be dissolved causing the degradation of the fill factor (FF) and then cell efficiency [14]. Therefore, development of new methods to realize the antireflection ability of nanoporous silicon on the solar cell device is required. In this paper, we develop a novel procedure to fabricate the nanoporous structures on the emitters of 125mm×125mm silicon solar cells based on a standard industry process. Since our process could preserve the nanoporous structure of solar cells to a large extent and avoid damaging the metal grid compared to the peer's work [15], measurements such as reflectance and current–voltage (I–V) have shown a significant improvement in nanotextured solar cell performance compared with reference solar cell. Our work suggests the nanoporous silicon solar cell is prospective for the practical application in photovoltaic industry. 2 Experimental details 2.1 Materials The p-type solar grade CZ (100) Si wafers (1–3Ωcm, 125mm×125mm) were purchased from Shuqimeng Photovoltaic Technology Co., Ltd., Hangzhou, China. The HF (49%, AR), potassium hydroxide (KOH, AR), silver nitrate (AgNO3, AR), formaldehyde solution (CH2O, AR), ammonium hydroxide (NH3·H2O, 28–30% NH3, AR), isopropyl alcohol (IPA, (CH3)2CHOH, AR) and the polyvinylpyrrolidone (PVP, K-30) were purchased from Sinopharm Chemical Reagent Co., Ltd. 2.2 The preparation of silver nanoparticles The size-controlled colloidal Ag nanoparticles were synthesized by the method reported in the previous work from our group [18]. 37% CH2O was added into AgNO3 water solution using polyvinylpyrrolidone (PVP) as a surfactant, after that concentrated ammonia (28%) was injected to initiate the reaction. The reaction mixture was stirred for 30min before centrifuging. Fabrication of nanoporous silicon layers and nanoporous silicon solar cells. After removing the oxide layers on the surfaces by a 1% HF solution, pyramid structures were formed in a mixture of 3wt% KOH and 7vol% IPA solution at 80°C for 60min. After that the wafers were washed in an ultrasonic bath with deionized water for 5min. Then, the emitters (n-type layers) were thermally generated using POCl3 as the phosphorous-doped source. After removing the remaining phosphorous silicate glass, the wafers were immersed into the deionized water (DIW) containing Ag NPs while the rear surfaces were protected by the insulating tape from Ag NPs deposition. The solvent was evaporated in the atmosphere to make the Ag NPs firmly fixed on the Si wafer surfaces. Then, the wafers were etched in the HF:H2O2:DIW=1:5:10 (vol.) solution in the dark at room temperature at different time durations (2–5min) for Ag-catalyzed texturing. The residual Ag NPs on the nanotextured surfaces were removed by HNO3 and the etched wafers were finally rinsed with DIW. Followed by a normal solar cell fabrication process, after edge isolation, we fabricated the nanotextured cells with/without SiN x coating separately while the reference cells were treated only through a standardized alkali texturing. The rear (Al/Ag) and front metal (Ag) for electrical contacts were printed by a conventional screen-printing method. 2.3 Characterization The morphology of Ag nanoparticles (Ag NPs) was characterized by a transmission electron microscope (TEM, Philips CM200). The morphology and structures of the etched samples were characterized by a field emission scanning electron microscope (FESEM Hitachi U-70). Hemispherical reflectance spectra were measured on a spectrometer (Hitachi U-4100 Spectrophotometer) with an integrating sphere. Electrical characterization of the solar cells was carried out using an I–V and spectral response system (SEIKO NPC Co, Model: NCT-180AA-T14) under AM 1.5G spectral irradiance (100mW/cm2 at 25°C). 3 Results and discussion 3.1 Structure characterization and the reflectance characteristics Fig. 1S(a) shows the TEM micrograph of the Ag NPs prepared in our experiment. Obviously, the Ag NPs are sphere-like. The size uniformly distributes in 60–70nm range resulting from PVP regulating the Ag NPs growth process. Fig. 1S(b) shows the distribution of Ag NPs deposited on the pyramid structure. We can observe that the Ag NPs distribute uniformly on the silicon wafer surface. Fig. 1(a) shows the cross-sectional microstructure of Si wafer before Ag-catalyzed texturing. The obtained average sheet resistance is about 20Ω/sq, which is due to a heavily doped diffusion condition applied on the sample. Fig. 1(b)–(d) displays the cross-sectional microstructures of Si solar cells after nanotexture for different etching times. It can be seen that, with the increase of etching time, the depth of nanoporous structures increases. And this trend is showed clearly in Fig. 2 . To insure the performance of nanoporous silicon solar cells, the nanoporous layers should not penetrate cross the p–n junction. Fig. 3 displays the reflectance (R(λ)) spectra for the pyramid-nanoporous samples etched for different time. It clearly shows that the average R(λ) of the nanotextured Si wafers decreases gradually with the increasing etching time. After 2min etching, the reflectivity dramatically decreases especially in the short wavelengths. The average reflectance (R ave) below 5% is achieved in the Si wafer etched for 5min. In this case, the depth of prorus structures is about 100nm. The morphology of the etched Si surface as shown in Fig. 1 has a direct relation with the low surface reflectance. By forming the nanoporous structure on the pyramid surface of solar cells, a refractive index gradient is introduced between air and silicon wafer, which precludes the Fresnel reflection at a sharp surface interface with large refractive index difference. According to the numerical simulation by Hitoch et al. [16], when the aspect ratio of the nanotexture is high, the great suppression of reflectance over a wide spectral bandwidth happens. What's more, the formation of hierarchical structures composed of nano- and micro-scale roughness features could reduce the reflectance more effectively [19,20]. For these reasons, the R ave of the Si wafer etched for 5min is below 5% while the etched depth is only about 100nm. 3.2 Performance of the nanotextured silicon solar cells Fig. 4(a) shows the current–voltage characteristics of the experimental solar cells with the nanotextured surface and the reference cell without nanotexturing under 1 sun illumination (AM 1.5). Both of the cells are not coated with SiN x . The corresponding electrical parameters include the short circuit current (I sc), open circuit voltage (V oc), fill factor (FF), efficiency (E ff ), series (R s) and shunt (R sh) resistances and emitter dark saturation current density (J oe) are given in Table 1 . It shows that the highest efficiency of 15.7% has been obtained for the nanotextured solar cells without any passivation coating. The result is better than those previous results obtained from nanopores made on p-type substrate or completed solar cells [13–16]. The efficiency of reference solar cell without AR layer deposition is only 13.72%. The significant enhancement of photocurrent could be explained by the AR property of the nanoporous surface and the short wavelength (blue light) response for the dead layer partly removed during the etching process and the relatively low R s indicates that good quality electrical contacts could be realized on nanotextured surfaces. However, the larger surface area due to nanotexture will increase the surface recombination, which causes the leakage current increasing and then a decrease of R sh. In order to passivate the nanoporous layers, we apply SiN x coatings on the emitter surfaces by PECVD and the thickness of the SiN x layers is about 80nm. As shown in Fig. 4(b) and Table 1, most of the electrical parameters of the nanotextured solar cell with SiN x coating, compared to the one without SiN x coating, are improved except the R s, R sh and FF. The reason may be that the residual Ag NPs diffused into the body of the silicon during the relatively long-time high-temperature PECVD process. But the performance of experimental solar cells remains superior to the reference cell. This is mainly owing to the significantly increasing of short-circuit current (0.455A absolute, the effective area of the cell is 154.83cm2). 4 Conclusion In summary, for the first time, we have fabricated a 15.7%-efficiency solar cell with nanoporous structures on a full size, solar grade CZ Si wafer on basis of a standard solar cell process except for SiN x coating. The nanoporous structures were formed by the assistant of size-controlled Ag NPs as catalyst. After 5min etching, the R ave below 5% in the visible spectrum could be achieved. The new process clearly shows the conversion efficiency of Si solar cells increases from 13.72% to 15.7% due to the antireflection effect of the nanoporous layer even without additional AR layer deposition (SiN x ). By applying SiN x passivation coating on the surface the efficiency of the nanotextured Si solar cells increased by 1.98% absolutely. This process is prospective to be used in photovoltaic industry. Acknowledgments This work is supported by the 863 Project (No. 2011AA050517), the Fundamental Research Funds for the Central Universities and Innovation Team Project of Zhejiang Province (No. 2009R50005) for the financial support. Appendix A Supplementary data Supplementary data associated with this article can be found, in the online version, at http://dx.doi.org/10.1016/j.apsusc.2012.10.079. Appendix A Supplementary data The following are the supplementary data to this article: References [1] P. Campbell M.A. Green Light trapping properties of pyramidally textured surfaces J. Appl. Phys. 62 1987 243 249 [2] P.K. Singh R. Kumar M. Lal S.N. Singh B.K. Das Effectiveness of anisotropic etching of silicon in aqueous alkaline solutions Sol. Energy Mater. Sol. Cells 70 2001 103 113 [3] M.A. Green Silicon Solar Cells: Advanced Principles and Practice 1995 Bridge Sydney [4] R.B. Stephens G.D. Cody Optical reflectance and transmission of a textured surface Thin Solid Films 45 1977 19 29 [5] E.S. Kooij K. Butter J.J. Kelly Silicon etching in HNO3/HF solution: charge balance for the oxidation reaction Electrochem. Solid-State Lett. 2 4 1999 178 180 [6] A. Krotkus K. Grigoras V. Paebutas I. Barsony E. Vazsonyib M. Friedb J. Szlufcikc J. Nijsc C. Levy-Clementd Efficiency improvement by porous silicon coating of multicrystalline silicon solar cells Sol. Energy Mater. Sol. Cells 45 1997 267 273 [7] B. González-Díaz R. Guerrero-Lemus P. Haro-Gonzalez D. Borchert C. Hern ández-Rodríguez Down-conversion properties of luminescent silicon nanostructures formed and passivated in HNO3-based solutions Thin Solid Films 511–512 2006 473 [8] N. Marrero R. Guerrero-Lemus B. González-Díaz D. Borchert Effect of porous silicon stain etched on large area alkaline textured crystalline silicon solar cells Thin Solid Films 517 2009 2648 2650 [9] K. Srivastava Sanjay Dinesh Kumar Vandana Mukul Sharma Ravi Kumar P.K. Singh Silver catalyzed nano-texturing of silicon surfaces for solar cell applications Sol. Energy Mater. Sol. Cells 100 2012 33 38 [10] X. Li P.W. Bohn Metal-assisted chemical etching in HF–H2O2 produces porous silicon Appl. Phys. Lett. 77 2000 2572 2574 [11] Zhipeng Huang Nadine Geyer Peter Werner Johannes de Boor Ulrich Gösele Metal-assisted chemical etching of silicon: a review Adv. Mater. 23 2011 285 308 [12] C. Chartier S. Bastide C. Lévy-Clément Metal-assisted chemical etching of silicon in HF–H2O2 Electrochimica Acta 53 2008 5509 5516 [13] Xin Gu Xuegong Yu Tao Liu Dongsheng Li Deren Yang The modulation of surface texture for single-crystalline Si solar cells using calibrated silver nanoparticles as a catalyst Nanotechnology 22 2011 025703 [14] Bum Sung Kim Don Hee Lee Sun Hee Kim Guk-Hwan An Kun-Jae Lee Nosang V. Myung Yong-Ho Choa Silicon solar cell with nanoporous structure formed on a textured surface J. Am. Ceram. Soc. 92 2009 2415 2417 [15] K. Tsujino M. Matsumura Formation of a low reﬂective surface on crystalline silicon solar cells by chemical treatment using Ag electrodes as the catalyst Sol. Energy Mater. Sol. Cells 90 2006 1527 1532 [16] Hitoshi Sai Homare Fujii Koji Arafune Yoshio Ohshita Yoshiaki Kanamori Hiroo Yugami Masafumi Yamaguchi Wide-angle antireflection effect of subwavelength structures for solar cells Jpn. J. Appl. Phys. 46 2007 3333 3336 [17] K. Tsujinoa M. Matsumuraa Y. Nishimotob Texturization of multicrystalline silicon wafers for solar cells by chemical treatment using metallic catalyst Sol. Energy Mater. Sol. Cells 90 2006 100 110 [18] Tao Liu Dongsheng Li Deren Yang Minhua Jiang Size controllable synthesis of ultrafine silver particles through a one-step reaction Mater. Lett. 65 2011 628 631 [19] Xuewen Geng Zhe Qi Meicheng Li K. Duan Barrett Liancheng zhao W. Bohn Paul Fabrication of antireﬂective layers on silicon using metal-assisted chemical etching with in situ deposition of silver nanoparticle catalysts Sol. Energy Mater. Sol. Cells 103 2012 98 107 [20] Dianpeng Qi Nan Lu Hongbo Xu Bingjie Yang Chunyu Huang Miaojun Xu Liguo Gao Zhouxiang Wang Lifeng Chi Simple approach to wafer-scale self-cleaning antireflective silicon surfaces Langmuir 25 2009 7769 7772", "scopus-id": "84870491985", "coredata": {"eid": "1-s2.0-S0169433212018041", "dc:description": "A simple process for nanotexturing on the emitter of silicon solar cells using catalyzed wet chemical etching by size-controlled silver nanoparticles was reported. A fine textured black surface was achieved to realize the low light reflectivity less than 5%. After screen printing and firing by the industrial standard fabrication protocol, we obtained the nanotextured Si solar cells with 15.7%-efficiency without any additional antireflection (AR) coating. This result suggests that the inexpensive metal-assisted wet chemical nanotexture method is prospective to be used in photovoltaic industry.", "openArchiveArticle": "false", "prism:coverDate": "2013-01-01", "openaccessUserLicense": null, "prism:aggregationType": "Journal", "prism:url": "https://api.elsevier.com/content/article/pii/S0169433212018041", "dc:creator": [{"@_fa": "true", "$": "Li, Dan"}, {"@_fa": "true", "$": "Wang, Lei"}, {"@_fa": "true", "$": "Li, Dongsheng"}, {"@_fa": "true", "$": "Zhou, Ning"}, {"@_fa": "true", "$": "Feng, Zhiqiang"}, {"@_fa": "true", "$": "Zhong, Xiaoping"}, {"@_fa": "true", "$": "Yang, Deren"}], "link": [{"@_fa": "true", "@rel": "self", "@href": "https://api.elsevier.com/content/article/pii/S0169433212018041"}, {"@_fa": "true", "@rel": "scidir", "@href": "https://www.sciencedirect.com/science/article/pii/S0169433212018041"}], "dc:format": "application/json", "openaccessType": null, "pii": "S0169-4332(12)01804-1", "prism:volume": "264", "prism:publisher": "Elsevier B.V.", "dc:title": "Formation of nanostructured emitter for silicon solar cells using catalytic silver nanoparticles", "prism:copyright": "Copyright © 2012 Elsevier B.V. All rights reserved.", "openaccess": "0", "prism:issn": "01694332", "dcterms:subject": [{"@_fa": "true", "$": "Silicon solar cell"}, {"@_fa": "true", "$": "Nanoporous silicon"}, {"@_fa": "true", "$": "Antireflection"}, {"@_fa": "true", "$": "Ag nanoparticles"}, {"@_fa": "true", "$": "Chemical etching"}], "openaccessArticle": "false", "prism:publicationName": "Applied Surface Science", "openaccessSponsorType": null, "prism:pageRange": "621-624", "prism:endingPage": "624", "pubType": "fla", "prism:coverDisplayDate": "1 January 2013", "prism:doi": "10.1016/j.apsusc.2012.10.079", "prism:startingPage": "621", "dc:identifier": "doi:10.1016/j.apsusc.2012.10.079", "openaccessSponsorName": null}, "objects": {"object": [{"@category": "standard", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433212018041-mmc1.docx?httpAccept=%2A%2F%2A", "@multimediatype": "Microsoft Word file", "@type": "APPLICATION", "@size": "7214741", "@ref": "mmc1", "@mimetype": "application/word"}, {"@category": "standard", "@height": "256", "@width": "678", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433212018041-gr4.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "34357", "@ref": "gr4", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "233", "@width": "301", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433212018041-gr3.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "22842", "@ref": "gr3", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "276", "@width": "376", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433212018041-gr2.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "19409", "@ref": "gr2", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "499", "@width": "602", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433212018041-gr1.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "65855", "@ref": "gr1", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "169", "@width": "500", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433212018041-fx1.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "19562", "@ref": "fx1", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "83", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433212018041-gr4.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "3337", "@ref": "gr4", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "164", "@width": "212", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433212018041-gr3.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "4721", "@ref": "gr3", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "161", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433212018041-gr2.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "3880", "@ref": "gr2", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "164", "@width": "198", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433212018041-gr1.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "14867", "@ref": "gr1", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "74", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433212018041-fx1.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "4115", "@ref": "fx1", "@mimetype": "image/gif"}]}, "link": {"@rel": "abstract", "@href": "https://api.elsevier.com/content/abstract/scopus_id/84870491985"}}