{"scopus-eid": "2-s2.0-85044141836", "originalText": "serial JL 271572 291210 291940 31 Materials Letters MATERIALSLETTERS 2018-03-17 2018-03-17 2018-03-30 2018-03-30 2019-01-17T20:48:33 1-s2.0-S0167577X18304567 S0167-577X(18)30456-7 S0167577X18304567 10.1016/j.matlet.2018.03.092 S300 S300.3 FULL-TEXT 1-s2.0-S0167577X18X00068 2019-01-17T21:30:55.481935Z 0 0 20180615 2018 2018-03-17T23:51:11.944582Z articleinfo articletitlenorm authfirstinitialnorm authfirstsurnamenorm cid cids contenttype copyright crossmark dateloaded dateloadedtxt datesearch datesort dateupdated dco docsubtype doctype doi eid ewtransactionid hubeid indexeddate issn issnnorm itemstage itemtransactionid itemweight openaccess openarchive pg pgfirst pglast pii piinorm pubdatestart pubdatetxt pubyr sortorder srctitle srctitlenorm srctype ssids alllist content subj subheadings suppl tomb volfirst volissue volumelist webpdf webpdfpagecount yearnav figure table body acknowledge affil articletitle auth authfirstini authfull authkeywords authlast grantnumber grantsponsor highlightsabst orcid primabst ref 0167-577X 0167577X true 221 221 C Volume 221 24 85 88 85 88 20180615 15 June 2018 2018-06-15 2018 article sco © 2018 Elsevier B.V. All rights reserved. CONTROLLABLENANOTEXTURINGDIAMONDWIRESAWINGPOLYSILICONWAFERSTHROUGHLOWCOSTCOPPERCATALYZEDCHEMICALETCHING SHENG G 1 Introduction 2 Experimental sections 3 Result and discussion 4 Conclusions Acknowledgments References YU 2012 337 342 X CAO 2015 132 138 F CHEN 2015 148 155 K XIAO 2016 8 12 Z KUMAGAI 2015 216 222 A ZHANG 2017 8510 8518 C WANG 2017 40 46 Q SHIBATA 1994 2553 2555 T KAILER 1997 3057 3063 A WANG 2015 1 6 Y CAO 2016 36 41 M HARDESTY 1970 168 172 D MAVROKEFALOS 2012 2792 2796 A ZOU 2017 1 10 Y SHENGX2018X85 SHENGX2018X85X88 SHENGX2018X85XG SHENGX2018X85X88XG 2020-03-30T00:00:00.000Z UnderEmbargo http://creativecommons.org/licenses/by-nc-nd/4.0/ © 2018 Elsevier B.V. All rights reserved. item S0167-577X(18)30456-7 S0167577X18304567 1-s2.0-S0167577X18304567 10.1016/j.matlet.2018.03.092 271572 2019-01-17T21:30:55.481935Z 2018-06-15 1-s2.0-S0167577X18304567-main.pdf https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0167577X18304567/MAIN/application/pdf/6d3488c90072522e3e494bce57792b29/main.pdf main.pdf pdf true 1558010 MAIN 4 1-s2.0-S0167577X18304567-main_1.png https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0167577X18304567/PREVIEW/image/png/6115f50a747804655a75c4b6a959bb05/main_1.png main_1.png png 56006 849 656 IMAGE-WEB-PDF 1 1-s2.0-S0167577X18304567-gr1.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0167577X18304567/gr1/THUMBNAIL/image/gif/028aac69aede1d381a744f4b31eaf3a6/gr1.sml gr1 gr1.sml sml 15532 60 219 IMAGE-THUMBNAIL 1-s2.0-S0167577X18304567-gr2.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0167577X18304567/gr2/THUMBNAIL/image/gif/5c08640b7d1f17b8282827e41d28b052/gr2.sml gr2 gr2.sml sml 32332 164 186 IMAGE-THUMBNAIL 1-s2.0-S0167577X18304567-gr3.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0167577X18304567/gr3/THUMBNAIL/image/gif/8b4ee0d7e6a2d55759256d8beb3651d1/gr3.sml gr3 gr3.sml sml 46378 164 187 IMAGE-THUMBNAIL 1-s2.0-S0167577X18304567-gr1.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0167577X18304567/gr1/DOWNSAMPLED/image/jpeg/030db12577003d038130decff908a824/gr1.jpg gr1 gr1.jpg jpg 56940 203 734 IMAGE-DOWNSAMPLED 1-s2.0-S0167577X18304567-gr2.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0167577X18304567/gr2/DOWNSAMPLED/image/jpeg/549a2a7d2c9e55a50bfc7a209195aedc/gr2.jpg gr2 gr2.jpg jpg 149978 581 660 IMAGE-DOWNSAMPLED 1-s2.0-S0167577X18304567-gr3.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0167577X18304567/gr3/DOWNSAMPLED/image/jpeg/840a59b9699a7e8c51f1fcab2fd4f9ba/gr3.jpg gr3 gr3.jpg jpg 91089 331 378 IMAGE-DOWNSAMPLED 1-s2.0-S0167577X18304567-gr1_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0167577X18304567/gr1/HIGHRES/image/jpeg/8ed9f1ab414ee317562438ecc56567d6/gr1_lrg.jpg gr1 gr1_lrg.jpg jpg 284044 792 2867 IMAGE-HIGH-RES 1-s2.0-S0167577X18304567-gr2_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0167577X18304567/gr2/HIGHRES/image/jpeg/ef2f03a1c9c5137b7262e3e76f38638f/gr2_lrg.jpg gr2 gr2_lrg.jpg jpg 854365 2272 2579 IMAGE-HIGH-RES 1-s2.0-S0167577X18304567-gr3_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0167577X18304567/gr3/HIGHRES/image/jpeg/17ae06fb57dcb82f52b0719ff1be6a78/gr3_lrg.jpg gr3 gr3_lrg.jpg jpg 453262 1466 1673 IMAGE-HIGH-RES MLBLUE 24053 S0167-577X(18)30456-7 10.1016/j.matlet.2018.03.092 Elsevier B.V. Fig. 1 SEM images of un-etched DWS mc-silicon wafers (A), metallographic micrographs of DWS mc-silicon wafers by HF/HNO3 etching (B), reflectivity of DWS mc-silicon wafers before and after the HF/HNO3 etching (C). Fig. 2 SEM image of the DWS mc-silicon wafers under different copper species-catalyzed etching system. A and (a): HF/CuSO4/H2O2, B and (b): HF/CuCl2/H2O2, C and (c): HF/Cu(NO3)2/H2O2, (d) and (e) are top and cross SEM characterizations for single inverted pyramid. (D) Reflectance spectra of the DWS mc-silicon wafers under the three selected etching system. Fig. 3 The minority carrier life of DWS mc-silicon wafers under different etching system:(A) Unetched DWS mc-silicon wafers, (B) HF/CuSO4/H2O2, (C) HF/CuCl2/H2O2,(D) HF/Cu(NO3)2/H2O2. Table 1 Etching conditions of DWS multicrystalline silicon wafers by HF/HNO3 system and Cu-catalyzed chemical etching system. HF/HNO3 etching [HF]/V [HNO3]/V [DI]/V Etching time/min Sample no. 20 mL 10 mL 50 mL 20 Sample 1 Cu-catalyzed etching [HF]/M [H2O2]/M [CuSO4]/M Etching time/min Sample 2 5.6 3.0 0.05 15 [HF]/M [H2O2]/M [CuCl2]/M Etching time/min Sample 3 5.6 3.0 0.05 15 [HF]/M [H2O2]/M [Cu(NO3)2]/M Etching time/min Sample 4 5.6 3.0 0.05 15 Controllable nano-texturing of diamond wire sawing polysilicon wafers through low-cost copper catalyzed chemical etching Guizhang Sheng a YuXin Zou a Shaoyuan Li a ⁎ Wenhui Ma a Zhao Ding b Fengshuo Xi a Chao Geng a Zudong He a Zhengjie Chen a Jia Yang a Yun Lei a a State Key Laboratory of Complex Nonferrous Metal Resources Clean Utilization/Faculty of Metallurgical and Energy Engineering, Kunming University of Science and Technology, Kunming 650093, China State Key Laboratory of Complex Nonferrous Metal Resources Clean Utilization/Faculty of Metallurgical and Energy Engineering Kunming University of Science and Technology Kunming 650093 China b Department of Mechanical, Materials and Aerospace Engineering, Illinois Institute of Technology, Chicago, USA Department of Mechanical Materials and Aerospace Engineering Illinois Institute of Technology Chicago USA ⁎ Corresponding author. The depressing texturation and stubborn directional saw marks on diamond wire sawing (DWS) polysilicon wafers has resulted in severe limitations for the mass application of DWS technology in PV market. Herein, a simple and low-cost copper-assisted chemical etching method was presented to controllably nano-texturing DWS polysilicon wafers. The work firstly reveals the adjustment of anion species in copper salts can readily control the nanostructure during the copper-catalyzed etching process. After etching, the obtained inverted pyramid structure can effectively reduce the reflectivity of the silicon wafer surface, the reflectance can be as low as 5.8% in the wavelength range of 300–1100 nm. Moreover, the surface saw marks are removed after etching, and the novel texture method guarantee the low recombination rates. The effective texturing method shows a promising potential application in the photovoltaic field. Keywords Semiconductors Copper-catalyzed chemical etching Microstructure Antireflection properties 1 Introduction Diamond wire sawing (DWS) technique has the prospect of becoming the next-generation slicing technique for fabricating low-cost Si solar cells, because of its intrinsic advantages, such as higher productivity, lower material loss, higher precision in cutting thin wafer and less surface damages [1]. However, the conventional isotropic texturization system of HNO3/HF used in multi-wire slurry sawing (MWSS) polysilicon wafers cannot effectively reduce the reflection of DWS wafers [2,3], which has caused that the DWS polysilicon wafers are still unacceptable in the current photovoltaic (PV) industry [4]. Metal-catalyzed chemical etching (MCCE) is considered a potential alternative for texturing DWS polysilicon wafers due to its simple and low-cost [5–7]. However, compared with the gold or silver-assisted silicon etching, the copper-assisted etching in the conventional HF/Cu(NO3)2 system is low efficiency [8,9], which is mainly attributed to low redox potential (∼0.34 eV) of Cu2+/Cu. Furthermore, copper ions have preferential formation of dense copper film on the Si surface, which will hinder the etching of Si [10]. It has been proved that addition oxidant with higher redox potential (such as H2O2 or FeCl3) in etching system would suppress the formation of dense copper film and improve silicon etching [11]. In this work, a novel copper-assisted chemical etching method was presented to controllably nano-texture DWS polysilicon wafers. The large-scale inverted pyramid arrays with excellent antireflection and saw marks removing ability have been obtained which is crucial to prepare high-efficiency solar cell and reduces photovoltaic (PV) power cost. 2 Experimental sections The p-type DWS polysilicon wafers with thickness of 200 ± 20 μm and resistivity of 1–3 Ω cm were used, and the wafers were sliced into size of 30 × 30 mm2. Before etching, the wafers were cleaned in acetone, ethanol and deionized water for 10 min under sonication, respectively. And then the samples were immersed in 10% HF solution for 10 min in order to remove native SiO2. Subsequently, these wafers were put into the etching solution, and the detailed etching parameters were shown in Table 1 . After that, samples were immersed in concentrated HNO3 solution to eliminate residual Cu-NPs. At last the etched Si wafers were thoroughly rinsed with distilled water and dried under dry nitrogen. The morphologies of as-fabricated samples surfaces were analyzed by scanning electron microscopy (SEM, FEI, USA). The surface reflectivity of wafers was measured by the Ocean Optic USB-4100 fiber spectrometer with an integrating sphere. The µ-photoconductance decay function of Semilab WT-2000/2M was used to measure the effective lifetime before and after texturing. 3 Result and discussion Numerous brittle grooves and pits, and parallel plastic saw marks are observed on the as-cut DWS polysilicon wafers surface (as shown in Fig. 1 A). According to the previous research [6,7], the smooth saw marks region was covered by amorphous layers, which were caused by the plastic friction during the DWS process. The grooves with depth of 0.1–0.8 μm are mainly due to the fragile stripping. After etching in HF/HNO3 system, some worm-like groove are preferentially formed in brittle damage zone, the smooth plastic region show stubborn anti-etching ability and the saw marks are still observed. As expected, the reflectivity characterizations indicate an awful antireflection ability for isotropic acidic etching. In order to improve the unsatisfied texturization, the copper-catalyzed chemical etching was introduced to etch the wafer. The morphologies of samples were characterized after etching under the three different etching system. Fig. 2 (a) shows that, after the etching under HF/CuSO4/H2O2 system, all cutting marks and deep grooves are discovered on the surfaces of sample 2, and numerous ditch-like structures with various lengths are present according the magnified characterization. Fig. 2(b) tells that, with CuCl2, the cutting marks are dramatically reduced, at the same time, the uniform, shallow and wormlike pits are formed on the etched wafer surface. It should be noted that the resulting wormlike texturization structure is slightly similar to multi-wire slurry sawing (MWSS) polysilicon wafers endured by HNO3/HF etching system. Fig. 2(c) presents that with HF/Cu(NO3)2/H2O2 etching system, the cutting marks disappear and numerous uniform square holes structure are observed on DWS polysilicon wafers surface. According to the Fig. 2(d) and (e), the holes have inverted pyramids structure with wide of 1.5–2.5 μm and depth of 1.5–3 μm. The magnified cross-sectional SEM image reveals that the numerous etching pits were present on inverted pyramid sidewalls, which can be attributed to the copper nanoparticles nucleation and dissolution of silicon sidewall. Although the concentrations of HF, H2O2 and copper ions are same, the anion species in copper salts can affect the deposition and etching behaviors, subsequently control the nanostructure during the etching process [12]. After etching, the surface color of Si wafers turns from steel gray (original wafer) to gray (CuCl2), yellowish-brown (CuSO4) and black-brown (Cu(NO3)2), respectively. The reflectance spectra results indicate that different improvement of light trapping have been achieved through copper-assisted texturing treatment under different copper salt system, and one noteworthy phenomenon is that the inverted pyramid structure has presented excellent antireflection ability. The average reflectivity dramatically reduces from 41.8% to 5.8% in the wavelength range of 300 ∼ 1100 nm. The excellent antireflection ability of inverted pyramid structure has been confirmed by the previous numerical simulation results [13], which show a promising application potential in the low-cost DWS polysilicon solar cell. Fig. 3 presents the µ-photoconductance decay (µ-PCD) lifetime maps of 3 cm × 3 cm sample. It indicates that without etching, the average effective carrier lifetimes (τeff) of naked DWS wafer is 1.20 μs, and after the CuSO4, CuCl2 and Cu(NO3)2-catalyzed texturing, the average carrier lifetime of the textured wafers are 1.312 μs, 1.395 μs and 1.422 μs, respectively. This increasing change trend is similar to the previous texturing process that combines TMAH pre-polishing and routine NaOH texture [3]. Compared with the silver-catalyzed texturization [14], the results in this work demonstrate that the inverted pyramidal structure has an attractive potential to balance both the maximum antireflection and effective carrier lifetimes at the same time. 4 Conclusions In summary, a novel and low cost texturing technique based on the copper-assisted chemical etching method has been proposed to successfully and controllably texture DWS polysilicon wafers. With this technique, ditch-like, wormlike and inverted pyramidal structure can be readily achieved by adjusting copper salts species. It is worth mentioning that the large-scale inverted pyramid arrays can be obtained, which is advantageous to balance the maximum antireflection and effective carrier lifetimes at the same time. Based on this, the copper-catalyzed etching process could be an attractive potential alternate in the photovoltaic field. Acknowledgments Financial support of this work from the NSFC (No. 51504117,61764009, 51762043), Yunnan Youth Fund Project (2016FD037) and Talent Development Program of KUST (KKSY201563032), the Program for Innovative Research Team in University of Ministry of Education of China (No. IRT_17R48). References [1] X.G. Yu P. Wang X.Q. Li Thin Czochralski silicon solar cells based on diamond wire sawing technology Sol. Energy Mat. Sol. C. 98 2012 337 342 [2] F. Cao K.X. Chen J.J. Zhang Next-generation multi-crystalline silicon solar cells: diamond-wire sawing, nano-texture and high efficiency Sol. Energy Mat. Sol. C 141 2015 132 138 [3] K.X. Chen Y.Y. Liu X.S. Wang Novel texturing process for diamond-wire-sawn single-crystalline silicon solar cell Sol. Energ. Mat. Sol. C 133 2015 148 155 [4] Z.G. Xiao G.Y. Geng X.Q. Wei On the mechanism of the vapor etching of diamond wire sawn multi-crystalline silicon wafers for texturing Mat. Sci. Semicon. Proc. 53 2016 8 12 [5] A. Kumagai Texturization using metal catalyst wet chemical etching for multicrystalline diamond wire sawn wafer Sol. Energy Mat. Sol. C 133 2015 216 222 [6] C. Zhang S. Li W. Ma Fabrication of ultra-low antireflection SiNWs arrays from mc-Si using one step MACE J. Mater. Sci-Mater. Electron. 28 2017 8510 8518 [7] Q. Wang C. Pan K. Chen Efficient nanostructured quasi-single crystalline silicon solar cells by metal-catalyzed chemical etching Sol. Energy Mat. Sol. C 164 2017 40 46 [8] T. Shibata O. Atsushi K. Kenji Cross-section transmission electron microscope observations of diamond-turned single crystal Si surfaces Appl. Phys. Lett. 65 1994 2553 2555 [9] A. Kailer Y.G. Gogotsi K.G. Nickel Phase transformations of silicon caused by contact loading J. Appl. Phys. 81 1997 3057 3063 [10] Y. Wang L.X. Yang Y.P. Liu Maskless inverted pyramid texturization of silicon Sci. Rep. 5 2015 1 6 [11] M. Cao S. Li J. Deng Texturing a pyramid-like structure on a silicon surface via the synergetic effect of copper and Fe(III) in hydrofluoric acid solution Appl. Surf. Sci. 372 2016 36 41 [12] D.W. Hardesty Anion effects in copper deposition J. Electrochem. Soc. 117 1970 168 172 [13] A. Mavrokefalos S.E. Han Efficient light trapping in inverted nanopyramid thin crystalline silicon membranes for solar cell applications Nano Lett. 12 2012 2792 2796 [14] Y. Zou S. Li W. Ma Research on surface nano-texturation and wet-chemical passivation of multi-crystalline silicon wafer J. Mater. Sci-Mater. Electron. 5 2017 1 10", "scopus-id": "85044141836", "coredata": {"eid": "1-s2.0-S0167577X18304567", "dc:description": "The depressing texturation and stubborn directional saw marks on diamond wire sawing (DWS) polysilicon wafers has resulted in severe limitations for the mass application of DWS technology in PV market. Herein, a simple and low-cost copper-assisted chemical etching method was presented to controllably nano-texturing DWS polysilicon wafers. The work firstly reveals the adjustment of anion species in copper salts can readily control the nanostructure during the copper-catalyzed etching process. After etching, the obtained inverted pyramid structure can effectively reduce the reflectivity of the silicon wafer surface, the reflectance can be as low as 5.8% in the wavelength range of 300–1100 nm. Moreover, the surface saw marks are removed after etching, and the novel texture method guarantee the low recombination rates. The effective texturing method shows a promising potential application in the photovoltaic field.", "openArchiveArticle": "false", "prism:coverDate": "2018-06-15", "openaccessUserLicense": null, "prism:aggregationType": "Journal", "prism:url": "https://api.elsevier.com/content/article/pii/S0167577X18304567", "dc:creator": [{"@_fa": "true", "$": "Sheng, Guizhang"}, {"@_fa": "true", "$": "Zou, YuXin"}, {"@_fa": "true", "$": "Li, Shaoyuan"}, {"@_fa": "true", "$": "Ma, Wenhui"}, {"@_fa": "true", "$": "Ding, Zhao"}, {"@_fa": "true", "$": "Xi, Fengshuo"}, {"@_fa": "true", "$": "Geng, Chao"}, {"@_fa": "true", "$": "He, Zudong"}, {"@_fa": "true", "$": "Chen, Zhengjie"}, {"@_fa": "true", "$": "Yang, Jia"}, {"@_fa": "true", "$": "Lei, Yun"}], "link": [{"@_fa": "true", "@rel": "self", "@href": "https://api.elsevier.com/content/article/pii/S0167577X18304567"}, {"@_fa": "true", "@rel": "scidir", "@href": "https://www.sciencedirect.com/science/article/pii/S0167577X18304567"}], "dc:format": "application/json", "openaccessType": null, "pii": "S0167-577X(18)30456-7", "prism:volume": "221", "prism:publisher": "Elsevier B.V.", "dc:title": "Controllable nano-texturing of diamond wire sawing polysilicon wafers through low-cost copper catalyzed chemical etching", "prism:copyright": "© 2018 Elsevier B.V. All rights reserved.", "openaccess": "0", "prism:issn": "0167577X", "dcterms:subject": [{"@_fa": "true", "$": "Semiconductors"}, {"@_fa": "true", "$": "Copper-catalyzed chemical etching"}, {"@_fa": "true", "$": "Microstructure"}, {"@_fa": "true", "$": "Antireflection properties"}], "openaccessArticle": "false", "prism:publicationName": "Materials Letters", "openaccessSponsorType": null, "prism:pageRange": "85-88", "prism:endingPage": "88", "pubType": "sco", "prism:coverDisplayDate": "15 June 2018", "prism:doi": "10.1016/j.matlet.2018.03.092", "prism:startingPage": "85", "dc:identifier": "doi:10.1016/j.matlet.2018.03.092", "openaccessSponsorName": null}, "objects": {"object": [{"@category": "thumbnail", "@height": "60", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0167577X18304567-gr1.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "15532", "@ref": "gr1", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "164", "@width": "186", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0167577X18304567-gr2.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "32332", "@ref": "gr2", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "164", "@width": "187", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0167577X18304567-gr3.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "46378", "@ref": "gr3", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "203", "@width": "734", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0167577X18304567-gr1.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "56940", "@ref": "gr1", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "581", "@width": "660", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0167577X18304567-gr2.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "149978", "@ref": "gr2", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "331", "@width": "378", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0167577X18304567-gr3.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "91089", "@ref": "gr3", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "792", "@width": "2867", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0167577X18304567-gr1_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "284044", "@ref": "gr1", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "2272", "@width": "2579", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0167577X18304567-gr2_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "854365", "@ref": "gr2", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "1466", "@width": "1673", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0167577X18304567-gr3_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "453262", "@ref": "gr3", "@mimetype": "image/jpeg"}]}, "link": {"@rel": "abstract", "@href": "https://api.elsevier.com/content/abstract/scopus_id/85044141836"}}