{"scopus-eid": "2-s2.0-84971333671", "originalText": "serial JL 271495 291210 291731 291732 291746 291809 291864 291865 291892 291893 31 Solar Energy Materials and Solar Cells SOLARENERGYMATERIALSSOLARCELLS 2016-05-24 2016-05-24 2016-05-24 2016-05-24 2019-11-05T07:55:51 1-s2.0-S0927024816301532 S0927-0248(16)30153-2 S0927024816301532 10.1016/j.solmat.2016.05.046 S300 S300.5 FULL-TEXT 1-s2.0-S0927024816X00104 2019-11-05T12:28:24.493061Z 0 0 20161201 20161231 2016 2016-05-24T16:44:54.554434Z articleinfo articletitlenorm authfirstinitialnorm authfirstsurnamenorm cid cids contenttype copyright crossmark dateloaded dateloadedtxt datesearch datesort dateupdated dco docsubtype doctype doi eid ewtransactionid hubeid indexeddate issn issnnorm itemstage itemtransactionid itemweight openaccess openarchive pg pgfirst pglast pii piinorm pubdateend pubdatestart pubdatetxt pubyr sortorder srctitle srctitlenorm srctype ssids alllist content subj subheadings suppl tomb volfirst volissue volumelist webpdf webpdfpagecount yearnav figure table body acknowledge affil articletitle auth authfirstini authfull authkeywords authlast grantnumber grantsponsor highlightsabst primabst ref 0927-0248 09270248 true 157 157 C Volume 157 8 48 54 48 54 201612 December 2016 2016-12-01 2016-12-31 2016 article fla © 2016 Published by Elsevier B.V. 076ABSOLUTEEFFICIENCYINCREASEFORSCREENPRINTEDMULTICRYSTALLINESILICONSOLARCELLSNANOSTRUCTURESBYREACTIVEIONETCHING CHEN W 1 Introduction 2 Experimental 3 Results and discussion 4 Conclusions Acknowledgments References CAMPBELL 1987 243 249 P ZHU 2010 J MAEDA 2014 39 42 M GARNETT 2010 1082 1085 E KANAMORI 2001 142 144 Y CHENG 2011 87 94 Y LIM 2009 1773 1778 H STEINERT 2005 843 850 M MAJUMDAR 2003 51 64 D DOBRZANSKI 2011 2745 2751 L ZHAO 1998 1991 1994 J LIU 2014 21 26 S YUE 2013 402 406 Z ZHONG 2013 200 204 S LIN 2013 138 142 H YOO 2011 2 6 J GANGOPADHYAY 2007 285 289 U RUBY 2005 146 149 D NOSITSCHKA 2003 155 166 W XIA 2011 1574 1578 Y CHENX2016X48 CHENX2016X48X54 CHENX2016X48XW CHENX2016X48X54XW 2018-05-24T00:00:00Z http://creativecommons.org/licenses/by-nc-nd/4.0/ © 2016 Published by Elsevier B.V. 2019-03-28T11:15:44.296Z http://vtw.elsevier.com/data/voc/AddOnTypes/50.7/nlp S0927024816301532 National Science Council of Taiwan NSC-102-2221-E-006-240-MY3 National Science Council http://data.elsevier.com/vocabulary/SciValFunders/501100001868 http://sws.geonames.org/1668284/ Ministry of Economic Affairs 103-EC-17-A-08-S1-216 Ministry of Economic Affairs http://data.elsevier.com/vocabulary/SciValFunders/501100004725 http://sws.geonames.org/1668284/ The authors gratefully acknowledge the financial support from the National Science Council of Taiwan under Grant NSC-102-2221-E-006-240-MY3 and the Ministry of Economic Affairs (Taiwan, ROC) through project 103-EC-17-A-08-S1-216 . item S0927-0248(16)30153-2 S0927024816301532 1-s2.0-S0927024816301532 10.1016/j.solmat.2016.05.046 271495 2019-11-05T12:28:24.493061Z 2016-12-01 2016-12-31 1-s2.0-S0927024816301532-main.pdf https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024816301532/MAIN/application/pdf/3818e3a8a01eed15f1da49ddbbcd53ba/main.pdf main.pdf pdf true 4110434 MAIN 7 1-s2.0-S0927024816301532-main_1.png https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024816301532/PREVIEW/image/png/d0d83fba266f26be9f5e3a750a768bc1/main_1.png main_1.png png 58696 849 656 IMAGE-WEB-PDF 1 1-s2.0-S0927024816301532-gr1.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024816301532/gr1/THUMBNAIL/image/gif/cdb8be1b526fa402264da0d58a6f9a4f/gr1.sml gr1 gr1.sml sml 14423 143 219 IMAGE-THUMBNAIL 1-s2.0-S0927024816301532-gr2.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024816301532/gr2/THUMBNAIL/image/gif/6b215c210fcc8b39817bf876f56486cc/gr2.sml gr2 gr2.sml sml 30965 163 219 IMAGE-THUMBNAIL 1-s2.0-S0927024816301532-gr3.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024816301532/gr3/THUMBNAIL/image/gif/1731ee9d2bcfa8e24819fc7ebf4832d8/gr3.sml gr3 gr3.sml sml 26019 164 206 IMAGE-THUMBNAIL 1-s2.0-S0927024816301532-gr4.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024816301532/gr4/THUMBNAIL/image/gif/4ce9457285d9dab07ecf0f62bf257498/gr4.sml gr4 gr4.sml sml 30350 164 207 IMAGE-THUMBNAIL 1-s2.0-S0927024816301532-gr5.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024816301532/gr5/THUMBNAIL/image/gif/d605e913c50b9a23122fc1f0685ca811/gr5.sml gr5 gr5.sml sml 22918 121 219 IMAGE-THUMBNAIL 1-s2.0-S0927024816301532-gr6.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024816301532/gr6/THUMBNAIL/image/gif/819150bdcfd0e807230b69b8f7355654/gr6.sml gr6 gr6.sml sml 13821 164 217 IMAGE-THUMBNAIL 1-s2.0-S0927024816301532-gr7.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024816301532/gr7/THUMBNAIL/image/gif/8a16710cfe294c73e990bea34e88f32b/gr7.sml gr7 gr7.sml sml 13413 162 219 IMAGE-THUMBNAIL 1-s2.0-S0927024816301532-gr8.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024816301532/gr8/THUMBNAIL/image/gif/53a6bf557fa11937c8af4c752398638a/gr8.sml gr8 gr8.sml sml 24932 164 184 IMAGE-THUMBNAIL 1-s2.0-S0927024816301532-gr1.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024816301532/gr1/DOWNSAMPLED/image/jpeg/e6b72589f3dfa1140d8e5676b3e6405b/gr1.jpg gr1 gr1.jpg jpg 51333 253 386 IMAGE-DOWNSAMPLED 1-s2.0-S0927024816301532-gr2.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024816301532/gr2/DOWNSAMPLED/image/jpeg/d26bf8817fb6d3bf4dc2e2dba583cd6a/gr2.jpg gr2 gr2.jpg jpg 104000 505 678 IMAGE-DOWNSAMPLED 1-s2.0-S0927024816301532-gr3.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024816301532/gr3/DOWNSAMPLED/image/jpeg/0f0739aaaba8f7343a85ee41558e5b63/gr3.jpg gr3 gr3.jpg jpg 167532 539 678 IMAGE-DOWNSAMPLED 1-s2.0-S0927024816301532-gr4.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024816301532/gr4/DOWNSAMPLED/image/jpeg/ec78106ea2626cdf26d701f5dc74c7c0/gr4.jpg gr4 gr4.jpg jpg 180998 538 678 IMAGE-DOWNSAMPLED 1-s2.0-S0927024816301532-gr5.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024816301532/gr5/DOWNSAMPLED/image/jpeg/3a7ffec82513f9995e90530d8f3ed182/gr5.jpg gr5 gr5.jpg jpg 137739 446 809 IMAGE-DOWNSAMPLED 1-s2.0-S0927024816301532-gr6.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024816301532/gr6/DOWNSAMPLED/image/jpeg/3fb076f0d3d7a7304bae9f3c2c4921ad/gr6.jpg gr6 gr6.jpg jpg 45948 291 386 IMAGE-DOWNSAMPLED 1-s2.0-S0927024816301532-gr7.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024816301532/gr7/DOWNSAMPLED/image/jpeg/25ce0c77962d6e2f8ea3790eace163be/gr7.jpg gr7 gr7.jpg jpg 40611 286 386 IMAGE-DOWNSAMPLED 1-s2.0-S0927024816301532-gr8.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024816301532/gr8/DOWNSAMPLED/image/jpeg/f560fd56a0f5cd6e8a7dd7514dd91e12/gr8.jpg gr8 gr8.jpg jpg 147794 603 678 IMAGE-DOWNSAMPLED 1-s2.0-S0927024816301532-gr1_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024816301532/gr1/HIGHRES/image/jpeg/3820b9e3d0e0e8858c5e64c1e9535988/gr1_lrg.jpg gr1 gr1_lrg.jpg jpg 227892 1118 1708 IMAGE-HIGH-RES 1-s2.0-S0927024816301532-gr2_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024816301532/gr2/HIGHRES/image/jpeg/02573b71072906501998334418a3b0b5/gr2_lrg.jpg gr2 gr2_lrg.jpg jpg 862884 2236 3000 IMAGE-HIGH-RES 1-s2.0-S0927024816301532-gr3_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024816301532/gr3/HIGHRES/image/jpeg/7504ec958becfd0a94750a4a10b0b9e8/gr3_lrg.jpg gr3 gr3_lrg.jpg jpg 2117739 2383 3000 IMAGE-HIGH-RES 1-s2.0-S0927024816301532-gr4_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024816301532/gr4/HIGHRES/image/jpeg/4b498a13dc0274a28be2badef861784c/gr4_lrg.jpg gr4 gr4_lrg.jpg jpg 1876607 2380 3000 IMAGE-HIGH-RES 1-s2.0-S0927024816301532-gr5_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024816301532/gr5/HIGHRES/image/jpeg/2f7f07b9d5a0a3135002637e153a8659/gr5_lrg.jpg gr5 gr5_lrg.jpg jpg 1452169 1976 3583 IMAGE-HIGH-RES 1-s2.0-S0927024816301532-gr6_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024816301532/gr6/HIGHRES/image/jpeg/e1f55a0b31387717aaa4f1bb9ef14066/gr6_lrg.jpg gr6 gr6_lrg.jpg jpg 242995 1288 1708 IMAGE-HIGH-RES 1-s2.0-S0927024816301532-gr7_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024816301532/gr7/HIGHRES/image/jpeg/90a720e02cdace93b5328a0910ff79fc/gr7_lrg.jpg gr7 gr7_lrg.jpg jpg 230424 1267 1708 IMAGE-HIGH-RES 1-s2.0-S0927024816301532-gr8_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024816301532/gr8/HIGHRES/image/jpeg/70b76e3acdea72001f4d710f0c5c5455/gr8_lrg.jpg gr8 gr8_lrg.jpg jpg 1579842 2666 3000 IMAGE-HIGH-RES SOLMAT 8330 S0927-0248(16)30153-2 10.1016/j.solmat.2016.05.046 Fig. 1 Fabrication process for screen-printed multi-crystalline Si solar cells with RIE texturing. Fig. 1 Fig. 2 The optical images of (a) is the original substrate with acidic pre-etching, (b) is the original substrate with alkaline pre-etching and (c) is the substrate with alkaline pre-etching under optimized RIE process conditions. Fig. 2 Fig. 3 SEM images inclined angle of 45° of textured surface etched with the gas flow ratios of Cl2 to O2 are (a) 0.5, (b) 1, (c) 2 and (d) 3 under the RF power of 100W and an etching time of 10min Fig. 3 Fig. 4 SEM images inclined angle of 45° of textured surface etched with the gas mixture flow ratios of SF6 to O2 are (a) 0.5, (b) 1, (c) 2 and (d) 3 under the RF power of 100W and an etching time of 10min Fig. 4 Fig. 5 SEM images inclined angle of 45° of textured surface etched with different ratios of Cl2:O2:SF6 are (a) 5:3:1, (b) 4:4:1, (c) 3:3::3, (d) 1:4:4, (e) 1:3:5, at an RF power of 100W and an etching time of 10min Fig. 5 Fig. 6 Front surface reflectance as a function of wavelength for the substrates etched under various conditions by RIE, all samples with anti-reflection coating of thickness 80±3nm and the refractive index of 2.2±0.05. Fig. 6 Fig. 7 The external quantum efficiency performance of solar cell devices fabricated by (a) wet texturing, (b) RIE process with Cl2:O2:SF6 ratio at 5:3:1 and (c) RIE process with Cl2:O2:SF6 ratio at 1:3:5. (For interpretation of the references to color in this figure, the reader is referred to the web version of this article.) Fig. 7 Fig. 8 The optical images of multi-crystalline solar cell devices fabricated by (a) wet texturing, (b) RIE process with Cl2:O2:SF6 ratio at 5:3:1 and (c) RIE process with Cl2:O2:SF6 ratio at 1:3:5. (For interpretation of the references to color in this figure, the reader is referred to the web version of this article.) Fig. 8 Table 1. Optical and electrical performance under the different flow ratio of Cl2 to O2 (each condition over 10 wafers average). Table 1 Process Avg. reflectance at λ300–900nm (%) Jsc gain (mA/cm2) Efficiency gain (%) FCl2/FO2=0.5 ~5.5 0.74 0.30 FCl2/FO2=1 ~7 0.49 0.25 FCl2/FO2=2 ~8.5 0.31 0.18 FCl2/FO2=3 ~10 0.12 0.03 Reference cell with SiNx ~12 – – Table 2. Optical and electrical performance under the different flow ratio of SF6 to O2 (each condition over 10 wafers average). Table 2 Process Avg. reflectance at λ300–900nm (%) Jsc gain (mA/cm2) Efficiency gain (%) FSF6/FO2=0.5 ~ 6 0.45 0.22 FSF6/FO2=1 ~ 5 0.89 0.35 FSF6/FO2=2 ~ 4.5 0.69 0.29 FSF6/FO2=3 ~ 8 0.39 0.14 Reference cell with SiNx ~12 – – Table 3. Comparison of solar cell efficiencies with the surface etched under different Cl2/O2/SF6 flow ratios (each condition over 10 wafers average). Table 3 Condition Voc (V) Jsc (mA/cm2) FF (%) Efficiency (%) Wet texturing 0.624 34.95 78.91 17.21 FCl2:FO2:FSF6=5:3:1 0.623 35.77 78.01 17.38 FCl2:FO2:FSF6=3:3:3 0.623 35.99 78.22 17.53 FCl2:FO2: FSF6=1:3:5 0.624 36.62 78.62 17.97 0.76% absolute efficiency increase for screen-printed multicrystalline silicon solar cells with nanostructures by reactive ion etching Wen-Hua Chen b Franklin Chau-Nan Hong a c d ⁎ a Department of Chemical Engineering, National Cheng Kung University, Taiwan Department of Chemical Engineering, National Cheng Kung University Taiwan b Department of Materials Science and Engineering, National Cheng Kung University, Taiwan Department of Materials Science and Engineering, National Cheng Kung University Taiwan c Center for Micro/Nano Science and Technology, National Cheng Kung University, Taiwan Center for Micro/Nano Science and Technology, National Cheng Kung University Taiwan d Advanced Optoelectronic Technology Center, National Cheng Kung University, Taiwan Advanced Optoelectronic Technology Center, National Cheng Kung University Taiwan ⁎ Corresponding author at: Department of Chemical Engineering, National Cheng Kung University, Taiwan. Department of Chemical Engineering, National Cheng Kung University Taiwan In this study, the reactive ion etching in combination with alkaline etching was employed to texture the surface of a 156×156mm2 multi-crystalline silicon wafers to reduce their solar reflectivity and improve conversion efficiency. Reactive gases comprising chlorine (Cl2), sulfur hexafluoride (SF6) and oxygen (O2), were activated in the radio-frequency (rf) plasma to fabricate pyramids in an reactive ion etching (RIE) system. The multi-crystalline Si substrates were etched in various compositions of gases to form the nanostructures of various shapes. Besides the nanoscale features, the high density of nanostructures formed on the multi-crystalline Si surface was also required to significantly reduce the reflectivity. A low reflectivity surface was successfully fabricated with the average reflectivity significantly reduced down to <2% for the wavelength range of 300–850nm. The short wavelength spectral response (blue response) improvement is observed in RIE textured solar cells compared to the standard textured cells. The RIE textured surfaces in combination with optimized emitter resistance result in a remarkable enhancement of short circuit current density. Compared with the acidic textured solar cells, the absolute conversion efficiency of the alkaline+RIE textured cells was improved by 0.76% in average. Keywords Nanostructure Anti-reflection Reactive ion etching Solar cell 1 Introduction Among all renewable energy resources, solar energy is considered as one of the most important alternative energy sources and has been actively pursued as the most promising technology. At present, crystalline silicon wafers remain the most widely used materials in the solar cell industry with relatively high efficiencies and reasonable costs to convert solar energy into electric energy. The surface texturing in crystalline silicon solar cells can reduce light reflection at the wafer surface. Reducing reflection on the top surface of solar cells is often needed for improving energy conversion efficiency. In order to improve the cell efficiency, light trapping structures such as surface texturing [1] and anti-reflection multilayer coatings [2] have been applied to the fabrication of solar cells. Nanotexturing of substrates has been widely studied, as it will reduce broad-band anti-reflection effectively and increase light trapping effects. A variety of techniques for fabricating anti-reflection nanostructures [3,4] are being studied. Some approaches involve conventional wet etching [5]. Wet texturing has been commonly used in the single crystal silicon (100) solar cell process by the acidic or alkaline solution [6–8]. The dry etching methods, such as mechanical diamond saw cutting [9], porous-Si etching [10], laser-structuring [11], photo-lithographically defined etching [12] and masked or maskless reactive ion etching (RIE) texturing, [13–20] etc. have recently been studied to help prepare the ideal surface textures. Reactive ion etching (RIE) texturing can provide us single-side, surface reflection controllable texturing with very little material loss, avoiding wafer breakage during processing, and reduction of chemical wastes. In the RIE process, it is relatively easy to control all parameters, thus a better reliability can be achieved. Furthermore, RIE process equipment is quite mature in performing anisotropic etching at high rates with a large production capacity, and thus can be easily integrated into an industrial production line for manufacturing solar cells. Therefore we only need to add RIE equipment into currently cell production line to achieve process integration. For the widespread use in solar cell industry, the costs of large capacity RIE equipment need to be reduced. In this paper, to achieve self-masking without the need to use the nanoscale mask and photolithography, the species and compositions of the gas mixtures as well as the process conditions were varied in the reactive ion etching process to fabricate the high aspect-ratio nanoscale pyramids over a large area within a short process time. 2 Experimental In this study, P-type multi-crystalline (mc) silicon wafers, with a size of 156×156mm2 and a thickness of 200µm, were used as the substrates. For acidic textured reference cell, the substrate was etched using acidic solution (5wt% HF+25wt% HNO3) at room temperature for an etching depth of 5µm. Before RIE texturing, the substrates were immersed in HF solution (HF:H2O=1:1) to remove the SiO2 layer, 20wt% KOH solution to remove the saw damage layer and then cleaned by DI water. Anti-reflection nanostructures were fabricated on these substrates by reactive ion etching (RIE) process, in which the plasma was generated by a radio frequency (RF) power supply with a frequency of 13.56MHz. RF power was applied to the substrate electrode inducing a negative dc self-bias on the substrate. The gas reactants of RIE process comprised chlorine (Cl2), sulfur hexafluoride (SF6), and oxygen (O2). The fabrication of nano-textures on the surface of multi-crystalline silicon substrate was studied by adjusting the compositions of SF6, Cl2, and O2 gas mixtures. We have studied the effects of etching gas compositions on the texturing and reflection of the surface. First, we varied the flow rate ratios of Cl2/O2 at the SF6 flow rate of 6sccm, the RF power of 100W, a chamber pressure of 17.5pa and an etching time of 10min Second, we varied the flow rate ratios of SF6/O2 at the Cl2 flow rate of 10sccm, the RF power of 100W, a chamber pressure of 17.5pa and an etching time of 10min Finally, we varied the gas compositions of Cl2:O2:SF6 at an RF power of 100W, a chamber pressure of 17.5pa and an etching time of 10min After the RIE texturing process, the substrate was immersed in 5wt% KOH for 1–3min to etch away the damage layer. Phosphorous diffusion using POCl3 was performed at 830–850°C for 15–25min to form the n-type emitter with sheet resistance from 70 to 100Ω. Emitter resistance also played a key role in order to optimize and achieve high efficiency gain in this textured surface. The phosphorus silicate glass (PSG) was removed by a diluted solution (5wt% HF+25wt% HNO3+20wt% H2SO4). Silicon nitride (SiNx) thin film of thickness 80±3nm and the refractive index of 2.2±0.05 was deposited by plasma enhanced chemical vapor deposition using SiH4 and NH3 reactants as anti-reflection coating layer. Finally, the front and back metal contacts were formed by screen printing and co-firing in an in-line furnace system at 910–940°C. The solar cell fabrication process is outlined in Fig. 1. Reflectance and surface textures were performed using ultraviolet-visible spectroscopy and scanning electron microscopy (SEM), respectively. For studying the optical properties, reflection measurements with anti-reflection coating were conducted by JASCO V-660 UV/VIS Spectrophotometer, which use halogen lamp and photomultiplier tube as light source and detector, respectively. The scanning electron microscopy (SEM) instruments (JEOL JSM-6700F and Hitachi SU8000) were operated at an accelerating voltage of 15kV with an emission current of 10μA. The cell efficiency was measured by a solar simulator under the illumination of AM1.5. All of these measurements were performed at 25°C. 3 Results and discussion The surface textures were found to be dependent on many process conditions including the pre-etching solutions to form microstructures, the compositions of gas mixture, RF power, the gas pressure and the etching time in RIE process to form nanostructures. For comparison, the optical images of mc-Si wafers with pre-etched and pre-etched+RIE texturing are both prepared. Fig. 2(a) shows the substrate etched using acidic solution at room temperature for an etching depth of 5µm (traditional cell process). Fig. 2(b) shows the substrate etched using alkaline solution at 70°C for an etching depth of 5µm with no RIE texturing, and Fig. 2(c) shows the alkaline pre-etched substrate in Fig. 2(b) followed by the etching of plasma using the flow rates of 8.5, 2 and 12.5sccm for the SF6, Cl2 and O2 reactants, respectively, at an RF power of 100W and an etching time of 10min Fig. 2(b) shows that the alkaline etching process is anisotropic resulting in various orientations of grains. Then, as shown in Fig. 2(c), we have minimized the appearance of oriented grains and achieved nearly black surface by forming nanostructures using the maskless RIE subsequent to alkaline etching (alkaline+RIE). Mc-Si wafers with black surfaces can be easily produced under the proper RIE conditions. The surface texture could be varied by controlling several process parameters including the composition of gas mixture, RF power, gas pressure and etching time of RIE system. Since the etching of silicon is more rapid than that of silicon oxide in the Cl2 and SF6 gas plasma, the effect of flow ratio Cl2/O2 and SF6/O2 on the etching of multi-crystalline silicon surface were studied. The O2 gas was added in SF6 or Cl2 gas to partially oxidize silicon for creating a self-masking effect. For comparison, the SEM images of multi-crystalline Si wafers with RIE texturing under the various flow ratios of Cl2 to O2 were prepared. As shown in Fig. 3, the substrates were etched under various FCl2/FO2 ratios with the RF power of 100W and an etching time of 10min Fig. 3(a)–(d) shows that FCl2/FO2 ratio increased from 0.5 to 3, the nanostructure gradually turned small and the average heights changed from 200nm to 20nm. When Cl2 concentration was high, the high concentration of chlorine radicals in the gas phase induced fast etching of Si and SiO2. Therefore, the nanostructures became smaller. The solar cell efficiency and average reflectance of the multi-crystalline silicon wafers under various RIE conditions are shown in Table 1. When the FCl2/FO2 ratio was decreased, the etching depth became deeper and the larger nanostructures were formed. Therefore, the average surface reflectance for the wavelength range of 300–900nm was reduced from 12% to 5.5%. A higher efficiency gain of 0.3% was achieved under a FCl2/FO2 ratio of 0.5. The SEM images of multi-crystalline Si wafers with RIE texturing under the different flow ratios of SF6 to O2 were taken. The effect of FSF6/FO2 ratio during etching on the substrate is shown in Fig. 4 with the RF power of 100W and an etching time of 10min As shown in Fig. 4(a)–4(d), when the FSF6/FO2 ratio was increased from 0.5 to 3, the height and width of nanostructure on the surface increased and reached the largest at the FSF6/FO2 ratio of 2 in the Fig. 4(c). At the higher flow ratio of SF6 to O2, the surface oxidization was not enough inducing nano-pyramids of poor form. When the FSF6/FO2 ratio was lower, the surface was oxidized to a higher ratio. Therefore, the shape of nanostructures became smaller and the uniformity became better. The nanostructures of the silicon wafers were formed by competition between F+ and SFx+ (x<6) ions etching and SixOyFz mask effect [21]. This competition between mask effect and etching effect could be controlled by varying the texturing conditions from FSF6/FO2 ratio=0.5 to FSF6/FO2 ratio=3, resulting in different nanostructure. As shown in Table 2, average surface reflectance of the substrates after RIE etching and KOH cleaning was measured by the ultraviolet-visible spectrometer. The average reflectance of the silicon etched under the FSF6/FO2 ratio of 1 was obviously lower than that under the FSF6/FO2 ratio of 3. When the FSF6/FO2 ratio was increased from 0.5 to 2, the largest heights and widths (150nm and 50nm, respectively) nanostructures were formed under the present plasma conditions (100W of RF power and 10min of etching time). The solar cell devices were also fabricated under these conditions to characterize their performances. The optical reflectance and the solar cell efficiencies of the multi-crystalline silicon wafers under various ratios of SF6 to O2 are shown in Table 2. The solar cell with lower surface reflectance after KOH etching may achieve higher solar cell efficiency. On the other hand, the FSF6/FO2 ratio=2 had the lowest reflectance after RIE etching, but the highest solar conversion efficiency was achieved at the FSF6/FO2 ratio=1. The nano-pyramid structures were formed on a multi-crystalline silicon wafer surface to reduce the solar reflection and effectively enhance the solar cell efficiency gain to a value of 0.35%. In order to optimize the RIE conditions for minimizing the surface reflectivity and maximizing the conversion efficiency, several conditions such as the etching gas compositions, the etching times and the RF powers were adjusted. The substrate with the lowest reflectivity might not achieve the best efficiency gain. The shapes of nanostructures after RIE process should be also a factor to affect conversion efficiency. The random surface nanostructure formation in multi-crystalline wafer is an advantage of RIE etching. The shapes of nanostructures on the surface of multi-crystalline wafers could be controlled by chemical etching and physical bombardments using plasma. The surface texturing played an important role to reduce the reflectance for maximizing the absorption of incident light. The adjustment of three gas compositions was attempted to compare the nanostructures formed. The gas composition ratios of Cl2:O2:SF6 during the substrate etching are shown in Fig. 5 at the RF power of 100W and an etching time of 10min As shown in Fig. 5(a)–5(e), the uniformity of nanostructures became better and the top of the nanostructure became flatter when the gas composition ratio of Cl2:O2:SF6 was changed from 5:3:1 to 1:3:5. The effects of dry etching on the nanostructures were dependent on the compositions of Cl2, O2 and SF6 gas mixtures on a multi-crystalline silicon wafer. During the silicon etching, the SiOx formed by reaction with oxygen-containing species plays a masking role on the silicon wafer. As Cl2 gas chemistry is dissociated into the plasma, it also can etch Si and SiOx selectively in physical etching with ion energetic species and chemical etching with active radicals. The higher concentration of Cl2 gas mixture is based on physical etching resulting in the sharp shape of texturing. The fluorine-containing species in the plasma etches Si and SiOx at different rates leading to the formation of various shapes of surface textures due to chemical etching with active radicals. As shown in Fig. 6, the RIE-textured surface with the nanostructure surface had lower reflection in the wavelength of range 300–850nm. Compared to the acidic textured reference cell, the reflectance of the RIE textured solar cells is lower especially at short wavelength. The lower reflectance implies that the absorption of the sunlight will be improved and the short circuit current will be enhanced. Since the surface is almost full of high aspect ratio nanostructures, the RIE-textured surface using the gas mixture of Cl2:O2:SF6=1:3:5 had the lowest reflection in the full wavelength range. Therefore, the reflectance of the surface using gas mixture ratio of Cl2:O2:SF6=1:3:5 was lower than that using the gas mixture ratio of Cl2:O2:SF6=5:3:1 due to the higher densities of deep uniform nanostructures. Fig. 7 presents the measured external quantum efficiency (EQE) of solar cells after the acid texturing and the RIE texturing for gas mixture compositions of Cl2:O2:SF6=5:3:1 and Cl2:O2:SF6=1:3:5. The EQE spectra show improved blue response (in the wavelength range of 350–450nm) of the RIE-textured surface compared to the wet-textured surface, and the gas mixture compositions of Cl2:O2:SF6=1:3:5 has higher blue response than the gas mixture ratio of Cl2:O2:SF6=5:3:1. The blue response improvement would enhance short-circuit current (Jsc). Besides, RIE texturing at the gas mixture compositions of Cl2:O2:SF6=5:3:1 is shown to have slightly worse response in the wavelength range of 450–850nm than the RIE texturing at the gas mixture compositions of Cl2:O2:SF6=1:3:5 and the wet texturing. The variation of nanostructures seemed to induce the difference in efficiency performances. The average electrical performances are listed in Table 3 showing the change of Voc and Jsc depending on the gas composition. The gas composition ratio of Cl2:O2:SF6=5:3:1 and Cl2:O2:SF6=1:3:5 of RIE cells with optimized emitter resistance is 70Ω and 90Ω, respectively. For the gas composition ratio of Cl2:O2:SF6 at about 1:3:5, the Voc and Jsc were the highest. First, optimized nanostructures cause lower reflectance and then Jsc was improved. Second, the open circuit voltage (VOC) of cells with sheet resistance of 90Ω is higher than that with sheet resistance of 70Ω which originating from the decrease in front surface recombination velocity and induced by the lower doping concentration. As shown in Table 3, surface textures could influence the fill factors (FF) depending on the gas compositions during etching. The plasma etching at the Cl2:O2:SF6 ratio of 1:3:5 had a highest FF with the shapes of nanostructures not too sharp due to the higher spontaneous chemical etching and less anisotropic physical ion bombardments by fluorine in the SF6 rich plasma [21]. This kind of shape can be good for emitter doping, anti-reflection surface passivation coating and electrical contacts. The serial resistance of a solar cell dropped and the fill factor and the conversion efficiency increased. However, plasma etching of a gas mixture ratio of Cl2:O2:SF6 about 5:3:1 showed a somewhat different performance. The etching of Cl2 plasma is due to more anisotropic physical ion bombardments and less chemical etching resulting in the vertical anisotropic etching forming the textures with sharp edges or corners [21]. And, with nanostructures fabricated by high Cl2 concentration etching, the solar cells had poor fill factor and conversion efficiency resulted from the high serial resistance of the device. Therefore, the maximum conversion efficiency with specific nanostructures can be obtained for the etching gas ratios of Cl2:O2:SF6 at 1:3:5. In general the measured efficiency of wet texturing in multi-crystalline silicon solar cells is about 17.21%. Optimizing the etching gas compositions (Cl2:O2:SF6=1:3:5) by fixing the process parameters (an RF power of 100W, a chamber pressure of 17.5pa and an etching time of 10min), we had obtained a maximum conversion efficiency of 17.97% for the nanostructured surface with nearly 2% average reflectance. Large-area solar cell devices with a completely-black surface can be fabricated reproducibly and uniformly across the whole wafer surface for a size of 156×156mm2. The solar cell devices using the wet etching method to texture the surface had a dark blue surface, as shown in Fig. 8(a). On the other hand, large-area solar cell devices with completely-black surface can be fabricated uniformly across the whole wafer surface for a size of 156×156mm2, as shown in Fig. 8(b) and (c), for the etching gas ratios of Cl2:O2:SF6 at 5:3:1 and 1:3:5, respectively, at an RF power of 100W and an etching time of 10min The self-masking RIE process was found to be reproducible in fabricating nano-structures for reducing the light reflection to increase the solar cell efficiency up to 17.97%, compared with 17.21% using the conventional wet etching. 4 Conclusions In this study, a self-masking RIE process for fabricating the large-area (156×156mm2) anti-reflective multi-crystalline silicon surface by creating a high density of nanostructures on the surface has been developed. The control of the reflectance in the range of 2%–10% was achieved under different RIE conditions. Large-area multi-crystalline silicon surfaces with low reflectance (<2%) and high uniformity could be reproducibly achieved. RIE conditions were optimized to obtain the best textured surface, exhibiting extremely low reflectance. Based on the external quantum efficiency results, RIE texturing improved the blue response over conventional cells and thus enhanced the short circuit currents. Compared with the wet-textured solar cells, the multi-crystalline Si solar cells with alkaline pre-etching and then RIE texturing have improved in Jsc 1.67mA/cm2 in absolute gains, resulting in a gain of conversion efficiency around 0.76% using the industrial screen printing process. Acknowledgments The authors gratefully acknowledge the financial support from the National Science Council of Taiwan under Grant NSC-102-2221-E-006-240-MY3 and the Ministry of Economic Affairs (Taiwan, ROC) through project 103-EC-17-A-08-S1-216. References [1] P. Campbell M.A. Green Light trapping properties of pyramidally textured surfaces J. Appl. Phys. 62 1987 243 249 [2] J. Zhu C. Hsu Z. Yu S. Fan Y. Cui Nanodome solar cells with efficient light management and selfcleaning Nano Lett. 10 2010 1979–1083 [3] M. Maeda K. Imamura T. Matsumoto H. Kobayashi Fabrication of Si nanoparticles from Si swarf and application to solar cells Appl. Surf. Sci. 312 2014 39 42 [4] E. Garnett P. Yang Semiconductor nanowires for photovoltaic and photoelectron chemical energy conversion Nano Lett. 10 2010 1082 1085 [5] Y. Kanamori K. Hane H. Sai H. Yuqami 100nm period silicon antireflection structures fabricated using a porous alumina membrane mask Appl. Phys. Lett. 78 2001 142 144 [6] Yuang-Tung Cheng Jyh-Jier Ho Song-Yeu Tsai Zong-Zhi Ye William Lee Daw-Shang Hwang Shun-Hsyung Chang Chiu-Cheng Chang Kang L. Wang Efficiency improved by acidic texturization for multi-crystalline silicon solar cells Sol. Energy 85 2011 87 94 [7] H.J. Lim S. Yoon D. Kim Improvement on surface texturing of single crystalline silicon for solar cells by saw-damage etching using an acidic solution Sol. Energy Mater. Sol. Cells 93 2009 1773 1778 [8] M. Steinert J. Acker A. Henssge K. Wetzig Experimental studies on the mechanism of wet chemical etching of silicon in HF∕HNO3 mixtures J. Electrochem. Soc. 152 2005 843 850 [9] P. Path, G. Willeke, E. Bucher, et al., Mechanical wafer engineering for high efficiency solar cells: an investigation of the induced surface damage, in: Proceedings of the 24th IEEE Photovoltaic Specialists Conference, 1994, pp. 1347–1350. [10] D. Majumdar S. Chatterjee M. Dhar S.K. Dutta H. Saha Light trapping in layer-transferred quasi-monocrystalline porous silicon solar cell Sol. Energy Mater. Sol. Cells 77 2003 51 64 [11] L.A. Dobrzanski A. Drygala K. Golombek P. Panek E. Bielanska R. Zieba Properties of ultrafast laser textured silicon for photovoltaics Sol. Energy Mater. Sol. Cells 10 2011 2745 2751 [12] J. Zhao A. Wang 19.8% efficient “honeycomb” textured multicrystalline and 24.4% monocrystalline silicon solar cells Appl. Phys. Lett. 73 1998 1991 1994 [13] S. Liu X. Niu Wei Shan Wei Liu J. Aheng Y. Li H. Duan W. Quan W. Han C.R. Wronski Deren Yang Improvement of conversion efficiency of multicrystalline silicon solar cells by incorporating reactive ion etching textuRing Sol. Energy Mater. Sol. Cells 127 2014 21 26 [14] Z. Yue H. Shen Y. Jiang Antireflective nanostructures fabricated by reactive ion etching method on pyramid-structured silicon surface Appl. Surf. Sci. 271 2013 402 406 [15] S. Zhong B. Liu Y. Xia J. Liu J. Liu Z. Shen Z. Xu C. Li Influence of the texturing structure on the properties of black silicon solar cell Sol. Energy Mater. Sol. Cells 108 2013 200 204 [16] Hsin-Han Lin Wen-Hua Chen Chi-Jen Wang Franklin Chau-Nan Honga Fabrication of antireflective nanostructures for crystalline silicon solar cells by reactive ion etching Thin Solid Films 529 2013 138 142 [17] J. Yoo G. Yu J. Yi Large-area multicrystalline silicon solar cell fabrication using reactive ion etching (RIE) Sol. Energy Mater. Sol. Cells 95 2011 2 6 [18] U. Gangopadhyay S.K. Dhungel P.K. Basu S.K. Dutta H. Saha J. Yi Comparative study of different approaches of multicrystalline silicon texturing for solar cell fabrication Sol. Energy Mater. Sol. Cells 91 2007 285 289 [19] D.S. Ruby S. Zaidi S. Narayanan S. Yamanaka R. Balanga RIE-texturing of industrial multicrystalline silicon solar cells J. Sol. Energy Eng. 127 2005 146 149 [20] W.A. Nositschka C. Beneking O. Voigt H. Kurz Texturisation of multicrystalline silicon wafers for solar cells by reactive ion etching through colloidal masks Sol. Energy Mater. Sol. Cells 6 2003 155 166 [21] Y. Xia B. Liu A novel method to produce black silicon for solar cells Sol. Energy 85 2011 1574 1578", "scopus-id": "84971333671", "coredata": {"eid": "1-s2.0-S0927024816301532", "dc:description": "In this study, the reactive ion etching in combination with alkaline etching was employed to texture the surface of a 156×156mm2 multi-crystalline silicon wafers to reduce their solar reflectivity and improve conversion efficiency. Reactive gases comprising chlorine (Cl2), sulfur hexafluoride (SF6) and oxygen (O2), were activated in the radio-frequency (rf) plasma to fabricate pyramids in an reactive ion etching (RIE) system. The multi-crystalline Si substrates were etched in various compositions of gases to form the nanostructures of various shapes. Besides the nanoscale features, the high density of nanostructures formed on the multi-crystalline Si surface was also required to significantly reduce the reflectivity. A low reflectivity surface was successfully fabricated with the average reflectivity significantly reduced down to <2% for the wavelength range of 300–850nm. The short wavelength spectral response (blue response) improvement is observed in RIE textured solar cells compared to the standard textured cells. The RIE textured surfaces in combination with optimized emitter resistance result in a remarkable enhancement of short circuit current density. Compared with the acidic textured solar cells, the absolute conversion efficiency of the alkaline+RIE textured cells was improved by 0.76% in average.", "openArchiveArticle": "false", "prism:coverDate": "2016-12-31", "openaccessUserLicense": null, "prism:aggregationType": "Journal", "prism:url": "https://api.elsevier.com/content/article/pii/S0927024816301532", "dc:creator": [{"@_fa": "true", "$": "Chen, Wen-Hua"}, {"@_fa": "true", "$": "Hong, Franklin Chau-Nan"}], "link": [{"@_fa": "true", "@rel": "self", "@href": "https://api.elsevier.com/content/article/pii/S0927024816301532"}, {"@_fa": "true", "@rel": "scidir", "@href": "https://www.sciencedirect.com/science/article/pii/S0927024816301532"}], "dc:format": "application/json", "openaccessType": null, "pii": "S0927-0248(16)30153-2", "prism:volume": "157", "prism:publisher": "Published by Elsevier B.V.", "dc:title": "0.76% absolute efficiency increase for screen-printed multicrystalline silicon solar cells with nanostructures by reactive ion etching", "prism:copyright": "© 2016 Published by Elsevier B.V.", "openaccess": "0", "prism:issn": "09270248", "dcterms:subject": [{"@_fa": "true", "$": "Nanostructure"}, {"@_fa": "true", "$": "Anti-reflection"}, {"@_fa": "true", "$": "Reactive ion etching"}, {"@_fa": "true", "$": "Solar cell"}], "openaccessArticle": "false", "prism:publicationName": "Solar Energy Materials and Solar Cells", "openaccessSponsorType": null, "prism:pageRange": "48-54", "prism:endingPage": "54", "pubType": "fla", "prism:coverDisplayDate": "December 2016", "prism:doi": "10.1016/j.solmat.2016.05.046", "prism:startingPage": "48", "dc:identifier": "doi:10.1016/j.solmat.2016.05.046", "openaccessSponsorName": null}, "objects": {"object": [{"@category": "thumbnail", "@height": "143", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024816301532-gr1.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "14423", "@ref": "gr1", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "163", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024816301532-gr2.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "30965", "@ref": "gr2", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "164", "@width": "206", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024816301532-gr3.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "26019", "@ref": "gr3", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "164", "@width": "207", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024816301532-gr4.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "30350", "@ref": "gr4", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "121", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024816301532-gr5.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "22918", "@ref": "gr5", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "164", "@width": "217", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024816301532-gr6.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "13821", "@ref": "gr6", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "162", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024816301532-gr7.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "13413", "@ref": "gr7", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "164", "@width": "184", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024816301532-gr8.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "24932", "@ref": "gr8", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "253", "@width": "386", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024816301532-gr1.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "51333", "@ref": "gr1", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "505", "@width": "678", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024816301532-gr2.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "104000", "@ref": "gr2", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "539", "@width": "678", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024816301532-gr3.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "167532", "@ref": "gr3", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "538", "@width": "678", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024816301532-gr4.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "180998", "@ref": "gr4", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "446", "@width": "809", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024816301532-gr5.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "137739", "@ref": "gr5", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "291", "@width": "386", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024816301532-gr6.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "45948", "@ref": "gr6", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "286", "@width": "386", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024816301532-gr7.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "40611", "@ref": "gr7", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "603", "@width": "678", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024816301532-gr8.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "147794", "@ref": "gr8", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "1118", "@width": "1708", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024816301532-gr1_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "227892", "@ref": "gr1", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "2236", "@width": "3000", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024816301532-gr2_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "862884", "@ref": "gr2", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "2383", "@width": "3000", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024816301532-gr3_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "2117739", "@ref": "gr3", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "2380", "@width": "3000", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024816301532-gr4_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "1876607", "@ref": "gr4", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "1976", "@width": "3583", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024816301532-gr5_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "1452169", "@ref": "gr5", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "1288", "@width": "1708", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024816301532-gr6_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "242995", "@ref": "gr6", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "1267", "@width": "1708", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024816301532-gr7_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "230424", "@ref": "gr7", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "2666", "@width": "3000", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024816301532-gr8_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "1579842", "@ref": "gr8", "@mimetype": "image/jpeg"}]}, "link": {"@rel": "abstract", "@href": "https://api.elsevier.com/content/abstract/scopus_id/84971333671"}}