{"scopus-eid": "2-s2.0-85047260206", "originalText": "serial JL 271495 291210 291731 291732 291746 291809 291864 291865 291892 291893 31 Solar Energy Materials and Solar Cells SOLARENERGYMATERIALSSOLARCELLS 2018-05-29 2018-05-29 2018-05-29 2018-05-29 2019-12-27T10:56:40 1-s2.0-S0927024818302186 S0927-0248(18)30218-6 S0927024818302186 10.1016/j.solmat.2018.05.006 S300 S300.4 FULL-TEXT 1-s2.0-S0927024818X00105 2019-12-27T11:09:19.439057Z 0 0 20181001 20181031 2018 2018-05-29T13:25:41.994247Z articleinfo articletitlenorm authfirstinitialnorm authfirstsurnamenorm cid cids contenttype copyright crossmark dateloaded dateloadedtxt datesearch datesort dateupdated dco docsubtype doctype doi eid ewtransactionid hubeid indexeddate issn issnnorm itemstage itemtransactionid itemweight openaccess openarchive pg pgfirst pglast pii piinorm pubdateend pubdatestart pubdatetxt pubyr sectiontitle sortorder srctitle srctitlenorm srctype ssids alllist content subj subheadings suppl tomb volfirst volissue volumelist webpdf webpdfpagecount yearnav figure table e-component body acknowledge affil appendices articletitle auth authfirstini authfull authkeywords authlast grantnumber grantsponsor grantsponsorid highlightsabst primabst ref 0927-0248 09270248 true 185 185 C Volume 185 65 198 204 198 204 201810 October 2018 2018-10-01 2018-10-31 2018 VSI: SiliconPV 2018 article fla © 2018 Published by Elsevier B.V. TOWARDSEFFICIENCYLIMITSMULTICRYSTALLINESILICONSOLARCELLS SCHINDLER F 1 Introduction 2 Material fabrication 3 Solar cell and lifetime sample processing 4 Solar cell results 5 Loss analysis 5.1 J sc 5.2 V oc 5.3 FF 5.4 Macroscopic inhomogeneity of the bulk lifetime 5.4.1 Perimeter losses 5.4.2 Explicit grain boundary modelling 5.4.3 Free energy loss analysis for record mc-Si solar cell 6 Summary and outlook Acknowledgements Appendix A Supplementary material References FELDMANN 2014 270 274 F SCHINDLER 2017 180 186 F BENICK 2017 1171 1175 J GIESECKE 2011 1011 1018 J SCHINDLER 2016 F SCHINDLER 2015 1571 1579 F BENTZEN 2006 3193 3198 A FELL 2017 128 133 A HAUG 2016 69 74 H ALTERMATT 1996 355 367 P FELL 2014 1040 1045 A RICHTER 2017 A EDMISTON 1996 6783 6795 S ALTERMATT 2002 4271 4274 P NEEDLEMAN 2016 817 822 D BRENDEL 2008 173503 R SCHINDLERX2018X198 SCHINDLERX2018X198X204 SCHINDLERX2018X198XF SCHINDLERX2018X198X204XF 2020-05-29T00:00:00.000Z 2020-05-29T00:00:00.000Z http://creativecommons.org/licenses/by-nc-nd/4.0/ © 2018 Published by Elsevier B.V. 2019-03-10T07:21:29.128Z http://vtw.elsevier.com/data/voc/AddOnTypes/50.7/nlp S0927024818302186 German Federal Ministry for Economic Affairs and Energy 0324034 Bureau of Energy, Ministry of Economic Affairs, Republic of Taiwan http://data.elsevier.com/vocabulary/SciValFunders/501100002768 http://sws.geonames.org/1668284/ The authors would like to thank P. Häuber, F. Haas, F. Schätzle, A. Leimenstoll, S. Seitz, N. Brändlin, B. Steinhauser, K. Zimmermann, A. Seiler, E. Schäffer, and F. Martin for their support with processing and measurements. Also, the authors would like to thank Wacker Polysilicon for silicon materials and fruitful discussions. This work was financially supported by the German Federal Ministry for Economic Affairs and Energy within the research project “multiTOP” under grant number 0324034 . Appendix A item S0927-0248(18)30218-6 S0927024818302186 1-s2.0-S0927024818302186 10.1016/j.solmat.2018.05.006 271495 2019-12-27T11:09:19.439057Z 2018-10-01 2018-10-31 1-s2.0-S0927024818302186-main.pdf https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818302186/MAIN/application/pdf/e8ff8c202f116b0fc627004d06dbdcc3/main.pdf main.pdf pdf true 1687135 MAIN 7 1-s2.0-S0927024818302186-main_1.png https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818302186/PREVIEW/image/png/e27b4b29fa0e4bcc3b1854b81dde0a1d/main_1.png main_1.png png 53938 849 656 IMAGE-WEB-PDF 1 1-s2.0-S0927024818302186-gr1.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818302186/gr1/THUMBNAIL/image/gif/54690f839e22086fe3b7a747f4bafa6d/gr1.sml gr1 gr1.sml sml 11353 136 219 IMAGE-THUMBNAIL 1-s2.0-S0927024818302186-gr2.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818302186/gr2/THUMBNAIL/image/gif/862b56c84feb71d83982a3f7f6b00b96/gr2.sml gr2 gr2.sml sml 10100 160 219 IMAGE-THUMBNAIL 1-s2.0-S0927024818302186-gr3.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818302186/gr3/THUMBNAIL/image/gif/04dc2aaf8737732374b1d98defe400f8/gr3.sml gr3 gr3.sml sml 9163 164 187 IMAGE-THUMBNAIL 1-s2.0-S0927024818302186-gr4.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818302186/gr4/THUMBNAIL/image/gif/f3f2d28f5f888066041fa0adc0266ca6/gr4.sml gr4 gr4.sml sml 25910 164 192 IMAGE-THUMBNAIL 1-s2.0-S0927024818302186-gr5.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818302186/gr5/THUMBNAIL/image/gif/2a2f04017caeaf504537de224c9e528b/gr5.sml gr5 gr5.sml sml 5316 164 216 IMAGE-THUMBNAIL 1-s2.0-S0927024818302186-gr6.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818302186/gr6/THUMBNAIL/image/gif/adddb6668ad0b7b2b5880b909698ea8b/gr6.sml gr6 gr6.sml sml 11669 80 219 IMAGE-THUMBNAIL 1-s2.0-S0927024818302186-gr7.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818302186/gr7/THUMBNAIL/image/gif/3d520b0776e05ab446e76e38155c54dc/gr7.sml gr7 gr7.sml sml 6132 88 219 IMAGE-THUMBNAIL 1-s2.0-S0927024818302186-gr8.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818302186/gr8/THUMBNAIL/image/gif/eabeb11b551ad7f528ff0980e8a71767/gr8.sml gr8 gr8.sml sml 3974 86 219 IMAGE-THUMBNAIL 1-s2.0-S0927024818302186-gr9.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818302186/gr9/THUMBNAIL/image/gif/e864805f8415f067934652fb5e0ce116/gr9.sml gr9 gr9.sml sml 7590 114 219 IMAGE-THUMBNAIL 1-s2.0-S0927024818302186-gr1.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818302186/gr1/DOWNSAMPLED/image/jpeg/d36b45e65010bc95ffe39765e017fea0/gr1.jpg gr1 gr1.jpg jpg 23110 176 284 IMAGE-DOWNSAMPLED 1-s2.0-S0927024818302186-gr2.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818302186/gr2/DOWNSAMPLED/image/jpeg/b4a7c364f481b9d7a96072f7f88b1a39/gr2.jpg gr2 gr2.jpg jpg 98891 495 678 IMAGE-DOWNSAMPLED 1-s2.0-S0927024818302186-gr3.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818302186/gr3/DOWNSAMPLED/image/jpeg/cd3cf95d31a13e1755fb5cf4cbc59a97/gr3.jpg gr3 gr3.jpg jpg 65265 494 565 IMAGE-DOWNSAMPLED 1-s2.0-S0927024818302186-gr4.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818302186/gr4/DOWNSAMPLED/image/jpeg/64c4d3d218c69b4042a5d83d9de83ef3/gr4.jpg gr4 gr4.jpg jpg 160022 481 565 IMAGE-DOWNSAMPLED 1-s2.0-S0927024818302186-gr5.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818302186/gr5/DOWNSAMPLED/image/jpeg/0b6b19fd9d40b6f088f83dea7086d031/gr5.jpg gr5 gr5.jpg jpg 21366 257 339 IMAGE-DOWNSAMPLED 1-s2.0-S0927024818302186-gr6.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818302186/gr6/DOWNSAMPLED/image/jpeg/02993bb0d743ce7a5be61bc6d0e6fd68/gr6.jpg gr6 gr6.jpg jpg 14462 104 282 IMAGE-DOWNSAMPLED 1-s2.0-S0927024818302186-gr7.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818302186/gr7/DOWNSAMPLED/image/jpeg/e08db090e1323cb3144bab35fb5f3823/gr7.jpg gr7 gr7.jpg jpg 10998 114 282 IMAGE-DOWNSAMPLED 1-s2.0-S0927024818302186-gr8.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818302186/gr8/DOWNSAMPLED/image/jpeg/61b73cd81baa93498be1dcecfe20f00b/gr8.jpg gr8 gr8.jpg jpg 47331 266 678 IMAGE-DOWNSAMPLED 1-s2.0-S0927024818302186-gr9.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818302186/gr9/DOWNSAMPLED/image/jpeg/107a57aa237d2c1a13050cdc5c1cade5/gr9.jpg gr9 gr9.jpg jpg 45522 259 496 IMAGE-DOWNSAMPLED 1-s2.0-S0927024818302186-gr1_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818302186/gr1/HIGHRES/image/jpeg/1dd4c548112b0fa66a5e1fd3a6f101a3/gr1_lrg.jpg gr1 gr1_lrg.jpg jpg 194299 782 1261 IMAGE-HIGH-RES 1-s2.0-S0927024818302186-gr2_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818302186/gr2/HIGHRES/image/jpeg/964380b372631ee52dff10f84c817a93/gr2_lrg.jpg gr2 gr2_lrg.jpg jpg 714471 2191 3001 IMAGE-HIGH-RES 1-s2.0-S0927024818302186-gr3_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818302186/gr3/HIGHRES/image/jpeg/0f94ab2771db19afcf6708a470528f40/gr3_lrg.jpg gr3 gr3_lrg.jpg jpg 461920 2187 2500 IMAGE-HIGH-RES 1-s2.0-S0927024818302186-gr4_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818302186/gr4/HIGHRES/image/jpeg/7cd7de430191c68ccff83b4afb8585c2/gr4_lrg.jpg gr4 gr4_lrg.jpg jpg 1256300 2130 2500 IMAGE-HIGH-RES 1-s2.0-S0927024818302186-gr5_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818302186/gr5/HIGHRES/image/jpeg/536e057ffee68491e2be0e11f73034ec/gr5_lrg.jpg gr5 gr5_lrg.jpg jpg 136351 1140 1502 IMAGE-HIGH-RES 1-s2.0-S0927024818302186-gr6_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818302186/gr6/HIGHRES/image/jpeg/9ce5302e131f161f1106b71d9f11734c/gr6_lrg.jpg gr6 gr6_lrg.jpg jpg 122872 459 1250 IMAGE-HIGH-RES 1-s2.0-S0927024818302186-gr7_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818302186/gr7/HIGHRES/image/jpeg/cc97269c6fa9f4cab38eae8b588c644b/gr7_lrg.jpg gr7 gr7_lrg.jpg jpg 77827 505 1250 IMAGE-HIGH-RES 1-s2.0-S0927024818302186-gr8_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818302186/gr8/HIGHRES/image/jpeg/753aed84667cbfdb7aa3137d0af3b1f4/gr8_lrg.jpg gr8 gr8_lrg.jpg jpg 347736 1177 3000 IMAGE-HIGH-RES 1-s2.0-S0927024818302186-gr9_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818302186/gr9/HIGHRES/image/jpeg/23efde5920d217b7cd6394d4c528b649/gr9_lrg.jpg gr9 gr9_lrg.jpg jpg 395954 1147 2196 IMAGE-HIGH-RES 1-s2.0-S0927024818302186-mmc1.docx https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818302186/mmc1/MAIN/application/vnd.openxmlformats-officedocument.wordprocessingml.document/10e0cf0be0a5608d23627a69b013357c/mmc1.docx mmc1 mmc1.docx docx 14886 APPLICATION SOLMAT 9419 S0927-0248(18)30218-6 10.1016/j.solmat.2018.05.006 Fig. 1 Schematic of n-type high-performance (HP) multicrystalline (mc) silicon solar cells with black-silicon (B-Si) texture. Fig. 1 Fig. 2 Overview of the global solar cell parameters from in-house IV measurements under standard testing conditions. The insets in the efficiency graph show PL images of the record mc-Si solar cells of batch 1 and 2. Fig. 2 Fig. 3 Correlation of a) Jsc and b) Voc with the area fraction of recombination-active structural crystal defects (RASCD) for batch 1. The image in a) illustrates the assessment of the area fraction of RASCD for the 21.9% cell of batch 1, exemplarily. Fig. 3 Fig. 4 Lifetime images of bulk and emitter lifetime sample at low (illumination intensity corresponding to ~ 1/30 suns) and higher injection level (~ 1 sun). Please note the different scaling. The symbols indicate the grains which are further analyzed and plotted in Fig. 5. Fig. 4 Fig. 5 Injection-dependent lifetime of different grains, indicated by the symbols in Fig. 4. While the bulk lifetimes in the different grains are virtually identical, the effective lifetime for the emitter lifetime sample features large lateral variations. Fig. 5 Fig. 6 Quokka3 simulation domain (quarter of the cell) for 3D simulations; a PL image is overlaid to illustrate that the measured spatially resolved and injection-dependent lifetimes are used as inputs for the simulation. Fig. 6 Fig. 7 Quokka3 2D solution domain for the detailed grain boundary simulations. Fig. 7 Fig. 8 a) FF vs Voc comparing the typical “homogeneous” with the explicit grain boundary (GB) simulation, the latter assuming a constant inner-grain lifetime of 2 ms and varying Seff of the grain-boundary; b) comparing measured effective lifetime curve of a whole wafer without emitter diffusion with equivalent simulations using Seff = 20,000 cm/s, roughly agreeing for a grain size of 5 mm. Fig. 8 Fig. 9 FELA of the record mc-Si solar cell. The main electrical losses are grain boundary recombination and emitter recombination. Fig. 9 Table 1 Cell parameters at STC for the record mc-Si solar cell (2 ×2 cm2). Calibrated measurements by F-ISE CalLab. Table 1 V oc (mV) 674.2 J sc (mA/cm2) 41.1 FF (%) 80.5 η (%) 22.3 Towards the efficiency limits of multicrystalline silicon solar cells Florian Schindler a ⁎ Andreas Fell a Muller Ralph Müller a Jan Benick a Armin Richter a Frank Feldmann a Patricia Krenckel a Stephan Riepe a Martin C. Schubert a Stefan W. Glunz a b a Fraunhofer Institute for Solar Energy Systems (ISE), Heidenhofstr. 2, 79110 Freiburg, Germany Fraunhofer Institute for Solar Energy Systems (ISE) Heidenhofstr. 2 Freiburg 79110 Germany b University Freiburg, Laboratory for Photovoltaic Energy Conversion, Freiburg, Germany University Freiburg, Laboratory for Photovoltaic Energy Conversion Freiburg Germany ⁎ Corresponding author. In this contribution, we present our recent results for high efficiency multicrystalline silicon solar cells. Based on n-type high-performance multicrystalline silicon substrates in combination with the TOPCon solar cell concept featuring a full area passivating back contact and a boron-diffused emitter as well as a plasma-etched black-silicon texture at the front side, a certified conversion efficiency of 22.3% has been achieved, which is currently the world record efficiency for multicrystalline silicon solar cells. A detailed loss analysis of the record solar cell batch discloses the nature of the remaining loss mechanisms, revealing the route for further improvements. We observe an efficiency gap between the multicrystalline and the FZ reference solar cells of ~1%abs. Compared to the FZ reference cells, the mc-Si cells also feature a significantly larger scattering in Voc and Jsc as well as a fill factor loss of ~1.5%abs. We show that the scattering in Jsc correlates with the area fraction of recombination-active structural crystal defects and the scattering in Voc additionally with lateral emitter-induced inhomogeneities. The fill factor loss is attributed to the general presence of strongly recombination-active grain boundaries. A detailed loss analysis of the record mc-Si solar cell shows that the major electrical losses are due to recombination at grain boundaries (0.7%abs) and recombination in the emitter (0.6%abs). By reducing these electrical loss channels, e.g. by an improved crystallization process together with a hydrogenation of the bulk and application of an adapted emitter, we expect to reach efficiencies for mc-Si solar cells in the range of 23%. Keywords Multicrystalline silicon N-type Free energy loss analysis TOPCon Record efficiency 1 Introduction In the past years, research on n-type multicrystalline silicon revealed its large solar cell efficiency potential. The availability of an excellent and robust n-type solar cell process featuring a tunnel-oxide passivating back contact (TOPCon) [1] and the continuously improved material quality of the n-type high-performance multicrystalline silicon (HP mc-Si) are the two key features for highest mc-Si efficiencies. The optimization of the n-type HP mc-Si material with regard to the TOPCon cell concept by improvements of the crystal structure and optimization of the base resistivity together with an improved light trapping by application of a black-silicon plasma process for front side texturing enabled the fabrication of an n-type HP mc-Si solar cell with 21.9% efficiency [2,3]. Recently, this value was exceeded by an HP mc-Si TOPCon solar cell with a certified conversion efficiency of 22.3%, which is the current world record for multicrystalline silicon solar cells. The already high level and the steady and fast improvement of these efficiencies reflect the large potential of HP mc-Si TOPCon solar cells. But this record efficiency is still ~1%abs below the efficiency of reference cells on FZ material. Therefore, we perform a thorough loss analysis of the recent solar cell batches in order to explore the remaining limitations and identify options to overcome these. This enables us to further adapt both the crystallization process as well as the solar cell processing to push multicrystalline silicon to its limits, which are by far not reached yet. 2 Material fabrication The n-type HP mc-Si used in this work has been developed at Fraunhofer ISE. The G2 size research ingots (equivalent to 75 kg of pure polysilicon feedstock) were crystallized by the directional solidification method with seeded growth. High-purity silicon granules from a Fluidized Bed Reactor (FBR) process were used as seed material and were placed in the bottom of a high-purity fused-silica crucible. As dopant material silicon wafers enriched with phosphorus (1085 ppmw) were used. The crystallization resulted in a resistivity profile from 1.5 Ω cm above the remaining seed material to 0.5 Ω cm at the ingot top. A brick with 156 mm side length was cut from the ingot center. After cropping of 15 mm at bottom and top, the brick was processed into wafers with a thickness of 195 µm by multiwire sawing with SiC slurry and structured wire. 3 Solar cell and lifetime sample processing HP mc-Si solar cell processing included the fabrication of multicrystalline solar cells as well as monocrystalline FZ reference cells. The fabricated mc-Si solar cells are sketched by the cross-section shown in Fig. 1. The details of the standard cell fabrication process applied in the first solar cell batch, which includes a BBr3 diffusion (~90 Ω/sq) and a high-temperature TOPCon anneal, can be found in [3]. In the second cell processing batch, we included one group with the standard fabrication process and additionally investigated the improvement potential of a P-gettering step and an optimization of the emitter diffusion temperature (875 °C, ~140 Ω/sq) with and without a “drive-in” oxidation in 5 other groups. In order to investigate the impact of the boron emitter on solar cell performance in more detail, in a further experiment HP mc-Si wafers were processed to planar solar cell precursors (featuring a TOPCon layer on the rear side and a boron emitter passivated by a stack of Al2O3 and SiNx on the front side, in the following referred to as “emitter lifetime samples”). These emitter lifetime samples were investigated by injection-dependent photoluminescence (PL) lifetime imaging [4]. After characterization, the passivating layers and the emitter were etched back and the silicon bulk was surface passivated by SiNx on both sides in order to obtain bulk lifetime samples, which were also characterized by injection-dependent PL lifetime imaging. 4 Solar cell results Fig. 2 shows solar cell parameters of all HP mc-Si solar cells of the first [2,3] and the second cell batch in comparison to the corresponding FZ reference cells. The insets in the efficiency graph show PL images of the record mc-Si solar cells of each batch. In the second batch, both the maximum efficiencies as well as their scattering are significantly improved for the mc-Si solar cells. The increase in efficiency is mainly attributed to an increase in J sc, while the narrower efficiency distribution is based on less scattering in the fill factor. Note that in Fig. 2, we do not distinguish between the different groups of batch 2, because no clear dependence of the specific high-temperature process sequences on the efficiency was observed. The P-gettering step did not show a significant performance improvement, probably because the bulk quality is already high after the boron diffusion and the grain boundary recombination is not significantly reduced by the P-diffusion (see also Section 5.4). The optimized emitter diffusion temperature led to a slight increase in J sc, which was compensated by a slight reduction in the fill factor. It is noteworthy that nearly all mc-Si solar cells of the second batch feature efficiencies above 21%, 11 of which even above 22%. Still, we observe a gap between the best mc-Si solar cells and the best reference cells of 1%abs, which is equally related to losses in J sc, FF and V oc. Additionally, the mc-Si cells feature a larger efficiency scattering compared to the FZ reference cells. Both, the origins of the lower absolute values as well as the larger scattering will be addressed in detail in the next section. The cell parameters of the record mc-Si solar cell which were confirmed by Fraunhofer ISE CalLab are reported in Table 1. 5 Loss analysis In this section, the mc-Si specific losses are analyzed in detail, separated by cell parameters, before a free energy loss analysis of the record mc-Si solar cell is performed. The combination of the statistical analysis of the solar cell batches and the detailed analysis for the record cell leads to a coherent understanding of the remaining losses in multicrystalline silicon TOPCon solar cells and delivers guidelines for further improvements. 5.1 J sc The most prominent difference between mono- and multicrystalline silicon is the presence of structural crystal defects such as grain boundaries in multicrystalline material. Especially in high-performance mc-Si, recombination-active grain boundaries have been identified to account for the majority of material-related losses [2,5]. In order to quantify the area fraction of such defects, we evaluated PL images of the mc-Si solar cells and assigned pixels with an intensity below a certain threshold value to recombination-active structural crystal defects (RASCD). Thus, grain areas can be distinguished from areas affected by recombination-active grain boundaries, sub-grain boundaries or dislocations and correlations of the cell parameters with the structural crystal quality can be identified. Please note that RASCD are mainly line-shaped structures (in top view) and the measurement of the affected cell-area fraction depends on the lateral diffusion of charge carriers, the imaging resolution, and the threshold value. Nevertheless, this method turned out to be quite robust for the setup used in this work (1 sun illumination, 65 pixel/cm). The procedure is illustrated for the record cell of batch 1 in Fig. 3a, where the red areas in the PL-image are accounted for as RASCD, which relates to an area fraction of ~ 9% in this case. Fig. 3a shows a linear decrease in J sc with increasing area fraction of RASCD. Please note that this graph shows the results for cell batch 1. Similar results are obtained for batch 2, notably the record cell of batch 2 with ~ 6% area fraction of RASCD (cf. insets in Fig. 2) that correlates to the J SC of 41.1 mA/cm2. Thus, the losses in J sc of the mc-Si solar cells compared to the FZ reference cells are fully related to recombination-active structural crystal defects. 5.2 V oc In general, also V oc decreases with increasing area fraction of RASCD. However, here the trend is less pronounced than in the case of J sc (cf. Fig. 3b). In order to understand this additional scattering, we investigated emitter and bulk lifetime samples. Fig. 4 shows lifetime images of the same sample with and without emitter at high and low level injection (illumination intensity ~ 1 sun and 1/30 sun). While the bulk lifetime sample features relatively homogeneous inner grain lifetimes (cf. upper row in Fig. 4), strong lateral variations in the inner grain lifetimes are observed for the emitter lifetime sample (cf. lower row in Fig. 4). Thus, the additional scattering cannot be explained by pure bulk recombination, but by lateral inhomogeneities specifically occurring on the emitter lifetime sample. It should be noted that the emitter lifetime sample featured a TOPCon rear side passivation. A grain-orientation dependent passivation quality of the TOPCon layer could be excluded by spatially-resolved and injection-dependent lifetime measurements on bulk lifetime samples passivated with TOPCon layers on both sides. This has also been shown in [6]. Thus, we attribute the lateral inhomogeneities on the emitter lifetime samples to the presence of a boron emitter on the n-type mc-Si base. Two effects need to be separated here: At low injection levels, the charge carrier densities and lifetimes are dominated by lateral transport effects. Highest lifetimes and Δn are obtained in areas far away from strong recombination centers, e.g. in the center of large grains. Smaller grains are already significantly affected by carrier diffusion to neighboring RASCD and, thus, feature lower Δn as well as lower effective lifetimes (cf. Fig. 4 lower left). At higher injection levels, however, a second effect not related to lateral charge carrier transport seems to set in. At an illumination intensity of ~ 1 sun, significant differences in inner grain lifetimes are observed for the emitter lifetime sample (cf. Fig. 4 lower right). A closer look at the injection-dependent lifetime in several grains of the emitter and the bulk lifetime sample delivers further insights into this additional inhomogeneity induced by the presence of an emitter on the n-type HP mc-Si bulk (cf. Fig. 5). While the different grains feature a virtually identical bulk lifetime on a high level (open symbols in Fig. 5), the lifetime of the emitter samples features strong lateral variations from grain to grain. While the decreasing lifetime towards low injection levels for the emitter samples is due to the lateral carrier transport to RASCD mentioned above (see also Section 5.3), the curves also reveal a variation in maximum lifetime at higher injection levels. We attribute the RASCD-independent additional scattering in V oc to this inhomogeneity, which indicates a lateral variation in J 01,e. For comparison, the impact of a J 01,e of 30 fA/cm2 (typical value for the reference solar cells) and 70 fA/cm2 (used in the simulations for the record mc-Si cell in Section 5.3) on the inner grain bulk lifetime is also shown in Fig. 5. This illustrates that even the best grains (grain 3 in Fig. 5) cannot be described by a J 01,e of 30 fA/cm2, whereas a value of 70 fA/cm2 seems to be an approximate average for the mc-Si material. The origin of the lateral variation of the effective lifetime in the emitter samples is not yet understood and currently under investigation. Possible reasons could be a variation in the emitter profile due to different diffusion coefficients of B depending on either the crystal orientation of the grains or a different defect density within the grains. It has been shown by Bentzen et. al [7] that phosphorus diffusion can be significantly enhanced along in-grain crystallographic defects, which might also be the case for boron diffusions and directly lead to a different J 01,e. If not directly, different emitter profiles could indirectly affect the effective lifetime by an interaction with impurities in the material that are only weakly recombination-active in the n-type bulk, but significantly contribute to recombination in the p-type emitter. However, these hypotheses have to be investigated by further experiments on grain-dependent profiles and measurements of inner grain defect densities. 5.3 FF Finally, we observe a significantly lower FF of the mc cells compared to the FZ references of around 1.5%abs, even for the record solar cell. The loss is substantially beyond what is expected due to the slightly lower V oc, and is not related to metal grid losses as confirmed by pFF measurements. Notably, the loss cannot be replicated in our ELBA simulations which consider the macroscopic spatial inhomogeneity and injection-dependence of the bulk lifetime as measured by injection-dependent lifetime imaging. In the following we test different hypothesis causing this FF loss. 5.4 Macroscopic inhomogeneity of the bulk lifetime It can be doubted that distributed transport effects are fully accounted for within our previous ELBA simulations due to the approximation of independent simulations per pixel being averaged. We therefore use Quokka3 [8] to simulate a quarter of the cell in 3D including the spatial- and injection-dependent lifetime images, not imposing such simplifications, see Fig. 6. However, with these full 3D simulations we neither found a significant difference in global IV characteristics to the ELBA simulations, nor to assuming an average spatially homogenous (but still injection-dependent) lifetime curve within the same Quokka3 model. This means that the macroscopic distributed nature of the bulk lifetime does not produce any noticeable nonlinear losses beyond what is included in the spatially averaged lifetime, which is consistent with previous similar investigations [9], and thus cannot explain the observed FF loss. 5.4.1 Perimeter losses It is well known that perimeter losses can be significant for such small-size in-wafer high efficiency cells, manifesting mainly as a FF loss [10–12]. We use Quokka3 to simulate the full-cell geometry with and without the perimeter and are thereby able to quantify the perimeter losses. The losses are very low (see Section 5.4), and not different between FZ and mc material, and are therefore ruled out to cause the observed FF loss. 5.4.2 Explicit grain boundary modelling Typically, as also in our previous works, the inhomogeneity of recombination in mc-Si is considered via imaging the macroscopic lifetime variations. Imaging unavoidably reduces the “sharpness” of the grain boundary recombination at least by integrating over the camera's pixel size, and additionally by electrical and optical smearing effects which cannot be entirely avoided or corrected. Subsequent simulations using such measurements as inputs consequently represent only an approximation of the real physical effects happening. To test whether an explicit consideration of the grain boundary within the modelling can better replicate the experimental observations, we set up a 2D domain in Quokka3 (cf. Fig. 7) representing a single grain with a good “inner” lifetime of ~2 ms (measured), similar as in [13–15]. Different to those previous publications we do not attempt to model the detailed physics of recombination at the grain boundary. Instead, we approximate it by an effective surface recombination velocity S eff and emphasize the effect on IV parameters and effective lifetime for changing grain size and S eff, which is shown in Fig. 8. The only other unknown within the otherwise well calibrated cell model is the J 01,e, as there is evidence for additional losses compared to the FZ references. It is set to 70 fA/cm2, as this value results in best overall agreement with the various experimental data, see also Section 5.2. In Fig. 8a the simulated FF and V oc are plotted for the typical “homogenous” simulation approach, which uses an (injection-dependent) bulk lifetime derived from averaging the respective bulk lifetime images, as well as for the explicit grain boundary simulations. The homogenous simulation approach cannot replicate the measured FF, whereas the grain boundary simulations can manifest either as a FF or V oc loss, depending on grain size. Simulations with a value of S eff = 20,000 cm/s are able to approximately explain i) the IV-parameters of the record cell with a grain size of 10 mm as estimated from PL images, and ii) the effective lifetime of a well passivated mc-Si wafer (without emitter diffusion) which has an average grain size in the order of millimeters, see Fig. 8b. The missing injection dependence of the simulated lifetime is likely caused by neglecting the injection-dependence of the inner-grain bulk-lifetime or of the grain boundary recombination. It is an interesting finding in turn that the non-ideality manifesting within the simulation as a FF loss is not visible in the corresponding lifetime-curve when no emitter is present, explaining why the FF loss cannot be replicated when using the effective injection-dependent lifetime (images) of wafers without emitter diffusion within the typical simulation approach. As only the explicit modelling of grain boundary recombination is able to consistently explain the FF losses, the cell IV parameters and the spatial variation of lifetime images, we suggest to have identified and quantified an important loss mechanism previously not considered in cell-level analyses of mc-Si cells. The loss manifests in particular for the case of good intra-grain quality, relatively large grain sizes and high overall cell performance, and thus became visible only due to the recent advances in cell performance and accuracy of characterization. For other cases, it manifests mainly as a V oc loss, which will then be correctly included by an analysis based on macroscopic lifetime distribution. We note that what appears and was discussed as a “J 02-loss” (non-ideal recombination) on cell level [16], can be entirely replicated by assuming only ideal recombination properties with a strong lateral variation across the cell. 5.4.3 Free energy loss analysis for record mc-Si solar cell To quantify the influence of the different loss mechanisms, we use the free energy loss analysis (FELA) [17], enhanced by including optical losses via multiplying the respective loss current density with the maximum power voltage. Not all loss mechanisms are captured within a single simulation, as it is practically impossible to setup a full-area 3D simulation resolving grain boundaries as vertically recombinative planes, which we found in the previous section to be necessary to explain the FF losses. We thus use i) a full-cell Quokka3 model of the record cell to determine mainly perimeter losses, metal grid resistance losses and optical losses, see Fig. 6, and ii) the detailed grain boundary simulations calibrated to the record cell to breakdown in particular the recombination losses. In Fig. 9 it can be seen that optics are a major loss channel. They are however not related to the mc-material, and being similar to our record FZ cells approaching conversion efficiencies of 26% [12], are close to what is practically achievable. The material-related losses are dominated by emitter recombination and grain boundary recombination, whereas the inner-grain SRH recombination is not a substantial loss mechanism anymore. This might also explain why an additional P-gettering after the boron emitter diffusion does not lead to a significant performance improvement of the solar cells (see Section 4), if it does not efficiently reduce grain boundary recombination. As described in the previous sections, the loss due to grain boundary recombination is to a substantial part caused by the presence of the emitter. Thus, a more detailed investigation and improvement of the emitter technology and its interplay with grain boundaries is a promising key to further improve mc-Si cell efficiencies. 6 Summary and outlook In this work we presented a detailed loss analysis of our record mc-Si TOPCon solar cells, which explains the observed differences compared with FZ reference cells for the IV parameters. While an increased area fraction of recombination-active structural crystal defects explains the losses in J sc, it only partly explains the losses in V oc, which is additionally affected by lateral inhomogeneities induced by the presence of an emitter on the n-type HP mc-Si bulk. The origin of this effect is under investigation. Finally, we showed that the lower fill factors in the mc-Si material can be completely understood by enhanced grain boundary recombination in combination with very high inner grain lifetimes assuming only ideal recombination properties, which is in contrast to previous speculations about a non-ideal recombination related to the multicrystalline material. Thus, this apparent non-ideality is an effect of extreme differences in recombination activity occurring in one cell, as it is the case for HP mc-Si material with high inner-grain lifetimes and still strongly recombination-active grain boundaries. The loss analysis of the record mc-Si solar cell showed that the major electrical losses are due to recombination at grain boundaries (0.7%abs) and recombination in the emitter (0.6%abs). Current work focuses on the reduction of these loss channels, especially by reducing the area fraction and recombination activity of grain boundaries by improving the crystallization process and including a hydrogenation of the bulk, as well as an optimization of the boron emitter. Thus, we are optimistic to reach mc-Si efficiencies in the range of 23%. Acknowledgements The authors would like to thank P. Häuber, F. Haas, F. Schätzle, A. Leimenstoll, S. Seitz, N. Brändlin, B. Steinhauser, K. Zimmermann, A. Seiler, E. Schäffer, and F. Martin for their support with processing and measurements. Also, the authors would like to thank Wacker Polysilicon for silicon materials and fruitful discussions. This work was financially supported by the German Federal Ministry for Economic Affairs and Energy within the research project “multiTOP” under grant number 0324034. Appendix A Supporting information Supplementary data associated with this article can be found in the online version at doi:10.1016/j.solmat.2018.05.006. Appendix A Supplementary material Supplementary material References [1] F. Feldmann M. Bivour C. Reichel M. Hermle S.W. Glunz Passivated rear contacts for high-efficiency n-type Si solar cells providing high interface passivation quality and excellent transport characteristics Sol. Energy Mater. Sol. Cells 120 2014 270 274 [2] F. Schindler B. Michl P. Krenckel S. Riepe J. Benick R. Müller A. Richter S.W. Glunz M.C. Schubert Optimized multicrystalline silicon for solar cells enabling conversion efficiencies of 22% Sol. Energy Mater. Sol. Cells 171 2017 180 186 [3] J. Benick A. Richter R. Muller H. Hauser F. Feldmann P. Krenckel S. Riepe F. Schindler M.C. Schubert M. Hermle A.W. Bett S.W. Glunz High-efficiency n-type HP mc silicon solar cells IEEE J. Photovolt. 7 5 2017 1171 1175 [4] J.A. Giesecke M.C. Schubert B. Michl F. Schindler W. Warta Minority carrier lifetime imaging of silicon wafers calibrated by quasi-steady-state photoluminescence Sol. Energy Mater. Sol. Cells 95 3 2011 1011 1018 [5] F. Schindler J. Giesecke B. Michl J. Schön P. Krenckel S. Riepe W. Warta M.C. Schubert Material limits of multicrystalline silicon from state-of-the-art photoluminescence imaging techniques Prog. Photovolt.: Res. Appl. 2016 [6] F. Schindler J. Schön B. Michl S. Riepe P. Krenckel J. Benick F. Feldmann M. Hermle S.W. Glunz W. Warta M.C. Schubert High-efficiency multicrystalline silicon solar cells: potential of n-type doping IEEE J. Photovolt. 5 6 2015 1571 1579 [7] A. Bentzen B.G. Svensson E.S. Marstein A. Holt The influence of structural defects on phosphorus diffusion in multicrystalline silicon Sol. Energy Mater. Sol. Cells 90 18–19 2006 3193 3198 [8] A. Fell J. Schön M.C. Schubert S.W. Glunz The concept of skins for silicon solar cell modeling Sol. Energy Mater. Sol. Cells 173 Supplement C 2017 128 133 [9] H. Haug M.S. Wiig R. Søndenå J. Wong Simulating the effect of lifetime non-uniformity on solar cell performance using cmd-PC1D 6 and griddler 2 Energy Procedia 92 2016 69 74 [10] P.P. Altermatt G. Heiser M.A. Green Numerical quantification and minimization of perimeter losses in high-efficiency silicon solar cells Prog. Photovolt.: Res. Appl. 4 5 1996 355 367 [11] A. Fell K.C. Fong K.R. McIntosh E. Franklin A.W. Blakers 3-D simulation of interdigitated-back-contact silicon solar cells with quokka including perimeter losses IEEE J. Photovolt. 4 4 2014 1040 1045 [12] A. Richter J. Benick F. Feldmann A. Fell M. Hermle S.W. Glunz n-type Si solar cells with passivating electron contact: identifying sources for efficiency limitations by wafer thickness and resistivity variation Sol. Energy Mater. Sol. Cells 2017 [13] S.A. Edmiston G. Heiser A.B. Sproul M.A. Green Improved modeling of grain boundary recombination in bulk and p‐n junction regions of polycrystalline silicon solar cells J. Appl. Phys. 80 12 1996 6783 6795 [14] P.P. Altermatt G. Heiser Development of a three-dimensional numerical model of grain boundaries in highly doped polycrystalline silicon and applications to solar cells J. Appl. Phys. 91 7 2002 4271 4274 [15] D.B. Needleman H. Wagner P.P. Altermatt T. Buonassisi Three-dimensional TCAD modeling of grain boundaries in high-efficiency silicon solar cells IEEE J. Photovolt. 6 4 2016 817 822 [16] R. Müller, F. Schindler, A. Richter, P. Krenckel, B. Michl, F. Feldmann, S. Riepe, J. Benick, M.C. Schubert, S.W. Glunz, Impact of Crystal Defects on Record Efficiency n-type Multicrystalline Silicon Solar Cells, in: presented at the Silicon Workshop in Breckenridge. [17] R. Brendel S. Dreissigacker N.P. Harder P.P. Altermatt Theory of analyzing free energy losses in solar cells Appl. Phys. Lett. 93 17 2008 173503 (173503-3)", "scopus-id": "85047260206", "coredata": {"eid": "1-s2.0-S0927024818302186", "dc:description": "In this contribution, we present our recent results for high efficiency multicrystalline silicon solar cells. Based on n-type high-performance multicrystalline silicon substrates in combination with the TOPCon solar cell concept featuring a full area passivating back contact and a boron-diffused emitter as well as a plasma-etched black-silicon texture at the front side, a certified conversion efficiency of 22.3% has been achieved, which is currently the world record efficiency for multicrystalline silicon solar cells. A detailed loss analysis of the record solar cell batch discloses the nature of the remaining loss mechanisms, revealing the route for further improvements. We observe an efficiency gap between the multicrystalline and the FZ reference solar cells of ~1%abs. Compared to the FZ reference cells, the mc-Si cells also feature a significantly larger scattering in Voc and Jsc as well as a fill factor loss of ~1.5%abs. We show that the scattering in Jsc correlates with the area fraction of recombination-active structural crystal defects and the scattering in Voc additionally with lateral emitter-induced inhomogeneities. The fill factor loss is attributed to the general presence of strongly recombination-active grain boundaries. A detailed loss analysis of the record mc-Si solar cell shows that the major electrical losses are due to recombination at grain boundaries (0.7%abs) and recombination in the emitter (0.6%abs). By reducing these electrical loss channels, e.g. by an improved crystallization process together with a hydrogenation of the bulk and application of an adapted emitter, we expect to reach efficiencies for mc-Si solar cells in the range of 23%.", "openArchiveArticle": "false", "prism:coverDate": "2018-10-31", "openaccessUserLicense": null, "prism:aggregationType": "Journal", "prism:url": "https://api.elsevier.com/content/article/pii/S0927024818302186", "dc:creator": [{"@_fa": "true", "$": "Schindler, Florian"}, {"@_fa": "true", "$": "Fell, Andreas"}, {"@_fa": "true", "$": "Müller, Ralph"}, {"@_fa": "true", "$": "Benick, Jan"}, {"@_fa": "true", "$": "Richter, Armin"}, {"@_fa": "true", "$": "Feldmann, Frank"}, {"@_fa": "true", "$": "Krenckel, Patricia"}, {"@_fa": "true", "$": "Riepe, Stephan"}, {"@_fa": "true", "$": "Schubert, Martin C."}, {"@_fa": "true", "$": "Glunz, Stefan W."}], "link": [{"@_fa": "true", "@rel": "self", "@href": "https://api.elsevier.com/content/article/pii/S0927024818302186"}, {"@_fa": "true", "@rel": "scidir", "@href": "https://www.sciencedirect.com/science/article/pii/S0927024818302186"}], "dc:format": "application/json", "openaccessType": null, "pii": "S0927-0248(18)30218-6", "prism:volume": "185", "prism:publisher": "Published by Elsevier B.V.", "dc:title": "Towards the efficiency limits of multicrystalline silicon solar cells", "prism:copyright": "© 2018 Published by Elsevier B.V.", "openaccess": "0", "prism:issn": "09270248", "dcterms:subject": [{"@_fa": "true", "$": "Multicrystalline silicon"}, {"@_fa": "true", "$": "N-type"}, {"@_fa": "true", "$": "Free energy loss analysis"}, {"@_fa": "true", "$": "TOPCon"}, {"@_fa": "true", "$": "Record efficiency"}], "openaccessArticle": "false", "prism:publicationName": "Solar Energy Materials and Solar Cells", "openaccessSponsorType": null, "prism:pageRange": "198-204", "prism:endingPage": "204", "pubType": "fla", "prism:coverDisplayDate": "October 2018", "prism:doi": "10.1016/j.solmat.2018.05.006", "prism:startingPage": "198", "dc:identifier": "doi:10.1016/j.solmat.2018.05.006", "openaccessSponsorName": null}, "objects": {"object": [{"@category": "thumbnail", "@height": "136", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818302186-gr1.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "11353", "@ref": "gr1", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "160", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818302186-gr2.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "10100", "@ref": "gr2", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "164", "@width": "187", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818302186-gr3.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "9163", "@ref": "gr3", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "164", "@width": "192", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818302186-gr4.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "25910", "@ref": "gr4", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "164", "@width": "216", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818302186-gr5.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "5316", "@ref": "gr5", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "80", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818302186-gr6.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "11669", "@ref": "gr6", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "88", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818302186-gr7.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "6132", "@ref": "gr7", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "86", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818302186-gr8.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "3974", "@ref": "gr8", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "114", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818302186-gr9.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "7590", "@ref": "gr9", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "176", "@width": "284", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818302186-gr1.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "23110", "@ref": "gr1", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "495", "@width": "678", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818302186-gr2.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "98891", "@ref": "gr2", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "494", "@width": "565", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818302186-gr3.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "65265", "@ref": "gr3", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "481", "@width": "565", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818302186-gr4.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "160022", "@ref": "gr4", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "257", "@width": "339", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818302186-gr5.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "21366", "@ref": "gr5", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "104", "@width": "282", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818302186-gr6.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "14462", "@ref": "gr6", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "114", "@width": "282", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818302186-gr7.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "10998", "@ref": "gr7", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "266", "@width": "678", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818302186-gr8.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "47331", "@ref": "gr8", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "259", "@width": "496", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818302186-gr9.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "45522", "@ref": "gr9", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "782", "@width": "1261", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818302186-gr1_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "194299", "@ref": "gr1", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "2191", "@width": "3001", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818302186-gr2_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "714471", "@ref": "gr2", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "2187", "@width": "2500", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818302186-gr3_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "461920", "@ref": "gr3", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "2130", "@width": "2500", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818302186-gr4_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "1256300", "@ref": "gr4", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "1140", "@width": "1502", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818302186-gr5_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "136351", "@ref": "gr5", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "459", "@width": "1250", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818302186-gr6_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "122872", "@ref": "gr6", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "505", "@width": "1250", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818302186-gr7_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "77827", "@ref": "gr7", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "1177", "@width": "3000", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818302186-gr8_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "347736", "@ref": "gr8", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "1147", "@width": "2196", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818302186-gr9_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "395954", "@ref": "gr9", "@mimetype": "image/jpeg"}, {"@category": "standard", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818302186-mmc1.docx?httpAccept=%2A%2F%2A", "@multimediatype": "Microsoft Word file", "@type": "APPLICATION", "@size": "14886", "@ref": "mmc1", "@mimetype": "application/word"}]}, "link": {"@rel": "abstract", "@href": "https://api.elsevier.com/content/abstract/scopus_id/85047260206"}}