{"scopus-eid": "2-s2.0-85078778278", "originalText": "serial JL 278663 291210 291802 31 90 Arabian Journal of Chemistry ARABIANJOURNALCHEMISTRY 2020-01-13 2020-01-13 2020-11-01 2020-11-01 2020-11-06T07:55:13 1-s2.0-S1878535220300083 S1878-5352(20)30008-3 S1878535220300083 10.1016/j.arabjc.2020.01.004 S300 S300.1 FULL-TEXT 1-s2.0-S1878535220X00116 2020-12-13T08:30:02.093824Z 0 0 20201101 20201130 2020 2020-01-13T16:02:45.397078Z articleinfo articletitlenorm authfirstinitialnorm authfirstsurnamenorm cid cids contenttype copyright crossmark dateloaded dateloadedtxt datesearch datesort dateupdated dco docsubtype doctype doi eid ewtransactionid fundingbodyid hubeid indexeddate issfirst issn issnnorm issuelist itemstage itemtransactionid itemweight oauserlicense openaccess openarchive pg pgfirst pglast pii piinorm pubdateend pubdatestart pubdatetxt pubyr sectiontitle sortorder sponsoredaccesstype srctitle srctitlenorm srctype ssids alllist content oa subj subheadings tomb volfirst volissue volumelist webpdf webpdfpagecount yearnav figure table body acknowledge affil articletitle auth authfirstini authfull authkeywords authlast grantnumber grantsponsor primabst pubtype ref 1878-5352 18785352 UNLIMITED NONE true 13 13 11 11 Volume 13, Issue 11 52 8239 8247 8239 8247 202011 November 2020 2020-11-01 2020-11-30 2020 Special Section on Advanced Nanostructured Photocatalysts article fla © 2020 The Author(s). Published by Elsevier B.V. on behalf of King Saud University. NANOSTRUCTUREDPYRAMIDALBLACKSILICONULTRALOWREFLECTANCEHIGHPASSIVATION HSU C 1 Introduction 2 Material and methods 3 Results and discussion 4 Conclusions Acknowledgements References ABDULKADIR 2019 74 80 A BAKERFINCH 2013 960 971 S BARRIO 2012 845 854 R BASTIDE 2009 1536 1540 S CHARTIER 2008 5509 5516 C CHEON 2018 125102 S CHEN 2019 1 8 K CHRISTESEN 2012 6024 6029 J CICHOSZEWSKI 2013 333 339 J DINGEMANS 2010 2 5 G ES 2016 440 446 F GEYER 2012 13446 13451 N HAMEL 2010 231 234 A HAN 2014 271 304 H HOEX 2008 113703 B HSU 2014 2 17 C HUANG 2011 285 308 Z KERN 1970 187 206 W KOYNOV 2006 203107 S KROLL 2012 843817 M LEE 2017 3224 3228 K LI 2016 436 449 M LI 2000 2572 2574 X LIU 2014 3223 3263 X LV 2018 110 J MA 2018 035010 S MANEA 2005 423 431 E NAUMANN 2012 04D106 V NOOR 2019 586 592 N OH 2012 743 748 J PASANEN 2018 1 6 T PEARCE 2002 663 674 J RAHMAN 2017 1556 1562 T RAHMAN 2017 444 453 T REPO 2013 866 871 P SARNET 2008 688119 T SHEN 2014 L TAN 2019 560 573 Q TOOR 2016 15448 15466 F TOOR 2016 412003 F VINZONS 2017 385 L XI 2014 485 489 Z XI 2003 255 263 Z YAE 2003 632 636 S HSUX2020X8239 HSUX2020X8239X8247 HSUX2020X8239XC HSUX2020X8239X8247XC Full 2020-01-07T09:49:59Z Author http://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license. © 2020 The Author(s). Published by Elsevier B.V. on behalf of King Saud University. 2020-01-13T02:42:58.326Z http://vtw.elsevier.com/data/voc/AddOnTypes/50.7/eoas item S1878-5352(20)30008-3 S1878535220300083 1-s2.0-S1878535220300083 10.1016/j.arabjc.2020.01.004 278663 2020-12-13T08:30:02.093824Z 2020-11-01 2020-11-30 UNLIMITED NONE 1-s2.0-S1878535220300083-main.pdf https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1878535220300083/MAIN/application/pdf/fe88ea8b7e3de8585fc179274d1cde16/main.pdf main.pdf pdf true 4351885 MAIN 9 1-s2.0-S1878535220300083-main_1.png https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1878535220300083/PREVIEW/image/png/1098b1a98fa52218c138acd261fc2660/main_1.png main_1.png png 50597 849 656 IMAGE-WEB-PDF 1 1-s2.0-S1878535220300083-gr1.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1878535220300083/gr1/DOWNSAMPLED/image/jpeg/28e69cf24edc45ae146e218a0c965411/gr1.jpg gr1 gr1.jpg jpg 16016 148 542 IMAGE-DOWNSAMPLED 1-s2.0-S1878535220300083-gr2.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1878535220300083/gr2/DOWNSAMPLED/image/jpeg/0209967747f359075f47791a858e780b/gr2.jpg gr2 gr2.jpg jpg 68861 590 543 IMAGE-DOWNSAMPLED 1-s2.0-S1878535220300083-gr3.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1878535220300083/gr3/DOWNSAMPLED/image/jpeg/1222d09cc4e758ba743a6cdb9f3b7bc0/gr3.jpg gr3 gr3.jpg jpg 87552 602 542 IMAGE-DOWNSAMPLED 1-s2.0-S1878535220300083-gr4.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1878535220300083/gr4/DOWNSAMPLED/image/jpeg/9f438029dfaca767d6acbb91b979cec0/gr4.jpg gr4 gr4.jpg jpg 62628 835 347 IMAGE-DOWNSAMPLED 1-s2.0-S1878535220300083-gr5.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1878535220300083/gr5/DOWNSAMPLED/image/jpeg/11fe2b6e2baf4c898445dcc922a69777/gr5.jpg gr5 gr5.jpg jpg 72364 918 371 IMAGE-DOWNSAMPLED 1-s2.0-S1878535220300083-gr6.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1878535220300083/gr6/DOWNSAMPLED/image/jpeg/6e8b2d4ff64e838f3b10f115c2f40ae9/gr6.jpg gr6 gr6.jpg jpg 67515 578 369 IMAGE-DOWNSAMPLED 1-s2.0-S1878535220300083-gr7.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1878535220300083/gr7/DOWNSAMPLED/image/jpeg/d1d981cef3821cd846678d018e2e70e1/gr7.jpg gr7 gr7.jpg jpg 97914 892 289 IMAGE-DOWNSAMPLED 1-s2.0-S1878535220300083-gr1.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1878535220300083/gr1/THUMBNAIL/image/gif/d67ba7dd269305951f2757770e0ba569/gr1.sml gr1 gr1.sml sml 4081 60 219 IMAGE-THUMBNAIL 1-s2.0-S1878535220300083-gr2.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1878535220300083/gr2/THUMBNAIL/image/gif/a1a3d2575533392b3135e1b5de3e17c9/gr2.sml gr2 gr2.sml sml 14104 164 151 IMAGE-THUMBNAIL 1-s2.0-S1878535220300083-gr3.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1878535220300083/gr3/THUMBNAIL/image/gif/55c0f43c33f1ac9763a3e3d2f0c152ad/gr3.sml gr3 gr3.sml sml 13942 163 147 IMAGE-THUMBNAIL 1-s2.0-S1878535220300083-gr4.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1878535220300083/gr4/THUMBNAIL/image/gif/2b9d03acc424556e5b9d801d23897946/gr4.sml gr4 gr4.sml sml 4263 164 68 IMAGE-THUMBNAIL 1-s2.0-S1878535220300083-gr5.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1878535220300083/gr5/THUMBNAIL/image/gif/542592b59d4a90d0a22be70576a8cf66/gr5.sml gr5 gr5.sml sml 4058 163 66 IMAGE-THUMBNAIL 1-s2.0-S1878535220300083-gr6.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1878535220300083/gr6/THUMBNAIL/image/gif/6cc6f0eb69c1ddd22d91e36ea90050db/gr6.sml gr6 gr6.sml sml 10299 163 104 IMAGE-THUMBNAIL 1-s2.0-S1878535220300083-gr7.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1878535220300083/gr7/THUMBNAIL/image/gif/2df950485e1f8f89a21fd853ddfe5eeb/gr7.sml gr7 gr7.sml sml 6636 164 53 IMAGE-THUMBNAIL 1-s2.0-S1878535220300083-gr1_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1878535220300083/gr1/HIGHRES/image/jpeg/e34a17a3def873666bcdb3eca661b98d/gr1_lrg.jpg gr1 gr1_lrg.jpg jpg 100753 655 2402 IMAGE-HIGH-RES 1-s2.0-S1878535220300083-gr2_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1878535220300083/gr2/HIGHRES/image/jpeg/0928022ca75140a72fd242794c9d19b6/gr2_lrg.jpg gr2 gr2_lrg.jpg jpg 460043 2611 2403 IMAGE-HIGH-RES 1-s2.0-S1878535220300083-gr3_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1878535220300083/gr3/HIGHRES/image/jpeg/9288b1617cb442c1f72b58b0206c310f/gr3_lrg.jpg gr3 gr3_lrg.jpg jpg 566208 2668 2402 IMAGE-HIGH-RES 1-s2.0-S1878535220300083-gr4_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1878535220300083/gr4/HIGHRES/image/jpeg/a55723c70062d0077dacefc28dc10be5/gr4_lrg.jpg gr4 gr4_lrg.jpg jpg 464121 3696 1536 IMAGE-HIGH-RES 1-s2.0-S1878535220300083-gr5_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1878535220300083/gr5/HIGHRES/image/jpeg/31b2a902c60bd4de5bcf3fe0d5bea200/gr5_lrg.jpg gr5 gr5_lrg.jpg jpg 472452 4067 1644 IMAGE-HIGH-RES 1-s2.0-S1878535220300083-gr6_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1878535220300083/gr6/HIGHRES/image/jpeg/97ac1ed77b1d36da70851ee1c12d189a/gr6_lrg.jpg gr6 gr6_lrg.jpg jpg 618071 2564 1636 IMAGE-HIGH-RES 1-s2.0-S1878535220300083-gr7_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1878535220300083/gr7/HIGHRES/image/jpeg/2933864696f1c2f171552320fffea859/gr7_lrg.jpg gr7 gr7_lrg.jpg jpg 1014751 3952 1281 IMAGE-HIGH-RES 1-s2.0-S1878535220300083-am.pdf am am.pdf pdf 5141260 AAM-PDF https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/egi:10B3XN7D19T/MAIN/application/pdf/ad33ad640a7ec79fa272ecfedc46fbda/am.pdf ARABJC 2542 S1878-5352(20)30008-3 10.1016/j.arabjc.2020.01.004 The Author(s) Fig. 1 Schematic diagrams of the wet etching processes (a) step 1: KOH etching forming pyramids and (b) step 2: MACE etching forming nanostructures. (c) SiNx/Al2O3 passivation stacked layer on nanostructured pyramidal surface. Fig. 2 SEM images of black silicon with the AgNO3 concentration of (a) 0 (original), (b) 0.015, (c) 0.03, (d) 0.045, (e) 0.06, and (f) 0.075 M. Fig. 3 SEM images of SiNx/Al2O3-passivated black silicon with the AgNO3 concentration of (a) 0 (original), (b) 0.015, (c) 0.03, (d) 0.045, (e) 0.06, and (f) 0.075 M. Fig. 4 Reflectance spectra of black silicon (a) before and (b) after SiNx/Al2O3 passivation. (c) Average reflectance over 400–1000 nm for black silicon before and after passivation. Fig. 5 Injection-level dependent minority carrier lifetime of black silicon (a) before and (b) after SiNx/Al2O3 passivation. (c) Minority carrier lifetime at the carrier concentration of 1015 cm−3 for black silicon before and after passivation. Fig. 6 Cross-sectional SEM images of black silicon with the AgNO3 concentration of 0.03 M. Fig. 7 Cross-sectional TEM images of black silicon with the AgNO3 concentration of 0.03 M. Table 1 Parameters for wet etching processes and passivation layer deposition. 1st wet etching process Parameter Value Solution temperature (°C) 80 Time (min) 40 KOH concentration (wt.%) 20 2nd wet etching process Parameter Value Solution temperature (°C) 50 Time (min) 3 AgNO3 concentration (M) 0.015–0.075 ALD-Al2O3 thin film deposition Parameter Value Substrate temperature (°C) 135 H2O carry gas flow rate (sccm) 400 H2O dilute gas flow rate (sccm) 4000 TMA carry gas flow rate (sccm) 200 TMA dilute gas flow rate (sccm) 2000 Thickness (nm) 15 ICPCVD-SiNx thin film deposition Parameter Value Substrate temperature (°C) 120 Power (W) 1200 Pressure (mTorr) 5 TMS flow rate (sccm) 35 NH3 flow rate (sccm) 25 Thickness (nm) 50 Table 2 Minimum set of PC1D simulation parameters for black silicon solar cells with different AgNO3 concentration. Parameter Value Exterior front reflectance (%) Variable Exterior rear reflectance (%) 0 Internal optical reflectance (%) 90 Wafer thickness (μm) 170 P-type background doping (cm−3) 1016 N-type doping (cm−3) 1019 Front surface recombination (cm/s) Variable Rear surface recombination (cm/s) 20 Bulk recombination lifetime (μs) 250 Table 3 Performance of the simulated black silicon solar cells with different AgNO3 concentration. Concentration (M) Voc (mV) Jsc (mA/cm2) FF η (%) Industry 664.3 39.3 0.83 21.7 Original 678.3 39.4 0.83 22.2 0.015 676.8 39.9 0.83 22.4 0.03 675.7 40.8 0.83 22.9 0.045 674.1 40.6 0.83 22.7 0.06 671.9 40.4 0.83 22.5 0.075 670.4 38.9 0.83 21.6 Peer review under responsibility of King Saud University. Original article Nanostructured pyramidal black silicon with ultra-low reflectance and high passivation Chia-Hsun Hsu a Shih-Mao Liu b Wan-Yu Wu c Yun-Shao Cho c Pao-Hsun Huang d Chien-Jung Huang e Shui-Yang Lien a c f ⁎ Wen-Zhang Zhu a f a School of Opto-Electronic and Communication Engineering, Xiamen University of Technology, Xiamen 361024, China School of Opto-Electronic and Communication Engineering Xiamen University of Technology Xiamen 361024 China School of Opto-Electronic and Communication Engineering, Xiamen University of Technology, Xiamen 361024, China b Mechanical and Automation Engineering, Da-Yeh University, Changhua 51591, Taiwan Mechanical and Automation Engineering Da-Yeh University Changhua 51591 Taiwan Mechanical and Automation Engineering, Da-Yeh University, Changhua 51591, Taiwan c Department of Materials Science and Engineering, Da-Yeh University, Changhua 51591, Taiwan Department of Materials Science and Engineering Da-Yeh University Changhua 51591 Taiwan Department of Materials Science and Engineering, Da-Yeh University, Changhua 51591, Taiwan d School of Information Engineering, Jimei University, Xiamen 361021, China School of Information Engineering Jimei University Xiamen 361021 China School of Information Engineering, Jimei University, Xiamen 361021, China e Department of Applied Physics, National University of Kaohsiung, Kaohsiung 81148, Taiwan Department of Applied Physics National University of Kaohsiung Kaohsiung 81148 Taiwan Department of Applied Physics, National University of Kaohsiung, Kaohsiung 81148, Taiwan f Fujian Key Laboratory of Optoelectronic Technology and Devices, Xiamen University of Technology, Xiamen 361024, China Fujian Key Laboratory of Optoelectronic Technology and Devices Xiamen University of Technology Xiamen 361024 China Fujian Key Laboratory of Optoelectronic Technology and Devices, Xiamen University of Technology, Xiamen 361024, China ⁎ Corresponding author at: School of Opto-Electronic and Communication Engineering, Xiamen University of Technology, Xiamen 361024, China. School of Opto-Electronic and Communication Engineering Xiamen University of Technology Xiamen 361024 China In this study, nanostructured pyramidal black silicon is prepared by metal assisted chemical etching method, in which the silver nitrate (AgNO3) is used as the metal catalyst. Effects of the concentration of AgNO3 on passivation and optical properties of the black silicon are investigated. The experimental results show that at the AgNO3 concentration of 0.03 M, the nanostructure length is about 300 nm, and the reflectance of the black silicon with a stack of silicon nitride (SiNx) and aluminum oxide (Al2O3) is 0.8%, which is comparable to that of the conventional black silicon with micrometer-long nanowires. In addition, an acceptably low surface recombination rate of 42 cm/s can be obtained. Plasma chemical vapor deposited SiNx is deposited well on the top of nanostructures of black silicon, but shows poor coverage at the bottom region. Spatial atomic layer deposited Al2O3 can conformally cover the nanostructures with high passivation quality. Simulation result indicates an improvement of 5.5% of conversion efficiency for the nanostructured pyramidal black silicon solar cell compared to industrial silicon solar cell. The short nanostructured pyramidal surface with low reflectance and high passivation is expected to be helpful for black silicon technology applied to photovoltaic applications. Keywords Black silicon Passivation Reflectance Solar cell Metal assisted chemical etching 1 Introduction Flat silicon having a reflection of 30–40% of the incident light across a broad spectrum severely limits the efficiency and photosensitivity of photo-electronic devices. To decrease the costs a reduction in silicon absorber thickness demands improved light trapping concepts. Alkaline etching is a common way for single-crystalline silicon (c-Si) solar cells to create pyramidal surfaces, reducing the reflectance of c-Si to about 13–15%. Numerous studies have reported that black silicon has much lower reflection losses than conventionally flat or textured c-Si with simple antireflective coatings (Kroll et al., 2012; Hsu et al., 2014; Liu et al., 2014; Lv et al., 2018; Tan et al., 2019; Toor et al., 2016a, 2016b). The best results of black silicon utilize expensive approaches such as femtosecond laser, leading to challenges to scale up (Sarnet et al., 2008). Scaling is essential for photovoltaic applications as large area of solar cells are needed to generate power for sustainable global energy supply (Pearce, 2002). Among different techniques for fabrication of black silicon nanostructures (Cichoszewski et al., 2013), metal-assisted chemical etching (MACE) is one of the most significant methods owing to its simplicity, low cost and large-area capability (Oh et al., 2012; Chen et al., 2019; Noor et al., 2019; Rahman et al., 2017; Toor et al., 2016b; Chartier et al., 2008). In MACE process, noble metals are previously deposited on silicon to inject holes to the valence band of the silicon substrate, catalyzing oxidation of silicon (Huang et al., 2011; Es et al., 2016). The usually used noble metals are silver, platinum, gold and copper, deposited by sputtering (Huang et al., 2011; Li and Bohn, 2000), evaporation (Koynov et al., 2006), electroless or electrochemical displacement (Bastide et al., 2009; Yae et al., 2003). Gold and platinum are relatively expensive, whereas the etching rate of copper-catalyzed MACE process is low. Silver nitrate (AgNO3) is the most widely used catalyst for black silicon synthesis. The metal can be a continuous layer or separated particles depending on the deposition method. After metal deposition, a hydrogen fluoride (HF)-contained solution is used for silicon dissolution, leading to randomly distributed nanostructures. It has been reported that regular nanowire arrays can be achieved by using a mask (Han et al., 2014; Li et al., 2016). Although a theoretical model of MACE etching has been established for both spatially distributed (Rahman and Boden, 2017) and continuous (Geyer et al., 2012) metal catalysis on silicon, the existing works are mostly based on flat silicon substrates. The required length of the nanostructures is in micrometer level in order to have a very low reflectance of 1% or less (Ma et al., 2018; Repo et al., 2013; Abdulkadir et al., 2019; Vinzons et al., 2017). However, long nanowires in turn mean a high surface area and a large amount of dangling bonds, which increases the difficulties of passivation of silicon. Moreover, sharp and long nanowires are unfavorable for photovoltaic device fabrication especially for doping and thin film deposition. These problems are one of the reasons limiting the conversion efficiency of black silicon solar cells, although the low reflectance is reached. To our best knowledge, black silicon with nanostructures shorter than 400 nm with very low reflectance and satisfactorily high passivation is rarely reported. In this study, nanostructured pyramidal surfaces of black silicon are prepared by MACE process and passivated by a stack of silicon nitride (SiNx) and aluminum oxide (Al2O3). The MACE process is performed on previously textured pyramidal silicon, instead of planar silicon. Effects of the concentration of the metal catalyst on optical and passivation properties of silicon surface are investigated. Finally, performance of the nanostructured pyramidal black silicon solar cells is evaluated, and compared to that with the industrial standard texture structures. The preparation of black silicon on the pyramidal silicon surfaces mainly has two advantages. The first is that the size of the nanostructures for reaching a very low reflectance is shorter than that prepared on planar silicon surfaces. Secondly, the short nanostructures are easier to be passivated as compared to the long nanostructures, which often suffer from the poor coverage of passivation layers. Although an additional wet-etching process is needed, the two-step wet-etching process still demonstrates high potential in the applications where the ultra-low reflectance and high passivation are both required. 2 Material and methods P-type (1 0 0) Czochralski c-Si polished silicon wafers with a resistivity of 1–10 Ω-cm and a thickness of 200 ± 20 µm were used as a starting substrate. The wafers were cleaned sequentially with acetone, alcohol, and deionized water at room temperature in an ultrasonic cleaning bath. Unlike the conventional MACE process starting with a planar silicon wafer, the cleaned wafers were immersed in acid solution containing 20 wt% KOH and 3 wt% isopropyl alcohol (IPA) at 80 °C for 40 min to remove saw damage, and to create micrometer-sized pyramids on the wafer surface. The black silicon was fabricated by using MACE process, in which the pyramidal wafers were etched in a solution consisting of AgNO3 and 3 M HF at 50 °C for 3 min, followed by a dip in HNO3 to remove the silver particles. The concentration of the AgNO3 was varied from 0.015 to 0.075 M to investigate its effect on properties of the black silicon. The black silicon wafers after the MACE process were cleaned by standard Radio Corporation America process (Kern and Puotinen, 1970), followed by a dip in HF. To passivate the black silicon, a 15 nm-thick Al2O3 layer was deposited by using spatial atomic layer deposition (s-ALD) with trimethylaluminum (TMA) and H2O as metal source and oxidant, respectively. The s-ALD system consisted of a H2O/TMA/H2O injector and a substrate holder moving back and forth with a speed of 150 mm/s under the injector. The gap between the substrate and injector was 1 mm. The nitrogen gas was used as the carrier gas, and also as the curtain to separate the TMA and H2O to avoid gas phase chemical vapor deposition reaction. The bubbler temperature was 17.5 °C for TMA and 25 °C for H2O. The substrate temperature was kept to 135 °C. The growth rate of the s-ALD Al2O3 was 1.7 Å/cycle. The SiNx antireflective layer with a thickness of 50 nm was deposited using 13.56 MHz inductively-coupled plasma chemical vapor deposition (ICPCVD) with a gas mixture of tetramethylsilane (TMS) and ammonia (NH3). The substrate temperature was 120 °C, and the deposition pressure was 5 mTorr. After SiNx/Al2O3 deposition, the samples were annealed in air at 450 °C to activate passivation. Detailed parameters for the wet etching, s-ALD Al2O3 and ICPCVD SiNx are summarized in Table 1 . For the characterization, the reflectance spectra of the black silicon were measured using a spectrometer in the spectral region from 380 to 1000 nm. The thickness of the films was measured by an alpha-step profilometer (D-500, KLA-Tencor, USA). The minority carrier lifetime of the samples was obtained by a lifetime tester (WCT-120, Sinton, CO, USA). The cross-sectional images of the samples were observed by a scanning electron microscopy (SEM, JSM-7800F, JEOL, Tokyo, Japan) and a transmission electron microscopy (TEM, JEM2100, JEOL, Tokyo, Japan). 3 Results and discussion Fig. 1 shows a schematic diagram of the passivated black silicon at different stages. As shown in Fig. 1a, the pyramidal surface is formed after KOH/IPA etching process. The silicon etching reaction can be expressed by (1) Si + 2OH− + 2H2O → Si(OH)4 + 2H2 The addition of the IPA to KOH lowers the {1 0 0}:{1 1 1} etching-rate ratio, but reduces convex-corner undercutting and smooths the etched surface. Fig. 1b shows the black silicon structure after the MACE process, involving the following chemical reactions (2) Si + H2O → SiO2 + 4H+ + 4e− (3) Ag+ + e− → Ag0 (4) SiO2 + 6HF → H2SiF6 + 2H2O When the Ag+ ions are contact to silicon surface, they reduce to Ag0 with injecting a hole to silicon. The oxidation of silicon occurs, and then dissolved by HF in the form of SiF6 2−, leading to the Ag particles down into the wafer. The nanostructures are thus produced on the sidewalls of the pyramids. The MACE etching rate is about half compared to that of the planar silicon. Fig. 1c shows the SiNx/Al2O3 passivation layer deposited on the nanostructured pyramids. The deposition quality at the bottom and tip of the high aspect ratio structures is important for achieving low surface recombination rate as the films generally hardly well-cover on those sites. As it will be shown later, the required length of the nanostructures on pyramids for reaching 1% reflectance is much shorter than starting MACE on a planar wafer. Fig. 2 shows the SEM images of the black silicon with various AgNO3 concentrations. As shown in Fig. 2a, a typical pyramidal surface is observed for the sample with KOH etching alone. The size and uniformity of the pyramids are randomly distributed and can affect the reflectance. Usually, the average pyramidal size ranges from 1 to 9 µm with corresponding reflectance varied between 13 and 15% (Barrio et al., 2012; Manea et al., 2005; Xi et al., 2003). During the wet anisotropic etching process of (1 0 0) silicon, four (1 1 1) sidewalls are exposed to form square-based pyramids with a facet tilt angle of 54° in an ideal process (Hamel and Chibani, 2010; Xi et al., 2014). The tilt angle in this study is slightly smaller. For a practical, non-ideal wet etching process, a slightly smaller tilt angle is normally observed (Baker‐Finch and McIntosh, 2013). In Fig. 2b, the AgNO3 concentration of 0.015 M roughens the pyramidal surface, but does not lead to a spiked surface. This is due to the insufficient Ag concentration. As the concentration increases to 0.03 M shown in Fig. 2c, slice-like nanostructures are tremendously developed on the sidewalls of pyramids. A similar nanostructured surface except for the less density of the slices is observed at the concentration of 0.045 M (Fig. 2d). A transition from slice-like to spike-like nanostructures occurs at the concentration of 0.06 M as shown in Fig. 2e. The spike-like structure is presumably regarded as a degeneration of the slice-like structures as a consequence of the increasing AgNO3 concentration. A higher AgNO3 concentration results in an enhancement of Ag nucleation, which enlarges the size of the Ag particles and thus shortens the space between two neighboring Ag particles. In addition, the HF is harder to diffuse through the Ag/Si interface to remove the silicon oxide compared to the case of a low AgNO3 concentration. This leads to a lower etching rate and a reduced height of the nanostructures at the concentrations of 0.045 and 0.06 M. No nanostructures can be observed at 0.075 M as shown in Fig. 2f, indicating the excessive AgNO3 concentration. Fig. 3 shows the SEM images of the black silicon with a SiNx/Al2O3 passivation stacked layer. The passivation stack can be well-deposited on the sample without MACE process as shown in Fig. 3a. The SiNx/Al2O3 stack has been demonstrated to be one of the best candidates to passivate silicon mainly due to chemical passivation from strong SiO coordination and hydrogenation at the Si/Al2O3 interface (Dingemans et al., 2010; Naumann, et al., 2012). In addition, field-effect passivation resulting from fixed negative charge inside Al2O3 improves passivation of p-type silicon by repelling minority carriers from surfaces (Hoex et al., 2008). For black silicon, the coverage of the passivation layer on the nanostructures is critical especially at the bottom and top regions. From Fig. 3b–e, it can be seen that the top of the nanostructures is round, indicating that the passivation stack can be deposited regardless on spike- or slice-like structures. Fig. 4 a shows the reflectance spectra of the pyramidal silicon and the black silicon with different AgNO3 concentration. The reflectance curve of the pyramidal silicon is the highest, which ranges from 15 to 29%. The curves is the lowest when the AgNO3 concentration is 0.03 M, and then increases when the concentration further increases. Fig. 4b shows the reflectance spectra of the black silicon with SiNx/Al2O3 passivation. The reflectance decreases for all the samples compared to before passivation as the intermediate refractive indices of the SiNx and Al2O3 between air and silicon leads to antireflection. The sample with pyramidal silicon demonstrates a typical curve with a minimum at a specific wavelength. There is still about 15–20% reflectance at 400 nm and 5–10% at 1000 nm. All the passivated black silicon samples show a reduction of reflectance in the whole investigated wavelength region. The lowest reflectance is at 0.045 M. The average reflectance values over 400–1000 µm are shown in Fig. 4c. The minimum average reflectance is 5.14% at 0.045 M before passivation deposition, and is 0.8% at 0.03 M after the deposition. The AgNO3 concentration of 0.075 M leads to the highest reflectance. This is due to that the nanostructures are removed from the surface, and the pyramidal structure is also damaged as shown in the SEM image. Fig. 5 a and b shows the injection-level dependent minority carrier lifetime for the black silicon with various AgNO3 concentrations before and after SiNx/Al2O3 passivation, respectively. The lifetime values at 1 × 1015 cm−3 are shown in Fig. 5c. Without passivation, the lifetime values are around 8–20 µs. The black silicon samples have lower lifetimes than pyramidal one due to generation of the defects during MACE process. With passivation, the pyramidal silicon has the highest lifetime of 250 µs, corresponding to a surface recombination rate of 34 cm/s. The lifetime decreases from 217 to 195 µs when the AgNO3 concentration increases from 0.015 to 0.045 M. A drop in lifetime is observed at 0.06 M. The spike-like structures have a higher aspect ratio than sliced-like structures, and thus are more difficult to be passivated. The passivation on the sample with the AgNO3 concentration of 0.075 M leads to the lowest lifetime of 106 µs. The black silicon with 0.03 M AgNO3 concentration and SiNx/Al2O3 passivation stack has the lowest reflectance, and its cross-sectional SEM images are shown in Fig. 6 a. A higher resolution image is shown in Fig. 6b. The nanostructures on the sidewalls of the pyramid are clearly seen. The height of the nanostructures is estimated to be 300 nm or less. It is worthy to point out that in the traditional MACE process, which starts on planar wafers, the required height of the nanowires is twice or even more compared to that in this work to reach a reflectance around 1% (Ma et al., 2018; Repo et al., 2013). However, the passivation quality is compromised as the films are hardly coated well on the sharp and long nanostructures. This problem leads to the black silicon solar cells without conversion efficiency improvement although the absorption of light is enhanced. Reduction in the nanostructure height can improve the passivation layer deposition. Another advantage of the shorter nanostructures is in the aspect of the diffusion process for fabricating a p-n junction. It is known that the junction depth is around 0.5–1 µm for c-Si solar cells (Cheon et al., 2018; Lee et al., 2017; Shen et al., 2014). However, long nanostructures result in a deep junction depth. The emitter is usually regarded as a dead layer as the carriers generated in this region will almost recombine before reaching to the junction (Christesen et al., 2012). In particular, compared to a flat surface, the long spikes of black silicon lead to a higher doping concentration at the surface (Pasanen et al., 2018), which increases the surface recombination rate. A low blue spectral response is expected for c-Si solar cells with a deep and high recombination emitter. Black silicon with short nanostructures could be helpful to diminish these adverse effects. To further investigate the coverage of the passivation layer, cross-sectional images of the black silicon with 0.03 M AgNO3 concentration and SiNx/Al2O3 passivation layer are shown in Fig. 7 . It can be seen from Fig. 7a that the thicknesses of SiNx and Al2O3 layer are around 50 and 20 nm, respectively. It can be seen that SiNx covers well on the sidewalls of pyramids. However, some light grey-color regions appear between the nanostructures, indicating that the films are not filled. Fig. 7b shows a higher resolution TEM image of the top region of a black silicon nanostructure. It can be seen that both Al2O3 and SiNx can deposit well on the tip. Fig. 7c shows the bottom between two nanostructures. The labels 1, 2 and 3 correspond to black silicon structures, Al2O3 and SiNx, respectively. Highly conformal deposition of s-ALD Al2O3 is observed. In contrast, an apparent thickness variation along the black silicon structure is observed. The SiNx thickness is less than 10 nm at the bottom of the nanostructure. The SiNx does not present in the region between two nanostructures. This result suggests that the s-ALD is helpful for passivation of black silicon, while the traditional PECVD technique alone might not be adequate to obtain high passivation quality due to the poor coverage. The photovoltaic performance such as open-circuit voltage (Voc), short-circuit current density (Jsc), fill factor (FF) and conversion efficiency (η) of the black silicon solar cells with different AgNO3 concentration and with SiNx/Al2O3 passivation are simulated by PC1D (version 6.2). The minimum set of input parameters is summarized in Table 2 . The cell structure is a typical passivated emitter and rear contact cell, and the texturing in this work affects the front surface reflectance and front surface recombination rate. The metal contacts and interfaces are assumed to be ideal. The simulation result is shown in Table 3 . For comparison, the industrial standard texturization and passivation are shown as a reference, in which a SiNx single layer is used for passivating the pyramidal silicon. The simulation result indicates that Voc of the reference cell is 664.3 mV. The pyramidal silicon with the SiNx/Al2O3 passivation shows the highest Voc of 678.3 mV. The Voc decreases from 676.8 to 670.4 mV when the AgNO3 concentration increases from 0.015 to 0.075 M. For the Jsc, due to the lowest reflectance, the cell with the AgNO3 concentration of 0.03 M shows the best Jsc of 40.4 mA/cm2, which is significantly higher than the reference cell is 39.3 mA/cm2. The FF is around 0.83 for all the cells. Overall, compared to industrial standard configuration, the best conversion efficiency is 22.9%, which is higher than 21.7% of the reference cell. 4 Conclusions Low reflectance and high passivation can be achieved by fabricating nanostructured pyramids on silicon surfaces by MACE process and a stack of s-ALD Al2O3 and ICPCVD SiNx. Varying the AgNO3 concentration leads to a transformation from slice to spike-like nanostructures, which are removed at the concentration of 0.075 M. The nanostructured pyramidal black silicon at 0.03 M with a SiNx/Al2O3 stack demonstrates the ultra-low reflectance of 0.8%, which is comparable to that of the black silicon with micrometer-level nanowires. Moreover, an acceptably low surface recombination of 42 cm/s is obtained. The ALD shows a high conformal deposition on black silicon. The ICPCVD SiNx covers well on the top of the nanostructures, but has a poor coverage at the bottom and between two nanostructures. The simulation shows a conversion efficiency improvement by 5.5% can be reached as compared to that with current industrial texturization. In addition to the low reflectance and high passivation, the short-nanostructured black silicon proposed in this work should be easier to be applied to subsequent solar cell fabrication processes due to the surface morphology. Declaration of Competing Interest The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Acknowledgements This work was sponsored by the Science and Technology Project of Xiamen (No. 3502Z20183054) and the Science and Technology Program of the Educational Office of Fujian Province (No. JT180432). References Abdulkadir et al., 2019 A. Abdulkadir A. bin Abdul Aziz M. Zamir Pakhuruddin Optimization of etching time for broadband absorption enhancement in black silicon fabricated by one-step electroless silver-assisted wet chemical etching Optik 187 2019 74 80 10.1016/j.ijleo.2019.05.019 Abdulkadir, A., bin Abdul Aziz, A., Zamir Pakhuruddin, M., 2019. Optimization of etching time for broadband absorption enhancement in black silicon fabricated by one-step electroless silver-assisted wet chemical etching. Optik 187, 74–80. Doi: 10.1016/j.ijleo.2019.05.019 Baker-Finch and McIntosh, 2013 S.C. Baker-Finch K.R. McIntosh Reflection distributions of textured monocrystalline silicon: implications for silicon solar cells Prog. Photovolt. Res. Appl. 21 2013 960 971 10.1002/pip.2186 Baker‐Finch, S. C., McIntosh, K.R., 2013. Reflection distributions of textured monocrystalline silicon: implications for silicon solar cells. Progress in Photovoltaics: Research and Applications 21, 960–971. Doi: 10.1002/pip.2186 Barrio et al., 2012 R. Barrio N. González J. Cárabe J.J. Gandía Optimisation of NaOH texturisation process of silicon wafers for heterojunction solar-cells applications Sol. Energy 86 2012 845 854 10.1016/j.solener.2011.12.013 Barrio, R., González, N., Cárabe, J., Gandía, J.J., 2012. Optimisation of NaOH texturisation process of silicon wafers for heterojunction solar-cells applications. Solar Energy 86, 845–854. Doi: 10.1016/j.solener.2011.12.013 Bastide et al., 2009 S. Bastide N.L. Quang R. Monna C. Lévy-Clément Chemical etching of Si by Ag nanocatalysts in HF-H2O2: application to multicrystalline Si solar cell texturisation Phys. Status Solidi C 6 2009 1536 1540 10.1002/pssc.200881016 Bastide, S., Quang, N.L., Monna, R., Lévy‐Clément, C., 2009. Chemical etching of Si by Ag nanocatalysts in HF-H2O2: application to multicrystalline Si solar cell texturisation. Phys. Status Solidi C 6, 1536–1540. Doi: 10.1002/pssc.200881016 Chartier et al., 2008 C. Chartier S. Bastide C. Lévy-Clément Metal-assisted chemical etching of silicon in HF– H2O2 Electrochim. Acta 53 2008 5509 5516 10.1016/j.electacta.2008.03.009 Chartier, C., Bastide, S., Lévy-Clément, C., 2008. Metal-assisted chemical etching of silicon in HF– H2O2. Electrochimica Acta 53, 5509–5516. https://doi.org/10.1016/j.electacta.2008.03.009 Cheon et al., 2018 S. Cheon D.S. Jeong J.-K. Park W.M. Kim T.S. Lee H. Lee I. Kim Enhanced blue responses in nanostructured Si solar cells by shallow doping J. Phys. D Appl. Phys. 51 2018 125102 10.1088/1361-6463/aaaee4 Cheon, S., Jeong, D.S., Park, J.-K., Kim, W.M., Lee, T.S., Lee, H., Kim, I., 2018. Enhanced blue responses in nanostructured Si solar cells by shallow doping. Journal of Physics D: Applied Physics 51, 125102. Doi: 10.1088/1361-6463/aaaee4 Chen et al., 2019 K. Chen J. Zha F. Hu X. Ye S. Zou V. Vähänissi J.M. Pearce H. Savin X. Su MACE nano-texture process applicable for both single- and multi-crystalline diamond-wire sawn Si solar cells Sol. Energy Mater. Sol. Cells 191 2019 1 8 10.1016/j.solmat.2018.10.015 Chen, K., Zha, J., Hu, F., Ye, X., Zou, S., Vähänissi, V., Pearce, J.M., Savin, H., Su, X., 2019. MACE nano-texture process applicable for both single- and multi-crystalline diamond-wire sawn Si solar cells. Solar Energy Materials and Solar Cells 191, 1–8. Doi: 10.1016/j.solmat.2018.10.015 Christesen et al., 2012 J.D. Christesen X. Zhang C.W. Pinion T.A. Celano C.J. Flynn J.F. Cahoon Design principles for photovoltaic devices based on Si nanowires with axial or radial p–n junctions Nano Lett. 12 2012 6024 6029 10.1021/nl303610m Christesen, J.D., Zhang, X., Pinion, C.W., Celano, T.A., Flynn, C.J., Cahoon, J.F., 2012. Design Principles for Photovoltaic Devices Based on Si Nanowires with Axial or Radial p–n Junctions. Nano Letters 12, 6024–6029. Doi: 10.1021/nl303610m Cichoszewski et al., 2013 J. Cichoszewski M. Reuter F. Schwerdt J.H. Werner Role of catalyst concentration on metal assisted chemical etching of silicon Electrochim. Acta 109 2013 333 339 10.1016/j.electacta.2013.07.079 Cichoszewski, J., Reuter, M., Schwerdt, F., Werner, J.H., 2013. Role of catalyst concentration on metal assisted chemical etching of silicon. Electrochimica Acta 109, 333–339. Doi: 10.1016/j.electacta.2013.07.079 Dingemans et al., 2010 G. Dingemans W. Beyer M.C.M. Van De Sanden W.M.M. Kessels Hydrogen induced passivation of Si interfaces by Al2O3 films and SiO2/Al2O3 stacks Appl. Phys. Lett. 97 2010 2 5 10.1063/1.3497014 Dingemans, G., Beyer, W., Van De Sanden, M.C.M., Kessels, W.M.M., 2010. Hydrogen induced passivation of Si interfaces by Al2O3 films and SiO2/Al2O3 stacks. Applied Physics Letters 97, 2–5. Doi: 10.1063/1.3497014 Es et al., 2016 F. Es M. Kulakci R. Turan An alternative metal-assisted etching route for texturing silicon wafers for solar cell applications IEEE J. Photovoltaics 6 2016 440 446 10.1109/JPHOTOV.2016.2520207 Es, F., Kulakci, M., Turan, R., 2016. An Alternative Metal-Assisted Etching Route for Texturing Silicon Wafers for Solar Cell Applications. IEEE J. Photovoltaics 6, 440–446. Doi: 10.1109/JPHOTOV.2016.2520207 Geyer et al., 2012 N. Geyer B. Fuhrmann Z. Huang J. de Boor H.S. Leipner P. Werner Model for the mass transport during metal-assisted chemical etching with contiguous metal films as catalysts J. Phys. Chem. C 116 2012 13446 13451 10.1021/jp3034227 Geyer, N., Fuhrmann, B., Huang, Z., de Boor, J., Leipner, H.S., Werner, P., 2012. Model for the Mass Transport during Metal-Assisted Chemical Etching with Contiguous Metal Films As Catalysts. The Journal of Physical Chemistry C 116, 13446–13451. Doi: 10.1021/jp3034227 Hamel and Chibani, 2010 A. Hamel A. Chibani Characterization of texture surface for solar cells J. Appl. Sci. 10 2010 231 234 10.3923/jas.2010.231.234 Hamel, A., Chibani, A., 2010. Characterization of Texture Surface for Solar Cells. Journal of Applied Sciences 10, 231–234. Doi: 10.3923/jas.2010.231.234 Han et al., 2014 H. Han Z. Huang W. Lee Metal-assisted chemical etching of silicon and nanotechnology applications Nano Today 9 2014 271 304 10.1016/j.nantod.2014.04.013 Han, H., Huang, Z., Lee, W., 2014. Metal-assisted chemical etching of silicon and nanotechnology applications. Nano Today 9, 271–304. Doi: 10.1016/j.nantod.2014.04.013 Hoex et al., 2008 B. Hoex J.J.H. Gielis M.C.M. van de Sanden W.M.M. Kessels On the c-Si surface passivation mechanism by the negative-charge-dielectric Al2O3 J. Appl. Phys. 104 2008 113703 10.1063/1.3021091 Hoex, B., Gielis, J.J.H., van de Sanden, M.C.M., Kessels, W.M.M., 2008. On the c-Si surface passivation mechanism by the negative-charge-dielectric Al2O3. Journal of Applied Physics 104, 113703. Doi: 10.1063/1.3021091 Hsu et al., 2014 C.-H. Hsu J.-R. Wu Y.-T. Lu D.J. Flood A.R. Barron L.-C. Chen Fabrication and characteristics of black silicon for solar cell applications: an overview Mater. Sci. Semicond. Process. 25 2014 2 17 10.1016/j.mssp.2014.02.005 Hsu, C.-H., Wu, J.-R., Lu, Y.-T., Flood, D.J., Barron, A.R., Chen, L.-C., 2014. Fabrication and characteristics of black silicon for solar cell applications: An overview. Materials Science in Semiconductor Processing 25, 2–17. Doi: 10.1016/j.mssp.2014.02.005 Huang et al., 2011 Z. Huang N. Geyer P. Werner J. de Boor U. Gösele Metal-assisted chemical etching of silicon: a review Adv. Mater. 23 2011 285 308 10.1002/adma.201001784 Huang, Z., Geyer, N., Werner, P., Boor, J. de, Gösele, U., 2011. Metal-Assisted Chemical Etching of Silicon: A Review. Advanced Materials 23, 285–308. Doi: 10.1002/adma.201001784 Kern and Puotinen, 1970 W. Kern D.A. Puotinen Cleaning solutions based on hydrogen peroxide for use in silicon semiconductor technology RCA Rev. 31 1970 187 206 Kern W, Puotinen D.A., 1970. Cleaning solutions based on hydrogen peroxide for use in silicon semiconductor technology. RCA rev 31, 187–206. Koynov et al., 2006 S. Koynov M.S. Brandt M. Stutzmann Black nonreflecting silicon surfaces for solar cells Appl. Phys. Lett. 88 2006 203107 10.1063/1.2204573 Koynov, S., Brandt, M.S., Stutzmann, M., 2006. Black nonreflecting silicon surfaces for solar cells. Applied Physics Letters 88, 203107. Doi: 10.1063/1.2204573 Kroll et al., 2012 M. Kroll M. Otto T. Käsebier K. Füchsel R. Wehrspohn E.-B. Kley T. Pertsch Black silicon for solar cell applications Photon. Sol. Energy Syst. IV 8438 2012 843817 10.1117/12.922380 Kroll, M., Otto, M., Käsebier, T., Füchsel, K., Wehrspohn, R., Kley, E.-B., Pertsch, T., 2012. Black silicon for solar cell applications. Photonics for Solar Energy Systems IV 8438, 843817. Doi: 10.1117/12.922380 Lee et al., 2017 K. Lee S. Kim Y. Kim C. Park N. Balaji C. Han J. Yi Optimization of the junction profile through control of the doping heat profile for silicon solar cell applications J. Nanosci. Nanotechnol. 17 2017 3224 3228 10.1166/jnn.2017.14097 Lee, K., Kim, S., Kim, Y., Park, C., Balaji, N., Han, C., Yi, J., 2017. Optimization of the Junction Profile Through Control of the Doping Heat Profile for Silicon Solar Cell Applications. Journal of Nanoscience and Nanotechnology 17, 3224–3228. Doi: 10.1166/jnn.2017.14097 Li et al., 2016 M. Li Y. Li W. Liu L. Yue R. Li Y. Luo J.M. Mbengue Metal-assisted chemical etching for designable monocrystalline silicon nanostructure Mater. Res. Bull. 76 2016 436 449 10.1016/j.materresbull.2016.01.006 Li, M., Li, Y., Liu, W., Yue, L., Li, R., Luo, Y., Mbengue, J.M., 2016. Metal-assisted chemical etching for designable monocrystalline silicon nanostructure. Materials Research Bulletin 76, 436–449. Doi: 10.1016/j.materresbull.2016.01.006 Li and Bohn, 2000 X. Li P.W. Bohn Metal-assisted chemical etching in HF/H2O2 produces porous silicon Appl. Phys. Lett. 77 2000 2572 2574 10.1063/1.1319191 Li, X., Bohn, P.W., 2000. Metal-assisted chemical etching in HF/H2O2 produces porous silicon. Applied Physics Letters 77, 2572–2574. Doi: 10.1063/1.1319191 Liu et al., 2014 X. Liu P.R. Coxon M. Peters B. Hoex J.M. Cole D.J. Fray Black silicon: fabrication methods, properties and solar energy applications Energy Environ. Sci. 7 2014 3223 3263 10.1039/C4EE01152J Liu, X., Coxon, P.R., Peters, M., Hoex, B., Cole, J.M., Fray, D.J., 2014. Black silicon: fabrication methods, properties and solar energy applications. Energy Environ. Sci. 7, 3223–3263. Doi: 10.1039/C4EE01152J Lv et al., 2018 J. Lv T. Zhang P. Zhang Y. Zhao S. Li Review application of nanostructured black silicon Nanoscale Res. Lett. 13 2018 110 10.1186/s11671-018-2523-4 Lv, J., Zhang, T., Zhang, P., Zhao, Y., Li, S., 2018. Review Application of Nanostructured Black Silicon. Nanoscale Res Lett 13, 110. Doi: 10.1186/s11671-018-2523-4 Ma et al., 2018 S. Ma S. Liu Q. Xu J. Xu R. Lu Y. Liu Z. Zhong A theoretical study on the optical properties of black silicon AIP Adv. 8 2018 035010 10.1063/1.5018642 Ma, S., Liu, S., Xu, Q., Xu, J., Lu, R., Liu, Y., Zhong, Z., 2018. A theoretical study on the optical properties of black silicon. AIP Advances 8, 035010. Doi: 10.1063/1.5018642 Manea et al., 2005 E. Manea E. Budianu M. Purica D. Cristea I. Cernica R. Muller V. Moagar Poladian Optimization of front surface texturing processes for high-efficiency silicon solar cells Sol. Energy Mater. Sol. Cells 87 2005 423 431 10.1016/j.solmat.2004.06.013 Manea, E., Budianu, E., Purica, M., Cristea, D., Cernica, I., Muller, R., Moagar Poladian, V., 2005. Optimization of front surface texturing processes for high-efficiency silicon solar cells. Solar Energy Materials and Solar Cells 87, 423–431. Doi: 10.1016/j.solmat.2004.06.013 Naumann et al., 2012 V. Naumann M. Otto R.B. Wehrspohn C. Hagendorf Chemical and structural study of electrically passivating Al2O3/Si interfaces prepared by atomic layer deposition J. Vacuum Sci. Technol. A: Vacuum, Surf. Films 30 2012 04D106 10.1116/1.4704601 Naumann, V., Otto, M., Wehrspohn, R.B., Hagendorf, C., 2012. Chemical and structural study of electrically passivating Al2O3/Si interfaces prepared by atomic layer deposition. Journal of Vacuum Science & Technology A: Vacuum, Surfaces, and Films 30, 04D106. Doi: 10.1116/1.4704601 Noor et al., 2019 N.A.Md. Noor S.K. Mohamad S.S. Hamil M. Devarajan M.Z. Pakhuruddin Effects of etching time towards broadband absorption enhancement in black silicon fabricated by silver-assisted chemical etching Optik 176 2019 586 592 10.1016/j.ijleo.2018.09.096 Noor, N.A.Md., Mohamad, S.K., Hamil, S.S., Devarajan, M., Pakhuruddin, M.Z., 2019. Effects of etching time towards broadband absorption enhancement in black silicon fabricated by silver-assisted chemical etching. Optik 176, 586–592. Doi: 10.1016/j.ijleo.2018.09.096 Oh et al., 2012 J. Oh H.-C. Yuan H.M. Branz An 18.2%-efficient black-silicon solar cell achieved through control of carrier recombination in nanostructures Nat. Nanotechnol. 7 2012 743 748 10.1038/nnano.2012.166 Oh, J., Yuan, H.-C., Branz, H.M., 2012. An 18.2%-efficient black-silicon solar cell achieved through control of carrier recombination in nanostructures. Nature Nanotechnology 7, 743–748. Doi: 10.1038/nnano.2012.166 Pasanen et al., 2018 T.P. Pasanen H.S. Laine V. Vähänissi J. Schön H. Savin Black silicon significantly enhances phosphorus diffusion gettering Sci. Rep. 8 2018 1 6 10.1038/s41598-018-20494-y Pasanen, T.P., Laine, H.S., Vähänissi, V., Schön, J., Savin, H., 2018. Black silicon significantly enhances phosphorus diffusion gettering. Scientific Reports 8, 1–6. Doi: 10.1038/s41598-018-20494-y Pearce, 2002 J.M. Pearce Photovoltaics—a path to sustainable futures Futures 34 2002 663 674 10.1016/S0016-3287(02)00008-3 Pearce, J. M., 2002. Photovoltaics — a path to sustainable futures. Futures 34, 663–674. Doi: 10.1016/S0016-3287(02)00008-3 Rahman and Boden, 2017 T. Rahman S.A. Boden Optical modeling of black silicon for solar cells using effective index techniques IEEE J. Photovolt. 7 2017 1556 1562 10.1109/JPHOTOV.2017.2748900 Rahman, T., Boden, S.A., 2017. Optical Modeling of Black Silicon for Solar Cells Using Effective Index Techniques. IEEE J. Photovoltaics 7, 1556–1562. Doi: 10.1109/JPHOTOV.2017.2748900 Rahman et al., 2017 T. Rahman R.S. Bonilla A. Nawabjan P.R. Wilshaw S.A. Boden Passivation of all-angle black surfaces for silicon solar cells Sol. Energy Mater. Sol. Cells 160 2017 444 453 10.1016/j.solmat.2016.10.044 Rahman, T., Bonilla, R.S., Nawabjan, A., Wilshaw, P.R., Boden, S.A., 2017. Passivation of all-angle black surfaces for silicon solar cells. Solar Energy Materials and Solar Cells 160, 444–453. Doi: 10.1016/j.solmat.2016.10.044 Repo et al., 2013 P. Repo J. Benick V. Vähänissi J. Schön G. von Gastrow B. Steinhauser H. Savin N-type black silicon solar cells Energy Procedia 38 2013 866 871 10.1016/j.egypro.2013.07.358 Repo, P., Benick, J., Vähänissi, V., Schön, J., von Gastrow, G., Steinhauser, B., Savin, H. 2013. N-type Black Silicon Solar Cells. Energy Procedia 38, 866–871. Doi: 10.1016/j.egypro.2013.07.358 Sarnet et al., 2008 T. Sarnet M. Halbwax R. Torres P. Delaporte M. Sentis S. Martinuzzi S. Bastide Femtosecond laser for black silicon and photovoltaic cells Commer. Biomed. Appl. Ultrafast Lasers VIII 6881 2008 688119 10.1117/12.768516 Sarnet, T., Halbwax, M., Torres, R., Delaporte, P., Sentis, M., Martinuzzi, S., Bastide, S., 2008. Femtosecond laser for black silicon and photovoltaic cells. Commercial and Biomedical Applications of Ultrafast Lasers VIII 6881, 688119. Doi: 10.1117/12.768516 Shen et al., 2014 L. Shen Z. Liang C. Liu T. Long D. Wang Optimization of oxidation processes to improve crystalline silicon solar cell emitters AIP Adv. 4 2014 10.1063/1.4866981 Shen, L., Liang, Z., Liu, C., Long, T., Wang, D., 2014. Optimization of oxidation processes to improve crystalline silicon solar cell emitters. AIP Advances 4. Doi: 10.1063/1.4866981 Tan et al., 2019 Q. Tan F. Lu C. Xue W. Zhang L. Lin J. Xiong Nano-fabrication methods and novel applications of black silicon Sens. Actuators, A 295 2019 560 573 10.1016/j.sna.2019.04.044 Tan, Q., Lu, F., Xue, C., Zhang, W., Lin, L., Xiong, J., 2019. Nano-fabrication methods and novel applications of black silicon. Sensors and Actuators A: Physical 295, 560–573. Doi: 10.1016/j.sna.2019.04.044 Toor et al., 2016a F. Toor J.B. Miller L.M. Davidson W. Duan M.P. Jura J. Yim J. Forziati M.R. Black Metal assisted catalyzed etched (MACE) black Si: optics and device physics Nanoscale 8 2016 15448 15466 10.1039/C6NR04506E Toor, F., Miller, J.B., Davidson, L.M., Duan, W., Jura, M.P., Yim, J., Forziati, J., Black, M.R., 2016a. Metal assisted catalyzed etched (MACE) black Si: optics and device physics. Nanoscale 8, 15448–15466. Doi: 10.1039/C6NR04506E Toor et al., 2016b F. Toor J.B. Miller L.M. Davidson L. Nichols W. Duan M.P. Jura J. Yim J. Forziati M.R. Black Nanostructured silicon via metal assisted catalyzed etch (MACE): chemistry fundamentals and pattern engineering Nanotechnology 27 2016 412003 10.1088/0957-4484/27/41/412003 Toor, F., Miller, J.B., Davidson, L.M., Nichols, L., Duan, W., Jura, M.P., Yim, J., Forziati, J., Black, M.R., 2016b. Nanostructured silicon via metal assisted catalyzed etch (MACE): chemistry fundamentals and pattern engineering. Nanotechnology 27, 412003. Doi: 10.1088/0957-4484/27/41/412003 Vinzons et al., 2017 L.U. Vinzons L. Shu S. Yip C.-Y. Wong L.L.H. Chan J.C. Ho Unraveling the morphological evolution and etching kinetics of porous silicon nanowires during metal-assisted chemical etching Nanoscale Res. Lett. 12 2017 385 10.1186/s11671-017-2156-z Vinzons, L.U., Shu, L., Yip, S., Wong, C.-Y., Chan, L.L.H., Ho, J.C., 2017. Unraveling the Morphological Evolution and Etching Kinetics of Porous Silicon Nanowires During Metal-Assisted Chemical Etching. Nanoscale Res Lett 12, 385. Doi: 10.1186/s11671-017-2156-z Xi et al., 2014 Z. Xi D. Yang W. Dan C. Jun X. Li D. Que Texturization of cast multicrystalline silicon for solar cells Semicond. Sci. Technol. 19 2014 485 489 10.1088/0268-1242/19/3/035 Xi, Z., Yang, D., Dan, W., Jun, C., Li, X., Que, D., 2014. Texturization of cast multicrystalline silicon for solar cells. Semiconductor Science and Technology 19, 485–489. Doi: Doi: 10.1088/0268-1242/19/3/035 Xi et al., 2003 Zhenqiang Xi D. Yang D. Que Texturization of monocrystalline silicon with tribasic sodium phosphate Sol. Energy Mater. Sol. Cells 77 2003 255 263 10.1016/S0927-0248(02)00347-1 Xi, Zhenqiang, Yang, D., Que, D., 2003. Texturization of monocrystalline silicon with tribasic sodium phosphate. Solar Energy Materials and Solar Cells 77, 255–263. Doi: 10.1016/S0927-0248(02)00347-1 Yae et al., 2003 S. Yae Y. Kawamoto H. Tanaka N. Fukumuro H. Matsuda Formation of porous silicon by metal particle enhanced chemical etching in HF solution and its application for efficient solar cells Electrochem. Commun. 5 2003 632 636 10.1016/S1388-2481(03)00146-2 Yae, S., Kawamoto, Y., Tanaka, H., Fukumuro, N., Matsuda, H., 2003. Formation of porous silicon by metal particle enhanced chemical etching in HF solution and its application for efficient solar cells. Electrochemistry Communications 5, 632–636. Doi: 10.1016/S1388-2481(03)00146-2", "scopus-id": "85078778278", "coredata": {"eid": "1-s2.0-S1878535220300083", "dc:description": "In this study, nanostructured pyramidal black silicon is prepared by metal assisted chemical etching method, in which the silver nitrate (AgNO3) is used as the metal catalyst. Effects of the concentration of AgNO3 on passivation and optical properties of the black silicon are investigated. The experimental results show that at the AgNO3 concentration of 0.03 M, the nanostructure length is about 300 nm, and the reflectance of the black silicon with a stack of silicon nitride (SiNx) and aluminum oxide (Al2O3) is 0.8%, which is comparable to that of the conventional black silicon with micrometer-long nanowires. In addition, an acceptably low surface recombination rate of 42 cm/s can be obtained. Plasma chemical vapor deposited SiNx is deposited well on the top of nanostructures of black silicon, but shows poor coverage at the bottom region. Spatial atomic layer deposited Al2O3 can conformally cover the nanostructures with high passivation quality. Simulation result indicates an improvement of 5.5% of conversion efficiency for the nanostructured pyramidal black silicon solar cell compared to industrial silicon solar cell. The short nanostructured pyramidal surface with low reflectance and high passivation is expected to be helpful for black silicon technology applied to photovoltaic applications.", "openArchiveArticle": "false", "prism:coverDate": "2020-11-30", "openaccessUserLicense": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "prism:aggregationType": "Journal", "prism:url": "https://api.elsevier.com/content/article/pii/S1878535220300083", "dc:creator": [{"@_fa": "true", "$": "Hsu, Chia-Hsun"}, {"@_fa": "true", "$": "Liu, Shih-Mao"}, {"@_fa": "true", "$": "Wu, Wan-Yu"}, {"@_fa": "true", "$": "Cho, Yun-Shao"}, {"@_fa": "true", "$": "Huang, Pao-Hsun"}, {"@_fa": "true", "$": "Huang, Chien-Jung"}, {"@_fa": "true", "$": "Lien, Shui-Yang"}, {"@_fa": "true", "$": "Zhu, Wen-Zhang"}], "link": [{"@_fa": "true", "@rel": "self", "@href": "https://api.elsevier.com/content/article/pii/S1878535220300083"}, {"@_fa": "true", "@rel": "scidir", "@href": "https://www.sciencedirect.com/science/article/pii/S1878535220300083"}], "dc:format": "application/json", "openaccessType": "Full", "pii": "S1878-5352(20)30008-3", "prism:volume": "13", "prism:publisher": "The Author(s). Published by Elsevier B.V. on behalf of King Saud University.", "dc:title": "Nanostructured pyramidal black silicon with ultra-low reflectance and high passivation", "prism:copyright": "© 2020 The Author(s). Published by Elsevier B.V. on behalf of King Saud University.", "openaccess": "1", "prism:issn": "18785352", "prism:issueIdentifier": "11", "dcterms:subject": [{"@_fa": "true", "$": "Black silicon"}, {"@_fa": "true", "$": "Passivation"}, {"@_fa": "true", "$": "Reflectance"}, {"@_fa": "true", "$": "Solar cell"}, {"@_fa": "true", "$": "Metal assisted chemical etching"}], "openaccessArticle": "true", "prism:publicationName": "Arabian Journal of Chemistry", "prism:number": "11", "openaccessSponsorType": "Author", "prism:pageRange": "8239-8247", "prism:endingPage": "8247", "pubType": "fla", "prism:coverDisplayDate": "November 2020", "prism:doi": "10.1016/j.arabjc.2020.01.004", "prism:startingPage": "8239", "dc:identifier": "doi:10.1016/j.arabjc.2020.01.004", "openaccessSponsorName": null}, "objects": {"object": [{"@category": "standard", "@height": "148", "@width": "542", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1878535220300083-gr1.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "16016", "@ref": "gr1", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "590", "@width": "543", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1878535220300083-gr2.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "68861", "@ref": "gr2", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "602", "@width": "542", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1878535220300083-gr3.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "87552", "@ref": "gr3", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "835", "@width": "347", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1878535220300083-gr4.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "62628", "@ref": "gr4", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "918", "@width": "371", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1878535220300083-gr5.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "72364", "@ref": "gr5", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "578", "@width": "369", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1878535220300083-gr6.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "67515", "@ref": "gr6", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "892", "@width": "289", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1878535220300083-gr7.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "97914", "@ref": "gr7", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "60", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1878535220300083-gr1.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "4081", "@ref": "gr1", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "164", "@width": "151", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1878535220300083-gr2.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "14104", "@ref": "gr2", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "163", "@width": "147", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1878535220300083-gr3.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "13942", "@ref": "gr3", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "164", "@width": "68", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1878535220300083-gr4.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "4263", "@ref": "gr4", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "163", "@width": "66", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1878535220300083-gr5.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "4058", "@ref": "gr5", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "163", "@width": "104", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1878535220300083-gr6.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "10299", "@ref": "gr6", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "164", "@width": "53", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1878535220300083-gr7.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "6636", "@ref": "gr7", "@mimetype": "image/gif"}, {"@category": "high", "@height": "655", "@width": "2402", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1878535220300083-gr1_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "100753", "@ref": "gr1", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "2611", "@width": "2403", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1878535220300083-gr2_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "460043", "@ref": "gr2", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "2668", "@width": "2402", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1878535220300083-gr3_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "566208", "@ref": "gr3", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "3696", "@width": "1536", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1878535220300083-gr4_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "464121", "@ref": "gr4", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "4067", "@width": "1644", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1878535220300083-gr5_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "472452", "@ref": "gr5", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "2564", "@width": "1636", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1878535220300083-gr6_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "618071", "@ref": "gr6", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "3952", "@width": "1281", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1878535220300083-gr7_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "1014751", "@ref": "gr7", "@mimetype": "image/jpeg"}, {"@category": "standard", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1878535220300083-am.pdf?httpAccept=%2A%2F%2A", "@multimediatype": "Acrobat PDF file", "@type": "AAM-PDF", "@size": "5141260", "@ref": "am", "@mimetype": "application/pdf"}]}, "link": {"@rel": "abstract", "@href": "https://api.elsevier.com/content/abstract/scopus_id/85078778278"}}