{"scopus-eid": "2-s2.0-84867805282", "originalText": "serial JL 271495 291210 291731 291732 291746 291809 291864 291865 291892 291893 31 Solar Energy Materials and Solar Cells SOLARENERGYMATERIALSSOLARCELLS 2012-10-25 2012-10-25 2012-11-26T19:37:28 1-s2.0-S0927024812004679 S0927-0248(12)00467-9 S0927024812004679 10.1016/j.solmat.2012.10.001 S300 S300.1 FULL-TEXT 1-s2.0-S0927024812X00114 2015-05-15T03:20:14.179583-04:00 0 0 20130101 20130131 2013 2012-10-25T00:00:00Z articleinfo crossmark dco dateupdated tomb dateloaded datesearch indexeddate volumelist yearnav absattachment articletitlenorm authfirstinitialnorm authfirstsurnamenorm cid cids confeditor contenttype copyright dateloadedtxt docsubtype doctype doi eid ewtransactionid hubeid issn issnnorm itemstage itemtransactionid itemweight openaccess openarchive pg pgfirst pglast pii piinorm pubdateend pubdatestart pubdatetxt pubyr sectiontitle sortorder srctitle srctitlenorm srctype subheadings suppl vol volfirst volissue webpdf webpdfpagecount figure table body acknowledge affil articletitle auth authfirstini authfull authkeywords authlast primabst ref specialabst alllist content subj ssids 0927-0248 09270248 false 108 108 C Volume 108 30 200 204 200 204 201301 January 2013 2013-01-01 2013-01-31 2013 Selected publications from the 22nd Space Photovoltaic Research and Technology (SPRAT) Conference Jeremiah S. McNatt Michael H.-C. Jin Dave A. Scheiman Regular Articles article fla Copyright © 2012 Elsevier B.V. All rights reserved. INFLUENCETEXTURINGSTRUCTUREPROPERTIESBLACKSILICONSOLARCELL ZHONG S 1 Introduction 2 Experimental 3 Results and discussion 4 Conclusion Acknowledgment References MA 2006 171907 L PARM 2002 97 105 I XI 2004 2101 2107 Z GONZALEZDIAZ 2009 295 298 B YUAN 2009 123501 H TORRES 2010 621 625 R KOYNOV 2007 53 55 S YOO 2009 333 337 J NOSTISCHKA 2003 227 237 W ZAIDI 2001 1200 1206 S LEE 2011 66 68 K XIA 2011 1574 1578 Y XIA 2012 589 592 Y KOYNOV 2006 203107 S HADOBAS 2000 161 164 K TOOR 2011 103501 F HONG 2009 898 904 K SCHUBERT 2006 3399 3406 G ZHONGX2013X200 ZHONGX2013X200X204 ZHONGX2013X200XS ZHONGX2013X200X204XS item S0927-0248(12)00467-9 S0927024812004679 1-s2.0-S0927024812004679 10.1016/j.solmat.2012.10.001 271495 2012-11-26T17:33:29.736957-05:00 2013-01-01 2013-01-31 1-s2.0-S0927024812004679-main.pdf https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024812004679/MAIN/application/pdf/fbb3564300cf1a533b6602fe25a56d82/main.pdf https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024812004679/MAIN/application/pdf/fbb3564300cf1a533b6602fe25a56d82/main.pdf main.pdf pdf true 1017481 MAIN 5 1-s2.0-S0927024812004679-main_1.png https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024812004679/PREVIEW/image/png/f793dcc40cbcef1ddbe35cb3c2526feb/main_1.png https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024812004679/PREVIEW/image/png/f793dcc40cbcef1ddbe35cb3c2526feb/main_1.png main_1.png png 60934 849 656 IMAGE-WEB-PDF 1 1-s2.0-S0927024812004679-fx1.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024812004679/fx1/DOWNSAMPLED/image/jpeg/c38c8aa71ccf33213293793d19f3a237/fx1.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024812004679/fx1/DOWNSAMPLED/image/jpeg/c38c8aa71ccf33213293793d19f3a237/fx1.jpg fx1 true fx1.jpg jpg 13900 200 124 IMAGE-DOWNSAMPLED 1-s2.0-S0927024812004679-fx1.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024812004679/fx1/THUMBNAIL/image/gif/d8e750d1214468f3d5fbf6a180cd9e5f/fx1.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024812004679/fx1/THUMBNAIL/image/gif/d8e750d1214468f3d5fbf6a180cd9e5f/fx1.sml fx1 true fx1.sml sml 4263 163 101 IMAGE-THUMBNAIL 1-s2.0-S0927024812004679-gr1.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024812004679/gr1/DOWNSAMPLED/image/jpeg/526209d541e601e1249d124a4d60721c/gr1.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024812004679/gr1/DOWNSAMPLED/image/jpeg/526209d541e601e1249d124a4d60721c/gr1.jpg gr1 gr1.jpg jpg 20963 121 507 IMAGE-DOWNSAMPLED 1-s2.0-S0927024812004679-gr1.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024812004679/gr1/THUMBNAIL/image/gif/72343790e52795385895339a144685c7/gr1.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024812004679/gr1/THUMBNAIL/image/gif/72343790e52795385895339a144685c7/gr1.sml gr1 gr1.sml sml 5992 52 219 IMAGE-THUMBNAIL 1-s2.0-S0927024812004679-gr2.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024812004679/gr2/DOWNSAMPLED/image/jpeg/d617cd81b05c3eb3fc412f41ff7e9d7a/gr2.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024812004679/gr2/DOWNSAMPLED/image/jpeg/d617cd81b05c3eb3fc412f41ff7e9d7a/gr2.jpg gr2 gr2.jpg jpg 98055 473 661 IMAGE-DOWNSAMPLED 1-s2.0-S0927024812004679-gr2.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024812004679/gr2/THUMBNAIL/image/gif/c90b63c95086b9449cd26246eb6ab589/gr2.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024812004679/gr2/THUMBNAIL/image/gif/c90b63c95086b9449cd26246eb6ab589/gr2.sml gr2 gr2.sml sml 11822 157 219 IMAGE-THUMBNAIL 1-s2.0-S0927024812004679-gr3.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024812004679/gr3/DOWNSAMPLED/image/jpeg/cbba77af35c1793bc80beeb6992d54e8/gr3.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024812004679/gr3/DOWNSAMPLED/image/jpeg/cbba77af35c1793bc80beeb6992d54e8/gr3.jpg gr3 gr3.jpg jpg 55256 240 658 IMAGE-DOWNSAMPLED 1-s2.0-S0927024812004679-gr3.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024812004679/gr3/THUMBNAIL/image/gif/a986c99daa69b9a541fb5c8cb608890a/gr3.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024812004679/gr3/THUMBNAIL/image/gif/a986c99daa69b9a541fb5c8cb608890a/gr3.sml gr3 gr3.sml sml 4995 80 219 IMAGE-THUMBNAIL 1-s2.0-S0927024812004679-gr4.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024812004679/gr4/DOWNSAMPLED/image/jpeg/b1217b7415ea4cfc78a29f8c76efa737/gr4.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024812004679/gr4/DOWNSAMPLED/image/jpeg/b1217b7415ea4cfc78a29f8c76efa737/gr4.jpg gr4 gr4.jpg jpg 26253 259 378 IMAGE-DOWNSAMPLED 1-s2.0-S0927024812004679-gr4.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024812004679/gr4/THUMBNAIL/image/gif/f533944badb526b54822be5977b3682f/gr4.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024812004679/gr4/THUMBNAIL/image/gif/f533944badb526b54822be5977b3682f/gr4.sml gr4 gr4.sml sml 4108 150 219 IMAGE-THUMBNAIL 1-s2.0-S0927024812004679-gr5.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024812004679/gr5/DOWNSAMPLED/image/jpeg/81332f9eba6fb3b7362f23e260297274/gr5.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024812004679/gr5/DOWNSAMPLED/image/jpeg/81332f9eba6fb3b7362f23e260297274/gr5.jpg gr5 gr5.jpg jpg 42934 320 387 IMAGE-DOWNSAMPLED 1-s2.0-S0927024812004679-gr5.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024812004679/gr5/THUMBNAIL/image/gif/e35bda3be924986833718fa23931025f/gr5.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024812004679/gr5/THUMBNAIL/image/gif/e35bda3be924986833718fa23931025f/gr5.sml gr5 gr5.sml sml 6394 164 198 IMAGE-THUMBNAIL 1-s2.0-S0927024812004679-gr6.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024812004679/gr6/DOWNSAMPLED/image/jpeg/651db3fd34a8a67cc47f04471e7a92d7/gr6.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024812004679/gr6/DOWNSAMPLED/image/jpeg/651db3fd34a8a67cc47f04471e7a92d7/gr6.jpg gr6 gr6.jpg jpg 35574 322 378 IMAGE-DOWNSAMPLED 1-s2.0-S0927024812004679-gr6.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024812004679/gr6/THUMBNAIL/image/gif/c1f6e40c5f491f9fbb7df2a54eef95b2/gr6.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024812004679/gr6/THUMBNAIL/image/gif/c1f6e40c5f491f9fbb7df2a54eef95b2/gr6.sml gr6 gr6.sml sml 5131 163 192 IMAGE-THUMBNAIL 1-s2.0-S0927024812004679-gr7.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024812004679/gr7/DOWNSAMPLED/image/jpeg/42f1a45b2181d7632eb3b477975c4345/gr7.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024812004679/gr7/DOWNSAMPLED/image/jpeg/42f1a45b2181d7632eb3b477975c4345/gr7.jpg gr7 gr7.jpg jpg 52315 412 546 IMAGE-DOWNSAMPLED 1-s2.0-S0927024812004679-gr7.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024812004679/gr7/THUMBNAIL/image/gif/9b668505a864d0f4e2029d08b25d226c/gr7.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024812004679/gr7/THUMBNAIL/image/gif/9b668505a864d0f4e2029d08b25d226c/gr7.sml gr7 gr7.sml sml 9571 164 217 IMAGE-THUMBNAIL SOLMAT 6397 S0927-0248(12)00467-9 10.1016/j.solmat.2012.10.001 Elsevier B.V. Fig. 1 Photographs of the polished silicon wafer and the black silicon wafers with the texturing conditions of C1, C3 and C5. Fig. 2 AFM of the microstructures of the black silicon wafers with different texturing conditions. It typically shows that the black silicon surfaces are covered with dense nanohillocks, and the heights of the nanohillocks are 150nm, 300nm and 600nm for the surfaces of the C1 textured, C3 textured and C5 textured, respectively. Fig. 3 (a) The reflectance of the wafers textured by different conditions. (b) The reflectance of the wafers coated with SiNx layer. Fig. 4 The sheet resistance and surface area of the wafers textured by different conditions. Fig. 5 The internal quantum efficiency of the solar cells textured by different conditions. Fig. 6 Illuminated I–V characteristics of the C3 textured solar cell and acid textured solar cell. Fig. 7 Cross-sectional SEM micrographs of Ag–Si contact of the solar cells. (a) C3 textured, (b) C3 textured with bigger magnification, (c) the bottom of pit with acid textured, (d) the top of pit with acid textured. Table 1 Conditions of fabricating black silicon wafers. Conditions The ratio of SF6 to O2 Voltage pulses (V) Etching time (min) Radio frequency power (w) C1 2.5/1 −500 5 900 C2 3/1 −500 3 900 C3 3/1 −500 5 900 C4 3/1 −1000 5 900 C5 3/1 −1500 5 900 Table 2 The performance of the black silicon solar cells with different texturing conditions. U oc is open circuit voltage, J sc is short circuit current density, R sh, J rev represent shunt resistance and shunt current density, respectively, FF means fill factor and E ff means the photoelectric conversion efficiency of the solar cell. Condition U oc (V) J sc (mA/cm2) R sh (Ω) J rev (mA/cm2) FF (%) E ff (%) C1 0.610 33.5 28 0.957 76.80 15.70 C2 0.615 33.9 27 0.888 75.71 15.78 C3 0.614 34.0 22 0.966 76.44 15.99 C4 0.605 33.2 16 1.529 77.07 15.49 C5 0.611 33.2 14 1.902 77.44 15.71 Influence of the texturing structure on the properties of black silicon solar cell Sihua Zhong a b Bangwu Liu a ⁎ Yang Xia a Jinhu Liu a Jie Liu a Zenan Shen a Zheng Xu b Chaobo Li a a Key Laboratory of Microelectronics Devices & Integrated Technology, Institute of Microelectronics, Chinese Academy of Sciences, Beijing 100029, China b Institute of Solar Energy in School of Science, Beijing Jiaotong University, Beijing 100044, China ⁎ Corresponding author. Tel.: +86 10 82995758; fax: +86 10 82995652. An optimized textured structure is a key for high efficiency multi-crystalline silicon solar cell. In this work, black silicon wafers with various structures have been successfully produced by plasma immersion ion implantation. The surface morphology, reflectance and internal quantum efficiency have been investigated by atomic force microscope, spectrophotometer and quantum efficiency measurement system, respectively. Results show that nanohillocks with average height of 150–600nm have been generated on black silicon surfaces by different texturing conditions, and the reflectance over the wavelength from 300nm to 1100nm decreases with increasing the height of nanohillocks, whereas the internal quantum efficiency worsens. The solar cell based on the optimized nanohillocks height of 300nm yeilds efficiency of 15.99% with short circuit current of 34.0mA/cm2. Graphical abstract Highlights ► Black silicon wafers with various structures have been successfully produced. ► The microstructures and reflectance of the black silicon wafers have been investigated. ► Sheet resistance and quantum efficiency varying with the height of nanohillocks have been studied. ► Black silicon solar cell with an optimized microstructure yield efficiency of 15.99%. ► Ag–Si contact need to be improved. Keywords Black silicon Texturing structure Solar cell Contact resistance Conversion efficiency 1 Introduction As it is known, there can be as high as 40% reflectance on the surface of damage removed silicon due to abrupt change of refractive index on the interface between silicon and air [1]. Reducing surface reflectance to enhance light absorption is very important to improve the conversion efficiency of crystalline silicon solar cell. Generally, depositing anti-reflection coating (ARC) with intermediate refractive index (for example, SiNx [2]) is very effective to reduce surface reflectance. However, surface texturing is a more permanent and effective solution to decrease reflections. Anisotropic etching of monocrystalline silicon in alkaline solution is effective to reduce surface reflectance and widely used in industry [3]. But it doesn't work well for multi-crystalline silicon (mc-Si) wafer due to randomly orientated crystallites. Instead, isotropic etching in acid solution is widely used in industry [4]. The reflectance of acid etched mc-Si is still as high as 25%, leading to a big light reflectance loss. To further reduce surface reflectance of mc-Si solar cell, various texturing methods have been tried and investigated. One of the most promising methods to reduce reflection is producing nanostructured surface which is often termed as “black silicon” [5]. Torres et al. have produced black silicon by femtosecond laser and demonstrated that the electrical performances were improved compared to the solar cell with non-textured surface [6]. The black multi-crystalline silicon can also be fabricated by local metal-catalyzed wet-chemical etching, and the efficiencies of the black cells can be estimated to be in the 12–14% range [7]. Reactive ion etching (RIE) is widely used to form black silicon [5,8,9]. Zaidi et al. [10] have demonstrated that the RIE textured solar cell by applying additional ion damage removal treatments can show a better short circuit current density in comparison with the solar cell by wet-chemical textured surface. And Lee showed that the conversion efficiency of multi-crystalline silicon solar cell produced by damage-free reactive ion etching can reach as high as 16.32% [11]. In our previous work [12], the black silicon has been successfully produced by plasma immersion ion implantation (PIII). The microstructure and reflectance of the black silicon have been investigated. In the present study, the black multi-crystalline silicon has been fabricated using plasma immersion ion implantation (PIII). The influence of texturing structure on the performance of black silicon solar cell will be studied in detail. 2 Experimental In this work, p-type multi-crystalline silicon wafers obtained from the same ingot with thickness of 200±20μm, area of 156mm×156mm, and resistivity of 1–3Ωcm were employed. First, the damage on the surface induced by wire-cutting was removed by etching in 10% NaOH solution at 80°C. After that, the black silicon wafers fabricated by plasma immersion ion implantation process with different conditions as shown in Table 1. Then all the black silicon wafers were subjected to acid washing in 2% HCl and followed in 10% HF to remove the contamination and oxides. The wafers were phosphorus doped using phosphorous oxychloride (POCl3) as the dopant source at the temperature of 825°C. Afterward all the wafers were subjected to edge etching and the removal of phosphosilicate glass (PSG) layer with diluted HF (10% by volume). Silicon-nitride layer with thickness of 80nm and refractive index of 2.05 was grown by plasma enhanced chemical vapor deposition (PECVD) process. Finally, the front and back metallization of all the wafers were carried out by screen-printing technique and followed by baking and co-firing in a conveyer belt furnace. The fabrication process of acid textured solar cell was identical with that of black silicon solar cells. The microstructures as well as surface areas of the black silicon wafers were investigated by atomic force microscope (AFM). The surface reflectance was examined by a UV–VIS–NIR spectrophotometer (Varian Cary 5000) equipped with an integrating sphere detector in the wavelength from 300nm to1100nm. The sheet resistance was studied by Four-probe sheet resistance measurement with mapping mode. Internal quantum efficiency (IQE) was measured on a Solar Cell Scan 100 quantum efficiency measurement system. The performance of the solar cells was determined by the JR-1250 Solar Cell I. V. Tester and Sorter under one sun global solar spectrum of Air Mass (AM) 1.5 at 25°C. The cross-sectional micrographs of Ag–Si contact of the solar cells were investigated with a JEOL JSM-7001F field emission scanning electron microscope (FESEM). 3 Results and discussion The photographs of the polished wafer and textured wafers ( C1, C3, C5) are exhibited in Fig. 1. It can be demonstrated that we have successfully produced the black silicon wafers with homogeneous surfaces, and the wafers become more and more black varying with the texturing conditions from C1 to C5. The microstructures of the black silicons have been studied by atomic force microscope (AFM). The surface of the black silicon wafer is coverd with dense and random nanohillocks with the height of 150nm, 220nm, 300nm, 450nm and 600nm for C1, C2, C3, C4 and C5 textured, respectively. Moreover, the lateral size of the C5 textured nanohillocks is enlarged compared to that of C1 textured nanohillocks. Fig. 2 typically shows the micrographs of the black silicon surfaces with texturing conditions of C1, C3, and C5. The microstructures of the black silicon wafers are the result of the competition between SF+ x (x≤5) and F+ ions etching effect and SixOyFz mask effect [12,13]. The competition between etching effect and mask effect is changed varying with the texturing conditions from C1 to C5, resulting in different microstructures. Fig. 3(a) shows the reflectance of the black silicon wafers as-textured by C1, C2, C3, C4 and C5. The reflectance of acid textured wafer is also plotted for comparison. It can be seen that the reflectance of the black silicon wafers decreases varying with the texturing conditions from C1 to C5. However, the black silicon wafer textured by C1 still shows a strong decrease in the reflectance over the wavelength from 300nm to 1000nm compared to that of acid textured silicon wafer, which is the result of the unique microstructure of the black silicon. In general, the anti-reflection behavior of black silicon can be explained by effective medium approximation [1,14]. In the work, due to the lateral dimension of our black silicon approach 100nm, the decreased reflectance should be explained by the combination effect of multiple reflections and diffraction. It is obvious that the nanohillocks structure is beneficial to increase the reflected times of the incident light between the surface structures. Moreover, the diffraction effect is expected to occur when the dimension of the nanohillocks is comparable to the wavelength of the incident light, which makes the zero-order reflection weaken [15]. The decrease in the reflectance of the black silicon varying with the texturing conditions from C1 to C5 is attributed to that with increasing the height of the nanohillocks, the multiple reflections and diffraction effect become more obvious. To understand the anti-reflection of the solar cells, the reflectance of the wafers coated with silicon-nitride was also measured, shown in Fig. 3(b). Obviously, after the deposition of SiNx layer, all the wafers textured by different conditions show a great decrease in reflectance, for instance, the reflectance of the wafer textured by C3 drops from 12.22% to 3.87% by application of the SiNx coating. Specially, in the range of wavelength from 600nm to 1100nm, they exhibit almost the same reflectance - approximately 2%. Therefore, we can conclude that the anti-reflection of the solar cells originates from nanostructure and SiN layer. Fig. 4 exhibits the area of the textured surface (surface area) and the sheet resistance after diffusion. The surface area is extracted from AFM for an observation area of 5×5μm2. With increasing the height of the nanohillocks, the surface area of the black silicon wafer increases, which contribute to easier P diffusion into the wafer, leading to a decreased sheet resistance. The internal quantum efficiency of the black silicon solar cells is presented in Fig. 5. It can be seen that the IQE over the short wavelength worsens when changing the texturing conditions from C1 to C5. This can be attributed to the following: (i) the enlarged surface. Generally, the silicon surface has plenty of dangling bonds and traps that will play as effective recombination centers. The surface of black silicon enlarges varying with texturing conditions from C1 to C5. (ii) Increased Auger recombination. The sheet resistance declines with the increase of the height of nanohillocks, indicating that the doping concentration increases, while heavier doping concentration leads to higher Auger recombination [5]. (iii) Light scattering effect. The incident light can be scattered due to the nanostructure morphology, which will increase the interacting length of the incident light and silicon surface. Besides, increased damage to the surface plays a role in decreasing the IQE as well. In the long wavelength, the internal quantum efficiency also shows a decrease from C1 to C5, which is different from the result of F. Toor [16]. It may be attributed to the fabrication method of black silicon. Table 2 lists the performance of the black silicon solar cell textured by C1, C2, C3, C4 and C5. Dramatically, the C3 textured solar cell, which has neither the lowest reflectance nor the best internal quantum efficiency, obtains the highest short circuit current density and conversion efficiency with the value of 34.0mA/cm2 and 15.99%, respectively. The optimal texturing condition is ascribed to the competition between reflectance reduction and IQE loss [5]. From Table 2, it can also be seen that the shunt current density increases and the shunt resistance decreases varying with the texturing conditions from C1 to C5. This originates from the enlarged surface and higher doping concentration, which cause larger surface recombination. It may also result from the increased uneven p–n junction with increasing the height of the nanostructure. From Fig. 6, it can be seen that there are little differences of short circuit current and open circuit voltage between C3 textured black silicon solar cell and acid textured silicon solar cell. However, the photoelectric conversion efficiency of the C3 textured solar cell is only 15.99% and that of acid textured solar cell is 16.59%, which is due to the difference of fill factor. As it is known, the fill factor is mainly affected by series resistance and shunt resistance. The series resistance of the C3 textured solar cell is almost twice than that of acid textured solar cell, resulting in inferior fill factor. The reason for the higher series resistance can be illustrated by Fig. 7. It is known that the contact resistance between Si and Ag is an important component of series resistance. As it can be seen in Fig. 7(a) and (b) that there is N-rich layer remaining in the valley-bottom of the nanostructures of the black silicon surface, and Ag particles precipitated on the N-rich layer. The pores indicated in Fig. 7 are caused by gas which is generated by the reaction between Ag2O and SiNx [17]. It is believed that the current can be transported from the silicon into the Ag crystallites via a nearly ideal metal–semiconductor contact, which will result in low contact resistivity [18]. Therefore, the remaining N-rich layer between Si and Ag crystallites can lead to bad current transmission with high contact resistance. However, from Fig. 7(c) and (d), no remaining N-rich layer can be observed no matter in the bottom of pit or the top of pit textured by acid solution. A fine distribution of Ag crystallites is observed on the Si wafer, which results in low contact resistance. 4 Conclusion The black multi-crystalline silicon has been successfully produced by plasma immersion ion implantation. The microstructures of black silicon exhibit different heights of nanohillocks with different texturing conditions. The reflectance and the sheet resistance of the black silicon decrease with increasing the height of nanohillocks. However, the internal quantum efficiency becomes worse due to increased surface recombination. The black silicon solar cell with the height of nanohillocks of 300nm exhibits the highest conversion efficiency with the value of 15.99%. Its open circuit voltage and short circuit current are nearly the same with that of acid textured solar cell. However, its fill factor is much worse compared to that of acid textured solar cell, which originates from worse Ag–Si contact in the bottom of nanohillocks. The conversion efficiency of black silicon solar cell may be further improved by optimizing the surface passivation process and better Ag–Si contact. Acknowledgment This work was supported by the National Natural Science Foundation of China (Grant No. 61106060), the Knowledge Innovation Program of the Chinese Academy of Sciences (Grant No. Y2YF028001) and the National High-tech R&D Program of China (Grant No. 2012AA052401). References [1] L.L. Ma Y.C. Zhou N. Jiang Wide-band black silicon based on porous silicon Applied Physics Letters 88 2006 171907 [2] I.O. Parm K. Kim D.G. Lim High-density inductively coupled plasma chemical vapor deposition of silicon nitride for solar cell application Solar Energy Materials and Solar Cells 74 2002 97 105 [3] Z. Xi D. Yang W. Dan Investigation of texturization for monocrystalline silicon solar cells with different kinds of alkaline Renewable Energy 29 2004 2101 2107 [4] B. Gonzalez-Diaz R. Guerrero-Lemus B. Diaz-Herrera Optimization of roughness, reflectance and photoluminescence for acid textured mc-Si solar cells etched at different HF/HNO3 concentration Materials Science and Engineering B 159–160 2009 295 298 [5] H.C. Yuan V.E. Yost M.R. Page Efficient black silicon solar cell with a density-graded nanoporous surface: optical properties, performance limitations, and design rules Applied Physics Letters 95 2009 123501 [6] R. Torres V. Vervisch M. Halbwax Femtosecond laser texturization for improvement of photovoltaic cells: black silicon Journal of Optoelectronics and Advanced Materials 12 2010 621 625 [7] S. Koynov M.S. Brandt M. Stutzmann Black multi-crystalline silicon solar cells Physica Status Solidi RRL: Rapid Research Letters 1 2007 53 55 [8] J. Yoo G. Yu J. Yi Black surface structures for crystalline silicon solar cells Materials Science and Engineering, B 159–160 2009 333 337 [9] W.A. Nostischka O. Voigt P. Manshanden Texturisation of multicrystalline silicon solar cells by RIE and plasma etching Solar Energy Materials and Solar Cells 80 2003 227 237 [10] S. Zaidi D. Ruby J. Gee Characterization of random reactive ion etched–textured silicon solar cells IEEE Transactions on Electron Devices 48 6 2001 1200 1206 [11] K. Lee M. Ha J. Kim Damage-free reactive ion etch for high-efficiency large-area multi-crystalline silicon solar cells Solar Energy Materials and Solar Cells 95 2011 66 68 [12] Y. Xia B. Liu J. Liu A novel method to produce black silicon for solar cells Solar Energy 85 2011 1574 1578 [13] Y. Xia B. Liu S. Zhong B. Chao X-ray photoelectron spectroscopic studies of black silicon for solar cell Journal of Electron Spectroscopy and Related Phenomena 184 2012 589 592 [14] S. Koynov M.S. Brandt M. Stutzmann Black nonreflecting silicon surfaces for solar cells Applied Physics Letters 88 2006 203107 [15] K. Hadobás S. Kirsch A. Carl Reflection properties of nanostructure-arrayed silicon surfaces Nanotechnology 11 2000 161 164 [16] F. Toor H.M. Branz M.R. Page Multi-scale surface texture to improve blue response of nanoporous black silicon solar cells Applied Physics Letters 99 2011 103501 [17] K.K. Hong S.B. Cho J.S. You Mechanism for the formation of Ag crystallites in the Ag thick-film contacts of crystalline Si solar cells Solar Energy Materials and Solar Cells 93 2009 898 904 [18] G. Schubert F. Huster P. Fath Physical understanding of printed thick-film front contacts of crystalline Si solar cells—review of existing models and recent developments Solar Energy Materials and Solar Cells 90 2006 3399 3406", "scopus-id": "84867805282", "coredata": {"eid": "1-s2.0-S0927024812004679", "dc:description": "An optimized textured structure is a key for high efficiency multi-crystalline silicon solar cell. In this work, black silicon wafers with various structures have been successfully produced by plasma immersion ion implantation. The surface morphology, reflectance and internal quantum efficiency have been investigated by atomic force microscope, spectrophotometer and quantum efficiency measurement system, respectively. Results show that nanohillocks with average height of 150–600nm have been generated on black silicon surfaces by different texturing conditions, and the reflectance over the wavelength from 300nm to 1100nm decreases with increasing the height of nanohillocks, whereas the internal quantum efficiency worsens. The solar cell based on the optimized nanohillocks height of 300nm yeilds efficiency of 15.99% with short circuit current of 34.0mA/cm2.", "openArchiveArticle": "false", "prism:coverDate": "2013-01-31", "openaccessUserLicense": null, "prism:aggregationType": "Journal", "prism:url": "https://api.elsevier.com/content/article/pii/S0927024812004679", "dc:creator": [{"@_fa": "true", "$": "Zhong, Sihua"}, {"@_fa": "true", "$": "Liu, Bangwu"}, {"@_fa": "true", "$": "Xia, Yang"}, {"@_fa": "true", "$": "Liu, Jinhu"}, {"@_fa": "true", "$": "Liu, Jie"}, {"@_fa": "true", "$": "Shen, Zenan"}, {"@_fa": "true", "$": "Xu, Zheng"}, {"@_fa": "true", "$": "Li, Chaobo"}], "link": [{"@_fa": "true", "@rel": "self", "@href": "https://api.elsevier.com/content/article/pii/S0927024812004679"}, {"@_fa": "true", "@rel": "scidir", "@href": "https://www.sciencedirect.com/science/article/pii/S0927024812004679"}], "dc:format": "application/json", "openaccessType": null, "pii": "S0927-0248(12)00467-9", "prism:volume": "108", "prism:publisher": "Elsevier B.V.", "dc:title": "Influence of the texturing structure on the properties of black silicon solar cell", "prism:copyright": "Copyright © 2012 Elsevier B.V. All rights reserved.", "prism:issueName": "Selected publications from the 22nd Space Photovoltaic Research and Technology (SPRAT) Conference", "openaccess": "0", "prism:issn": "09270248", "dcterms:subject": [{"@_fa": "true", "$": "Black silicon"}, {"@_fa": "true", "$": "Texturing structure"}, {"@_fa": "true", "$": "Solar cell"}, {"@_fa": "true", "$": "Contact resistance"}, {"@_fa": "true", "$": "Conversion efficiency"}], "openaccessArticle": "false", "prism:publicationName": "Solar Energy Materials and Solar Cells", "openaccessSponsorType": null, "prism:pageRange": "200-204", "prism:endingPage": "204", "pubType": "fla", "prism:coverDisplayDate": "January 2013", "prism:doi": "10.1016/j.solmat.2012.10.001", "prism:startingPage": "200", "dc:identifier": "doi:10.1016/j.solmat.2012.10.001", "openaccessSponsorName": null}, "objects": {"object": [{"@category": "standard", "@height": "200", "@width": "124", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024812004679-fx1.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "13900", "@ref": "fx1", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "163", "@width": "101", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024812004679-fx1.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "4263", "@ref": "fx1", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "121", "@width": "507", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024812004679-gr1.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "20963", "@ref": "gr1", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "52", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024812004679-gr1.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "5992", "@ref": "gr1", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "473", "@width": "661", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024812004679-gr2.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "98055", "@ref": "gr2", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "157", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024812004679-gr2.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "11822", "@ref": "gr2", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "240", "@width": "658", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024812004679-gr3.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "55256", "@ref": "gr3", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "80", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024812004679-gr3.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "4995", "@ref": "gr3", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "259", "@width": "378", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024812004679-gr4.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "26253", "@ref": "gr4", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "150", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024812004679-gr4.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "4108", "@ref": "gr4", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "320", "@width": "387", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024812004679-gr5.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "42934", "@ref": "gr5", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "164", "@width": "198", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024812004679-gr5.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "6394", "@ref": "gr5", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "322", "@width": "378", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024812004679-gr6.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "35574", "@ref": "gr6", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "163", "@width": "192", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024812004679-gr6.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "5131", "@ref": "gr6", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "412", "@width": "546", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024812004679-gr7.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "52315", "@ref": "gr7", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "164", "@width": "217", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024812004679-gr7.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "9571", "@ref": "gr7", "@mimetype": "image/gif"}]}, "link": {"@rel": "abstract", "@href": "https://api.elsevier.com/content/abstract/scopus_id/84867805282"}}