{"scopus-eid": "2-s2.0-33748307457", "originalText": "serial JL 271495 291210 291731 291732 291746 291809 291864 291865 291892 291893 31 Solar Energy Materials and Solar Cells SOLARENERGYMATERIALSSOLARCELLS 2006-07-24 2006-07-24 2010-03-28T15:44:17 1-s2.0-S0927024806002212 S0927-0248(06)00221-2 S0927024806002212 10.1016/j.solmat.2006.06.015 S300 S300.1 FULL-TEXT 1-s2.0-S0927024806X02040 2015-05-15T03:20:13.540853-04:00 0 0 20061123 2006 2006-07-24T00:00:00Z articleinfo crossmark dco dateupdated tomb dateloaded datesearch indexeddate issuelist volumelist yearnav articletitlenorm authfirstinitialnorm authfirstsurnamenorm cid cids confabbr confdate confloc contenttype copyright dateloadedtxt docsubtype doctype doi eid ewtransactionid hubeid issfirst issn issnnorm itemstage itemtransactionid itemweight openaccess openarchive pg pgfirst pglast pii piinorm pubdatestart pubdatetxt pubyr sortorder srctitle srctitlenorm srctype subheadings vol vol volfirst volissue webpdf webpdfpagecount figure table body affil articletitle auth authfirstini authfull authkeywords authlast primabst ref alllist content subj ssids 0927-0248 09270248 90 90 18 19 18 19 Volume 90, Issues 18–19 20 3085 3093 3085 3093 20061123 23 November 2006 2006-11-23 2006 14th International Photovoltaic Science and Engineering Conference 14th International Photovoltaic Science and Engineering Conference PVSEC-14 Bangkok, Thailand 27 January–1 February 2004 20040127 20040201 article fla Copyright © 2006 Elsevier B.V. All rights reserved. BLACKSILICONLAYERFORMATIONFORAPPLICATIONINSOLARCELLS YOO J 1 Introduction 2 Experimental 2.1 RF multi-hollow cathode reactor 2.2 Black silicon etching 2.3 Black silicon solar cell fabrication 3 Results and discussion 4 Conclusion References CAMPBELL 1987 243 P LIPINSKI 2002 271 M GUERREROLEMUS 2002 495 R SAADOUN 1999 377 M MAJUMDAR 2003 51 D ZHAO 1998 1991 J WINDERBAUM 1997 239 S JANSEN 1995 475 H HORWITZ 1990 308 C HANDBOOKPLASMAPROCESSINGTECHNOLOGY YOOX2006X3085 YOOX2006X3085X3093 YOOX2006X3085XJ YOOX2006X3085X3093XJ item S0927-0248(06)00221-2 S0927024806002212 1-s2.0-S0927024806002212 10.1016/j.solmat.2006.06.015 271495 2010-10-07T21:57:15.870238-04:00 2006-11-23 1-s2.0-S0927024806002212-main.pdf https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024806002212/MAIN/application/pdf/80e26d706c7ed98dd15b49e9334d8eba/main.pdf https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024806002212/MAIN/application/pdf/80e26d706c7ed98dd15b49e9334d8eba/main.pdf main.pdf pdf true 361968 MAIN 9 1-s2.0-S0927024806002212-main_1.png https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024806002212/PREVIEW/image/png/71532491f501de0ae7fa80950bd9064c/main_1.png https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024806002212/PREVIEW/image/png/71532491f501de0ae7fa80950bd9064c/main_1.png main_1.png png 47707 849 656 IMAGE-WEB-PDF 1 1-s2.0-S0927024806002212-gr4.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024806002212/gr4/DOWNSAMPLED/image/jpeg/1df14dd48a13d185ca9b5afd5b8765c2/gr4.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024806002212/gr4/DOWNSAMPLED/image/jpeg/1df14dd48a13d185ca9b5afd5b8765c2/gr4.jpg gr4 gr4.jpg jpg 72342 451 344 IMAGE-DOWNSAMPLED 1-s2.0-S0927024806002212-gr4.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024806002212/gr4/THUMBNAIL/image/gif/611ce60b281487793db4ad37cd514649/gr4.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024806002212/gr4/THUMBNAIL/image/gif/611ce60b281487793db4ad37cd514649/gr4.sml gr4 gr4.sml sml 3032 93 71 IMAGE-THUMBNAIL 1-s2.0-S0927024806002212-gr5.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024806002212/gr5/DOWNSAMPLED/image/jpeg/fceec13084b8002eb5ee5142e7b5954b/gr5.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024806002212/gr5/DOWNSAMPLED/image/jpeg/fceec13084b8002eb5ee5142e7b5954b/gr5.jpg gr5 gr5.jpg jpg 63620 266 567 IMAGE-DOWNSAMPLED 1-s2.0-S0927024806002212-gr5.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024806002212/gr5/THUMBNAIL/image/gif/ebdbb31d40936746180077b7cdeb5e3c/gr5.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024806002212/gr5/THUMBNAIL/image/gif/ebdbb31d40936746180077b7cdeb5e3c/gr5.sml gr5 gr5.sml sml 2512 59 125 IMAGE-THUMBNAIL 1-s2.0-S0927024806002212-gr6.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024806002212/gr6/DOWNSAMPLED/image/jpeg/91897beda1bc1624097b0523fd89c1a4/gr6.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024806002212/gr6/DOWNSAMPLED/image/jpeg/91897beda1bc1624097b0523fd89c1a4/gr6.jpg gr6 gr6.jpg jpg 26910 380 513 IMAGE-DOWNSAMPLED 1-s2.0-S0927024806002212-gr6.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024806002212/gr6/THUMBNAIL/image/gif/d4536402b182739dee57acd59985ea39/gr6.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024806002212/gr6/THUMBNAIL/image/gif/d4536402b182739dee57acd59985ea39/gr6.sml gr6 gr6.sml sml 1956 93 125 IMAGE-THUMBNAIL 1-s2.0-S0927024806002212-gr3.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024806002212/gr3/DOWNSAMPLED/image/jpeg/6ce7681a29f42824b3e1503fde0767e3/gr3.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024806002212/gr3/DOWNSAMPLED/image/jpeg/6ce7681a29f42824b3e1503fde0767e3/gr3.jpg gr3 gr3.jpg jpg 30508 417 539 IMAGE-DOWNSAMPLED 1-s2.0-S0927024806002212-gr3.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024806002212/gr3/THUMBNAIL/image/gif/bcff48e216bd827bab62b8cd8b7883b4/gr3.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024806002212/gr3/THUMBNAIL/image/gif/bcff48e216bd827bab62b8cd8b7883b4/gr3.sml gr3 gr3.sml sml 2045 94 121 IMAGE-THUMBNAIL 1-s2.0-S0927024806002212-gr1.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024806002212/gr1/DOWNSAMPLED/image/jpeg/7e5de690938e97fa8f9998ee0bf4410a/gr1.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024806002212/gr1/DOWNSAMPLED/image/jpeg/7e5de690938e97fa8f9998ee0bf4410a/gr1.jpg gr1 gr1.jpg jpg 48684 265 523 IMAGE-DOWNSAMPLED 1-s2.0-S0927024806002212-gr1.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024806002212/gr1/THUMBNAIL/image/gif/01ca228be919f31e69f01f2c3c253d64/gr1.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024806002212/gr1/THUMBNAIL/image/gif/01ca228be919f31e69f01f2c3c253d64/gr1.sml gr1 gr1.sml sml 1937 63 125 IMAGE-THUMBNAIL 1-s2.0-S0927024806002212-gr2.gif https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024806002212/gr2/DOWNSAMPLED/image/gif/b9e9c6339752168ede268b3c58e99d6a/gr2.gif https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024806002212/gr2/DOWNSAMPLED/image/gif/b9e9c6339752168ede268b3c58e99d6a/gr2.gif gr2 gr2.gif gif 17351 331 527 IMAGE-DOWNSAMPLED 1-s2.0-S0927024806002212-gr2.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024806002212/gr2/THUMBNAIL/image/gif/3870cf319bbf3a1f4cc2340b01767818/gr2.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024806002212/gr2/THUMBNAIL/image/gif/3870cf319bbf3a1f4cc2340b01767818/gr2.sml gr2 gr2.sml sml 1805 78 125 IMAGE-THUMBNAIL 1-s2.0-S0927024806002212-gr7.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024806002212/gr7/DOWNSAMPLED/image/jpeg/e976c051382802e911919c3b6568b82c/gr7.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024806002212/gr7/DOWNSAMPLED/image/jpeg/e976c051382802e911919c3b6568b82c/gr7.jpg gr7 gr7.jpg jpg 65205 684 503 IMAGE-DOWNSAMPLED 1-s2.0-S0927024806002212-gr7.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024806002212/gr7/THUMBNAIL/image/gif/5df508d6ce8ea0234b585678ef917f06/gr7.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024806002212/gr7/THUMBNAIL/image/gif/5df508d6ce8ea0234b585678ef917f06/gr7.sml gr7 gr7.sml sml 1731 92 68 IMAGE-THUMBNAIL SOLMAT 3890 S0927-0248(06)00221-2 10.1016/j.solmat.2006.06.015 Elsevier B.V. Fig. 1 Schematic diagram of the RF multi-hollow cathode system. Fig. 2 Block diagram of detailed procedure of fabrication of black c-Si and mc-Si solar cells. Fig. 3 Normal incidence spectral reflectance from black mc-Si surface and polished silicon surface. Fig. 4 SEM micrographs (top view) of (a) black c-Si and (b) black mc-Si surfaces. Fig. 5 Photographs of (a) 103mm×103mm black c-Si solar cell and (b) 100mm×100mm Black mc-Si solar cell. Fig. 6 Illuminated I–V characteristics of black silicon solar cells. Fig. 7 Dark I–V characteristic of (a) 98cm2 pseudo-square black c-Si solar cell and (b) 100cm2 black mc-Si solar cell. Table 1 Performance of black c-Si and mc-Si cells Type of solar cell Area of solar cell (cm2) Method of doping V oc (V) I sc (A) FF Efficiency (%) c-Si 98 POCl3 diffusion 0.564 2.80 0.73 11.7 mc-Si 100 POCl3 diffusion 0.566 2.50 0.72 10.2 Black silicon layer formation for application in solar cells J.S. Yoo I.O. Parm U. Gangopadhyay Kyunghae Kim S.K. Dhungel D. Mangalaraj Junsin Yi ⁎ School of Information and Communication Engineering, Sungkyunkwan University, Suwon 440-746, Republic of Korea ⁎ Corresponding author. Tel.: +82312907139; fax: +82312907179. Low-cost, large area, random and mask less texturing scheme independent of crystal orientation are some of the factors that significantly influence the success of terrestrial photovoltaic technology. This work is focused on the texturing of the silicon surface microstructures by reactive ion etching using a multi-hollow cathode system. Desirable texturing effect has been achieved by applying a radio-frequency power of about 20W per hollow cathode glow. The etched silicon surface shows almost zero reflectance in the visible region as well as in near-IR region. The silicon surface is covered by columnar microstructures with diameters ranging from 50 to 100nm and with a depth of about 500nm. Solar cells with efficiencies of 11.7% and 10.2% with black mono-crystalline and multi-crystalline silicon wafers, respectively, were successfully fabricated and tested. Keywords Reactive ion etching Hollow cathode Reflectance Solar cell 1 Introduction Surface texturization is usually performed to enhance light absorption in silicon solar cells [1]. Wet anisotropic chemical etching technique used to form random pyramidal structure on 〈100〉 silicon wafers is not very effective in texturing multi-crystalline silicon wafers because of the randomly orientated crystallites. The quality of low-cost multi-crystalline silicon (mc-Si) solar cell performance is close to that of mono-crystalline (c-Si) solar cell, with the major difference resulting from the inability to texture mc-Si surface. Expensive anti-reflection layers like silicon nitride and magnesium fluoride have been applied to the front surface of mc-Si solar cell to reduce light reflection. Recently, various forms of texturing been tried on mc-Si surface including, laser structuring [2], mechanical diamond saw cutting [3], porous-Si etching [4–7], photo-lithographically defined etching [8], and reactive ion etching (RIE) [9]. Historical review for RIE texturing of silicon can be found in Sandia report (Zaidi, SAND2000-0919, Sandia contract ♯BE-8229, April 2000). From that review, it is evident that different gas mixtures can be used for the creation of black silicon, which is a grass-like structure that occurs at the bottom of deep trenches on the surface of silicon. Jansen et al. [10] reported the preparation of black silicon using planar parallel plate (Plasmafab 340, Plasmatherm 500) and hexode (AME-8100) reactors with SF6/CHF3/O2 plasma. In SF6/O2 plasma, SF6 is the source of active fluorine that etches silicon and the oxygen radicals passivate the surface of the etched silicon surface. An extensive study of the SF6/O2 RIE for silicon solar cell application was done by Ruby et al. [11] using a parallel-plate reactor. They observed different shapes of etched microstructures over the silicon surface which was covered with a thin passivating siliconoxyfluoride layer. The origin of the micro-masks on the top of the etched silicon structures might be from the silicon surface contaminations. Microstructures with nearly vertical walls were obtained on keeping a certain balance between the etching and the passivation. This special technique, a metal–catalyst approach for the sputtering of metal contaminations, had received a patent support [12]. Finding other types of reactors to produce black silicon surface is quite interesting. In this work, we investigated the possibility of obtaining a black silicon surface using a radio frequency (RF) multi-hollow cathode discharge system. Due to the low-operating voltages, RF multi-hollow cathode system produces lesser plasma-induced damages to silicon surface than that of the conventional RF diode plasma systems. For the present study we used a multi-electrode embodiment RF multi-hollow cathode system, which adapts to a high-production environment. In this paper, we report the formation of uniform black silicon surface on both c-Si and mc-Si wafers using the above-mentioned system. We also report the fabrication of black c-Si and mc-Si solar cells using conventional POCl3 diffusion. 2 Experimental 2.1 RF multi-hollow cathode reactor The schematic block diagram of the RF multi-hollow cathode reactor used in the present experiment is shown in Fig. 1 . This reactor consists of a Pyrex tube defining the vacuum chamber, with a outer metal cylindrical electrode (grounded) acting as a counter electrode for powered aluminum plate electrodes assembly which is in electrical contact with silicon wafers. The plate electrodes have a diameter of 150mm each. These electrodes are electrically and structurally connected by metal supports close to their outer rim with a separation space of 25mm between each of them. The Pyrex tube has an inner diameter of 190mm. The RF power creates an electrical field on electrode surface and causes an excitation of reactive gases in the space between the electrodes, preferably between the silicon wafers. This produces a high level of ionization of the gas and dense plasma therein due to the repelling movement of the entrapped electrons between the powered electrodes; and this is called the hollow cathode effect [13]. Uniform deposition of micro-masks over the silicon surface is a necessary condition for uniform texturing. The origin of micro-masks in the present case may be from the re-sputtering of both the aluminum electrodes and the Pyrex tube. 2.2 Black silicon etching Initially, we have taken as-cut c-Si wafers with specifications of 1–5Ωcm, 〈100〉, p-type, 350μm thick and 103 ×103mm dimensions and as-cut mc-Si wafers with specifications of 1–5Ωcm, p-type, 275μm thick and 100×100mm dimensions. Before starting the surface etching, c-Si wafers were texturized by conventional wet texturing technique and chemically polished the mc-Si wafers by 21HNO3:7HF:16CH3COOH mixture, respectively. Textured c-Si and polished mc-Si wafers were mounted on the aluminum electrodes inside the multi-hollow cathode plasma reactor. Plasma etching was performed using SF6/O2 mixtures to produce a randomly textured silicon surfaces that look black because of near-zero surface reflection. The silicon surface is found to be covered by a lot of columnar microstructures which are responsible for the zero reflection. Desirable texturing is achieved when the RF power (13.56MHz frequency) of about 20W per one hollow cathode glow is applied in the multi-hollow cathode reactor. SF6/O2 partial pressure ratio was maintained at 2.5 with the etching pressure of 50mTorr. The texturization was performed for 20min. The black silicon surface reflection was characterized in the visible to IR spectral region using a UV–VIS spectrophotometer (model no. SCINCO S-2100). 2.3 Black silicon solar cell fabrication Conventional POCl3 diffusion and screen-printed metallization were employed to fabricate solar cells using black surface silicon wafers. The block diagram showing the sequence of steps followed during the solar cell fabrication is given in Fig. 2 . The black silicon wafers were diffused by n-type impurity in an open-tube furnace using conventional POCl3 diffusion source at 860°C with a 20min pre-deposition followed by a 40min drive-in. Phosphosilicate glass (PSG)-removed and POCl3-diffused silicon wafers were passivated with a thin oxide layer (⩽10nm) at a temperature of 750°C. After edge isolation, the front and back metallization of the diffused black silicon wafers were carried out using standard Al-paste (product no. FX 53-038, Ferro Electronic Materials) and Ag-paste (product no. 3349, Ferro Electronic Materials). The metallization was done by screen-printing technique and this was followed by baking and co-firing at a temperature of 740°C in a conveyer belt furnace. 3 Results and discussion Fig. 3 shows a typical normal incidence spectral reflectance of black mc-Si surface. The reflectance of the polished silicon is also plotted for comparison. The surface of the etched silicon shows almost zero reflection in the visible as well as in the near-IR regions. Scanning electron microscope (SEM) investigation was done on these randomly etched black silicon surfaces. The SEM micrographs of the c-Si and mc-Si etched surfaces are shown in Fig. 4(a) and (b) , respectively. From these micrographs, it is seen that silicon surfaces are covered with a lot of columnar microstructures. The columnar microstructures have diameters ranging from 50 to 100nm each with a depth of about 500nm. The sidewall passivation of etched columns with siliconoxyfluoride film is very sensitive to oxygen content at the silicon surface. Any deficiency of oxygen is the main cause for the change of black surface into a polished one. Moreover, in the hollow cathode system of the present study, the RF discharge allows an improvement of plasma density by an order of magnitude in comparison to a standard RF parallel-plate discharge. The increase in the plasma density has been achieved with the hollow cathode configuration, and it is attributed to the so called ‘electron mirror’ effect in which a negative self-developed bias voltage on the two opposing RF powered electrodes helps to increase the density of the high-energy electrons (responsible for ionization) and to reduce their recombination rate. Moreover, the hollow cathode effect can be enhanced by (i) confining the discharge at an appropriate level, that results in raising plasma density, (ii) increasing flow of ions to the electrodes (substrates) and (iii) decreasing the average energy of the ions. The electrons have much higher mobility than the ions, and they are very easily collected on to electrode whenever it becomes positive with respect to the glow space. This fact in turn, causes depletion of electrons from the dark space with consequent rise in potential of the glow space with respect to the electrodes. The surface of the RF-powered hollow cathode electrode has acquired a self-bias which will have a value equal to nearly half of the applied RF peak-to-peak voltage. The voltage at the electrode surface is positive for a very short fraction of each cycle and hence the ion bombardment is almost continuous. The energy of the majority of the ions centers about the bias voltage across the dark space at the substrate and the ions will undergo several oscillations on their way across the sheath at a high frequency (>4MHz). The electrons originated at the hollow cathode surface traversed the inter electrode space to the opposite surface of the hollow cathode. The surface electrical field serves as a mirror so that the electrons are forced to move towards the glow space plasma region from both sides. This electrode configuration leads to the oscillation of electrons; it also leads to an increase in the number of ionization events per electron when compared with a conventional parallel-plate RF plasma discharge. The RF hollow cathode discharge is characterized by the low-voltage and high current density regimes. The lower voltage means more ion flux (current) leading to higher etch rate in comparison to the conventional RF discharge at the same power. Fig. 5 shows the photographs of large area black c-Si and mc-Si solar cells fabricated in our laboratory. The dimensions of c-Si and mc-Si are 103mm×103mm and 100mm×100mm, respectively. The performance of the solar cells were measured under the standard 100mW/cm2 AM1.5 (air mass) global spectrum at 25°C and Table 1 lists the measured parameters of the solar cells. Fig. 6 shows the light-illuminated current–voltage (LIV) characteristics of the solar cells. This figure shows the low open-circuit voltage of both c-Si as well as mc-Si solar cells. Moreover, from the dark current–voltage characteristics of the cells as shown in Fig. 7(a) and (b) , it is observed that the recombination current components (I 02) of dark current (consist of injection current components I 01 and recombination current component I 02) for both c-Si and mc-Si solar cells are very small indicating the formation of a shunt path across the junction of the fabricated solar cells. The low values of shunt resistance and hence the leakage across the junction leads to low values of open-circuit voltages. These factors show that the RF multi-hollow cathode plasma system used in this study has the capability to produce uniform black surface silicon wafers for the fabrication of solar cells that are compatible with the rest of the silicon solar cells. 4 Conclusion RIE on both c-Si and mc-Si samples has been performed using RF multi-hollow cathode plasma system. Plasma texturing has been shown to produce black silicon surfaces with almost zero reflectance. The silicon surface was covered with columnar microstructures each having diameter ranging from 50 to 100nm and depth of about 500nm. Solar cells with efficiencies 11.7% and 10.2% were fabricated using black c-Si and black mc-Si wafers, respectively, by making use of industrial mass production line system. Further improvement in black silicon solar cell performance can be expected using proper optimization of the cell fabrication process parameters. References [1] P. Campbell M.A. Green J. Appl. Phys. 62 1987 243 [2] S. Narayanan, Ph.D. Dissertation, University of New South Wales, Sydney, Australia, May, 1989. [3] P. Path, G. Wileke, E. Bucher, J. Szlufcic, R.M. Murti, K. De Clercq, J. Nijs, R. Mertens, in: Proceedings of the 24th IEEE Photovoltaic Specialist Conference, 1994, p. 1347. [4] M. Lipiñski P. Panek Z. Šwiatek E. Beltowska R. Ciach Sol. Energy Mater. Sol. Cells 72 2002 271 [5] R. Guerrero-Lemus C. Hernández-Rodríguez F. Ben-Hander J.M. Martínez-Duart Sol. Energy Mater. Sol. Cells 72 2002 495 [6] M. Saadoun H. Ezzaouia B. Bessaïs M.F. Boujmil R. Bennaceur Sol. Energy Mater. Sol. Cells 59 1999 377 [7] D. Majumdar S. Chatterjee M. Dhar S.K. Dutta H. Saha Sol. Energy Mater. Sol. Cells 77 2003 51 [8] J. Zhao A. Wang M.A. Green F. Ferrazza Appl. Phys. Lett. 73 1998 1991 [9] S. Winderbaum O. Reinhold F. Yun Sol. Energy Mater. Sol. Cells 46 1997 239 [10] H. Jansen M. de Boer J. Burger R. Legtenberg M. Elwenspoek Microelectron. Eng. 27 1995 475 [11] D.S. Ruby, W.K. Schubert, J.M. Gee, S.H. Zaidi, US Patent No. 6091021. [12] D.S. Ruby, S.H. Zaidi, US Patent No. 6329296. [13] C.M. Horwitz S.M. Rossnagel J.J. Cuomo W.D. Westwood Handbook of Plasma Processing Technology 1990 Noyes Park Ridge, NJ 308 (Chapter 12)", "scopus-id": "33748307457", "coredata": {"eid": "1-s2.0-S0927024806002212", "dc:description": "Low-cost, large area, random and mask less texturing scheme independent of crystal orientation are some of the factors that significantly influence the success of terrestrial photovoltaic technology. This work is focused on the texturing of the silicon surface microstructures by reactive ion etching using a multi-hollow cathode system. Desirable texturing effect has been achieved by applying a radio-frequency power of about 20W per hollow cathode glow. The etched silicon surface shows almost zero reflectance in the visible region as well as in near-IR region. The silicon surface is covered by columnar microstructures with diameters ranging from 50 to 100nm and with a depth of about 500nm. Solar cells with efficiencies of 11.7% and 10.2% with black mono-crystalline and multi-crystalline silicon wafers, respectively, were successfully fabricated and tested.", "openArchiveArticle": "false", "prism:coverDate": "2006-11-23", "openaccessUserLicense": null, "prism:aggregationType": "Journal", "prism:url": "https://api.elsevier.com/content/article/pii/S0927024806002212", "dc:creator": [{"@_fa": "true", "$": "Yoo, J.S."}, {"@_fa": "true", "$": "Parm, I.O."}, {"@_fa": "true", "$": "Gangopadhyay, U."}, {"@_fa": "true", "$": "Kim, Kyunghae"}, {"@_fa": "true", "$": "Dhungel, S.K."}, {"@_fa": "true", "$": "Mangalaraj, D."}, {"@_fa": "true", "$": "Yi, Junsin"}], "link": [{"@_fa": "true", "@rel": "self", "@href": "https://api.elsevier.com/content/article/pii/S0927024806002212"}, {"@_fa": "true", "@rel": "scidir", "@href": "https://www.sciencedirect.com/science/article/pii/S0927024806002212"}], "dc:format": "application/json", "openaccessType": null, "pii": "S0927-0248(06)00221-2", "prism:volume": "90", "prism:publisher": "Elsevier B.V.", "dc:title": "Black silicon layer formation for application in solar cells", "prism:copyright": "Copyright © 2006 Elsevier B.V. All rights reserved.", "prism:issueName": "14th International Photovoltaic Science and Engineering Conference", "openaccess": "0", "prism:issn": "09270248", "prism:issueIdentifier": "18-19", "dcterms:subject": [{"@_fa": "true", "$": "Reactive ion etching"}, {"@_fa": "true", "$": "Hollow cathode"}, {"@_fa": "true", "$": "Reflectance"}, {"@_fa": "true", "$": "Solar cell"}], "openaccessArticle": "false", "prism:publicationName": "Solar Energy Materials and Solar Cells", "prism:number": "18-19", "openaccessSponsorType": null, "prism:pageRange": "3085-3093", "prism:endingPage": "3093", "pubType": "fla", "prism:coverDisplayDate": "23 November 2006", "prism:doi": "10.1016/j.solmat.2006.06.015", "prism:startingPage": "3085", "dc:identifier": "doi:10.1016/j.solmat.2006.06.015", "openaccessSponsorName": null}, "objects": {"object": [{"@category": "standard", "@height": "451", "@width": "344", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024806002212-gr4.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "72342", "@ref": "gr4", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "93", "@width": "71", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024806002212-gr4.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "3032", "@ref": "gr4", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "266", "@width": "567", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024806002212-gr5.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "63620", "@ref": "gr5", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "59", "@width": "125", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024806002212-gr5.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "2512", "@ref": "gr5", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "380", "@width": "513", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024806002212-gr6.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "26910", "@ref": "gr6", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "93", "@width": "125", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024806002212-gr6.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "1956", "@ref": "gr6", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "417", "@width": "539", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024806002212-gr3.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "30508", "@ref": "gr3", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "94", "@width": "121", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024806002212-gr3.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "2045", "@ref": "gr3", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "265", "@width": "523", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024806002212-gr1.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "48684", "@ref": "gr1", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "63", "@width": "125", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024806002212-gr1.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "1937", "@ref": "gr1", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "331", "@width": "527", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024806002212-gr2.gif?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "17351", "@ref": "gr2", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "78", "@width": "125", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024806002212-gr2.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "1805", "@ref": "gr2", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "684", "@width": "503", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024806002212-gr7.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "65205", "@ref": "gr7", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "92", "@width": "68", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024806002212-gr7.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "1731", "@ref": "gr7", "@mimetype": "image/gif"}]}, "link": {"@rel": "abstract", "@href": "https://api.elsevier.com/content/abstract/scopus_id/33748307457"}}