{"scopus-eid": "2-s2.0-84866010803", "originalText": "serial JL 271378 291210 291719 291777 291892 31 Materials Science and Engineering: B MATERIALSSCIENCEENGINEERINGB 2012-04-01 2012-04-01 2012-09-07T16:25:24 1-s2.0-S0921510712002012 S0921-5107(12)00201-2 S0921510712002012 10.1016/j.mseb.2012.03.038 S300 S300.1 FULL-TEXT 1-s2.0-S0921510712X00163 2015-05-15T02:56:37.921928-04:00 0 0 20120920 2012 2012-04-01T00:00:00Z articleinfo crossmark dco dateupdated tomb dateloaded datesearch indexeddate issuelist volumelist yearnav articletitlenorm authfirstinitialnorm authfirstsurnamenorm cid cids confeditor contenttype copyright dateloadedtxt docsubtype doctype doi eid ewtransactionid hubeid issfirst issn issnnorm itemstage itemtransactionid itemweight openaccess openarchive pg pgfirst pglast pii piinorm pubdatestart pubdatetxt pubyr sectiontitle sortorder srctitle srctitlenorm srctype subheadings vol volfirst volissue webpdf webpdfpagecount figure body acknowledge affil articletitle auth authfirstini authfull authkeywords authlast primabst pubtype ref alllist content subj ssids 0921-5107 09215107 false 177 177 16 16 Volume 177, Issue 16 19 1509 1513 1509 1513 20120920 20 September 2012 2012-09-20 2012 Advances in Semiconducting Materials Dr. Velumani Subramaniam Short Communications article sco Copyright © 2012 Elsevier B.V. All rights reserved. BLACKSILICONFORMATIONUSINGDRYETCHINGFORSOLARCELLSAPPLICATIONS MURIAS D 1 Introduction 2 Experimental 3 Results and discussion 4 Conclusions Acknowledgment References 2008 SOLARGENERATIONV ZWEIBEL 2000 375 386 K BIRKMIRE 1997 625 653 R CHOPRA 2004 69 92 K MARTIN 1999 1940 1947 A TSUNOMURA 2009 670 673 Y KING 1991 303 308 D PHOTOVOLTAICSPECIALISTCONFERENCEIEEE KATRIN 2008 B 23RDEUROPEANPHOTOVOLTAICSOLARENERGYCONFERENCEPROCEEDINGS KIM 2004 239 247 J CHU 2009 1276 1280 A VAZSONYI 1999 179 188 E MATTHEW 2008 1373 1377 E ZHENQIANG 2004 2101 2107 X IENCINELLA 2005 725 732 D PAPET 2006 2319 2328 P GANGOPADHYAY 2006 1906 1915 U DEWOLF 2005 729 732 S 20THEUROPEANPHOTOVOLTAICSOLARENERGYCONFERENCEPROCEEDINGS CARNEL 2006 830 833 L 21STEUROPEANPHOTOVOLTAICSOLARENERGYCONFERENCEPROCEEDINGS DEKKERS 2004 412 415 H RUBY 2002 133 137 D YOO 2008 1 7 J HENRI 1995 115 120 J CHANG 2007 193 196 Y DIMUNDO 2011 239 245 R VOROBYEV 2011 7291 7294 A XIA 2011 574 1578 Y KUMAR 2011 215 218 D HUNG 2011 869 877 Y LI 2011 4888 4900 J SRIVASTAVA 2010 1506 1511 S SHIEH 2011 J HSU 2004 471 475 C 2000 10815 10837 ENCYCLOPEDIAANALYTICALCHEMISTRY PARK 2005 275 279 Y MURIASX2012X1509 MURIASX2012X1509X1513 MURIASX2012X1509XD MURIASX2012X1509X1513XD item S0921-5107(12)00201-2 S0921510712002012 1-s2.0-S0921510712002012 10.1016/j.mseb.2012.03.038 271378 2012-09-07T15:00:50.50871-04:00 2012-09-20 1-s2.0-S0921510712002012-main.pdf https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0921510712002012/MAIN/application/pdf/daf0ff8bae1a2b6e1f1e840a56cf499a/main.pdf https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0921510712002012/MAIN/application/pdf/daf0ff8bae1a2b6e1f1e840a56cf499a/main.pdf main.pdf pdf true 870039 MAIN 5 1-s2.0-S0921510712002012-main_1.png https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0921510712002012/PREVIEW/image/png/1f53d1ddb50fce2e7ad0d79b05d1efdb/main_1.png https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0921510712002012/PREVIEW/image/png/1f53d1ddb50fce2e7ad0d79b05d1efdb/main_1.png main_1.png png 60525 849 656 IMAGE-WEB-PDF 1 1-s2.0-S0921510712002012-gr1.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0921510712002012/gr1/DOWNSAMPLED/image/jpeg/87bc626c7edf92b4326769bb95f03d15/gr1.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0921510712002012/gr1/DOWNSAMPLED/image/jpeg/87bc626c7edf92b4326769bb95f03d15/gr1.jpg gr1 gr1.jpg jpg 30986 319 374 IMAGE-DOWNSAMPLED 1-s2.0-S0921510712002012-gr1.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0921510712002012/gr1/THUMBNAIL/image/gif/97395843119b8114c2dfa89ea1849bd3/gr1.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0921510712002012/gr1/THUMBNAIL/image/gif/97395843119b8114c2dfa89ea1849bd3/gr1.sml gr1 gr1.sml sml 3319 164 192 IMAGE-THUMBNAIL 1-s2.0-S0921510712002012-gr2.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0921510712002012/gr2/DOWNSAMPLED/image/jpeg/3cfe090c5c8c99d23c71b68e2633ece0/gr2.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0921510712002012/gr2/DOWNSAMPLED/image/jpeg/3cfe090c5c8c99d23c71b68e2633ece0/gr2.jpg gr2 gr2.jpg jpg 92199 335 590 IMAGE-DOWNSAMPLED 1-s2.0-S0921510712002012-gr2.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0921510712002012/gr2/THUMBNAIL/image/gif/66e664cad2f691b22e24ea84ea8bfb01/gr2.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0921510712002012/gr2/THUMBNAIL/image/gif/66e664cad2f691b22e24ea84ea8bfb01/gr2.sml gr2 gr2.sml sml 13988 124 219 IMAGE-THUMBNAIL 1-s2.0-S0921510712002012-gr3.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0921510712002012/gr3/DOWNSAMPLED/image/jpeg/153c6f0e500a0fd0f45df6b3d404e161/gr3.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0921510712002012/gr3/DOWNSAMPLED/image/jpeg/153c6f0e500a0fd0f45df6b3d404e161/gr3.jpg gr3 gr3.jpg jpg 62097 199 627 IMAGE-DOWNSAMPLED 1-s2.0-S0921510712002012-gr3.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0921510712002012/gr3/THUMBNAIL/image/gif/fcb5ea013a16f5a8468a64eb2121a3af/gr3.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0921510712002012/gr3/THUMBNAIL/image/gif/fcb5ea013a16f5a8468a64eb2121a3af/gr3.sml gr3 gr3.sml sml 8093 69 219 IMAGE-THUMBNAIL 1-s2.0-S0921510712002012-gr4.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0921510712002012/gr4/DOWNSAMPLED/image/jpeg/631f9f168fe7c3107f5598ddcaae61bd/gr4.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0921510712002012/gr4/DOWNSAMPLED/image/jpeg/631f9f168fe7c3107f5598ddcaae61bd/gr4.jpg gr4 gr4.jpg jpg 37016 261 339 IMAGE-DOWNSAMPLED 1-s2.0-S0921510712002012-gr4.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0921510712002012/gr4/THUMBNAIL/image/gif/e55050acbba4a27bf958518b3f0493c5/gr4.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0921510712002012/gr4/THUMBNAIL/image/gif/e55050acbba4a27bf958518b3f0493c5/gr4.sml gr4 gr4.sml sml 4896 164 213 IMAGE-THUMBNAIL 1-s2.0-S0921510712002012-gr5.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0921510712002012/gr5/DOWNSAMPLED/image/jpeg/01cb73f779aec6da7bcb9a5306a692f8/gr5.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0921510712002012/gr5/DOWNSAMPLED/image/jpeg/01cb73f779aec6da7bcb9a5306a692f8/gr5.jpg gr5 gr5.jpg jpg 40761 299 380 IMAGE-DOWNSAMPLED 1-s2.0-S0921510712002012-gr5.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0921510712002012/gr5/THUMBNAIL/image/gif/60057f44d37a96e87174773c587272a1/gr5.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0921510712002012/gr5/THUMBNAIL/image/gif/60057f44d37a96e87174773c587272a1/gr5.sml gr5 gr5.sml sml 4656 164 208 IMAGE-THUMBNAIL 1-s2.0-S0921510712002012-gr6.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0921510712002012/gr6/DOWNSAMPLED/image/jpeg/93851ea961903597bfdd97c5307a3b49/gr6.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0921510712002012/gr6/DOWNSAMPLED/image/jpeg/93851ea961903597bfdd97c5307a3b49/gr6.jpg gr6 gr6.jpg jpg 31893 271 362 IMAGE-DOWNSAMPLED 1-s2.0-S0921510712002012-gr6.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0921510712002012/gr6/THUMBNAIL/image/gif/32414529e8dc9ab3d7bd7cee1dccccad/gr6.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0921510712002012/gr6/THUMBNAIL/image/gif/32414529e8dc9ab3d7bd7cee1dccccad/gr6.sml gr6 gr6.sml sml 4446 164 219 IMAGE-THUMBNAIL MSB 13099 S0921-5107(12)00201-2 10.1016/j.mseb.2012.03.038 Elsevier B.V. Fig. 1 DC self-bias voltage vs. pressure and RF power. ■, SF6/O2 =30/10sccm – 100W; ▴, SF6/O2/CH4 =30/10/4sccm – 100W, ▾, SF6/O2/CH4 =30/10/4sccm – 150W, ☆, SF6/O2 =30/10sccm – 50mTorr, □, SF6/O2/CH4 =30/10/4sccm – 50mTorr. Fig. 2 SEM and AFM images under different conditions of SF6/O2 and SF6/O2/CH4 gas mixtures, with texturing time of 20min. The upper figures show SEM images at 45° and the lower figures the AFM images. Fig. 3 SEM images for the best condition for Black Silicon, SF6/O2/CH4 =30/10/4sccm, 100W, 50mTorr, different texturing times were used. Fig. 4 Specular reflectance vs. wavelength of incident light for textured silicon under several plasma experimental conditions. Fig. 5 Diffuse reflectance vs. wavelength of incident light for textured silicon under several experimental conditions. Fig. 6 IR spectra for textured silicon with SF6/O2 and SF6/O2/CH4 gas mixtures. Comparison with SiC layer spectrum is shown. Short communication Black Silicon formation using dry etching for solar cells applications D. Murias a C. Reyes-Betanzo a ⁎ M. Moreno a A. Torres a A. Itzmoyotl a R. Ambrosio b M. Soriano b J. Lucas c P. Roca i Cabarrocas d a Instituto Nacional de Astrofísica, Óptica y Electrónica, INAOE, Puebla, Mexico b Universidad Autónoma de Ciudad Juárez, Chihuahua, Mexico c Instituto Tecnológico de Tehuacán, Puebla, Mexico d Laboratoire de Physique des Interfaces et des Couches Minces, Ecole Polytechnique, CNRS, Palaiseau, France ⁎ Corresponding author. Tel.: +52 222 2663100, fax: +52 222 2470517. A study on the formation of Black Silicon on crystalline silicon surface using SF6/O2 and SF6/O2/CH4 based plasmas in a reactive ion etching (RIE) system is presented. The effect of the RF power, chamber pressure, process time, gas flow rates, and gas mixtures on the texture of silicon surface has been analyzed. Completely Black Silicon surfaces containing pyramid like structures have been obtained, using an optimized mask-free plasma process. Moreover, the Black Silicon surfaces have demonstrated average values of 1% and 4% for specular and diffuse reflectance respectively, feature that is suitable for the fabrication of low cost solar cells. Keywords Plasma Texturing Solar cells 1 Introduction At the present time, solar cells based on crystalline silicon technology (mono c-Si and multi c-Si) represent close to 90% of the total photovoltaic (PV) market [1], in spite of their higher cost when are compared with other type of technologies, as thin film solar cells based on different semiconductor materials [2–4]. The tendency is likely to continue in the next years, due to the relative high efficiency of c-Si solar cells [5], the continuous research on fabrication processes to improve the cell performance and the continuous efforts in the reduction of fabrication costs. In this aspect, hetero-junction solar cells fabricated on 200μm thick c-Si wafers have been reported with high efficiencies (>22%) and solar cells fabricated on 70μm thick c-Si wafers have been demonstrated [6]. Among different processes under constant research to increase the solar cells efficiency is the improvement of light trapping in the silicon surface in order to reduce the amount of light reflected [7–16]. Photolithography-free texturing processes have been used in order to produce pyramid-like structures in the silicon surface, providing reflectance values below of 12% [7,8]. Chemical solutions based on potassium hydroxide (KOH) [7–10], sodium hydroxide (NaOH) [11–13] and tetramethyl ammonium hydroxide ((CH3)4NOH) [14,15] have been employed. However, despite the low reflectance values due pyramid structures produced with wet processes, they have several drawbacks. These processes cannot be performed just in one wafer face (front surface) as is required, since texturing in the back surface reduces the quality of the dielectric rear surface passivation [17]. For large volume production in PV industry, high amounts of deionized water (DI) and chemicals represent an environmental and financial issue. Recently dry texturing processes have attracted much attention in order to produce highly textured surfaces [18–21]. For instance, SF6/O2 plasmas have been used for texturing c-Si wafers [20,21]. It is known that fluorine radicals easily etch silicon, and moreover the addition of oxygen to fluorine enhance the texturing process [22]. On SF6/O2 plasmas two opposite effects take place: an etching process due to fluorine radicals which are very efficient for etch silicon, and a re-deposition process due to residual SiO x F y film, which produce a masking effect [22]. Those micro-masks enhance the texturing process of the c-Si surface. It have been demonstrated the use of SF6/O2 plasmas for texturing c-Si employing a microwave (MW) powered antennas reactor [18,19], and a reactive ion etching (RIE) which is a standard process in the microelectronics industry [21]. However the sponge-like and needle-like structures reported respectively, are not suitable for reliable solar cell processes. Other type of plasmas based on SF6/Cl2 and SF6/CHF3 mixtures, or CF4 have been investigated [19,23,24], and other techniques to produce Black Silicon are under research, as laser texturing [25], plasma immersion ion implantation [26], formation of vertical silicon nanowires or nanograss arrays [27–31], and silicon nanotips arrays on c-Si surface with high aspect ratio using clusters of SiC [32], all techniques in order to reduce the light reflection. Thus, despite the efforts made so far on plasma texturing, none of the reported structures are similar those obtained by wet chemical texturing, which are suitable for a reliable passivation of the c-Si front surface, and still exists a constant research on the development of more reliable and standard dry texturing processes. In this work we present a study on the formation of pyramid-like structures, providing a Black Silicon surface, using the traditional mixture SF6/O2 and we proposed a new mixture SF6/O2/CH4, produced in a reactive ion etching (RIE) system. The effect of the RF plasma power, chamber pressure, process time, gas flow rates, and gas mixtures, on the texture of the silicon surface has been studied. Completely Black Silicon surfaces with average values of 1% and 4% for specular and diffuse reflectance respectively were obtained, using an optimized mask-free plasma process. 2 Experimental Texturing processes were carried out in a home-made reactive ion etching (RIE) reactor. For all experiments the substrates consisted of (100) monocrystalline silicon (c-Si) wafers of 2.5cm×4cm. Mixtures of gases containing SF6, O2, and CH4 in different compositions were used, with a ranging of gas pressure from 25 to 200mTorr, and RF power from 75 to 200W. A self-bias potential between the electrodes was measured. In most experiments, etching time was selected to be 20min, but in order to optimize the Black Silicon effect; time was increased to 30 and 45min. An atomic force microscope (AFM, Nanosurf EasyScan 2.3) was used to analyze the surface roughness of the textured c-Si wafers, while a scanning electron microscope (JEOL JSM-7000F Field Emission Analytical Scanning Electron Microscope) was used to characterize the surface morphology. Finally, a spectrometer (Perkin-Elmer Lambda 3 UV/VIS) was used for surface reflectance characterization in a 200–900nm spectral range, and a spectrophotometer (Vector 22 Bruker) was employed to determine the surface composition by the IR spectra after texturing. 3 Results and discussion The DC self-bias voltage plays an important role in the Black Silicon formation; it is function of plasma parameters like RF power, pressure, and type and flow gas. This voltage controls the energy of ions arriving to the surface and it needs to be high in order to generate roughness on the surface. Fig. 1 shows the DC self-bias as a function of pressure (solid line) and RF power (dot line) for SF6/O2 and SF6/O2/CH4 gas mixtures for a constant flow rate of SF6 (30sscm), O2 (10sccm) and CH4 (4sccm). A typical behavior by ion-assisted etching is observed for both mixtures, DC bias increases as pressure decreases or RF power increases. The measured range of DC bias is between 10 and 300V. The highest values of DC bias are obtained when CH4 is incorporated to the SF6/O2 mixture; this effect can generate surface roughness. For these processes, Black Silicon surfaces are observed with roughness values around 30nm achieved by low DC self-bias voltages between 30 and 50V. In Fig. 2 , a set of SEM and AFM images of textured silicon surface are shown. A high density of pyramid-like structures is observed for all cases, however, the best results in terms of Black Silicon surface appearance are observed when CH4 is present in the gas mixture (as it was confirmed later with the reflectance characterization). For both mixtures, SF6/O2 and SF6/O2/CH4, under different conditions of pressure and RF power, the DC self-bias does not exhibit a considerable change, and a similar behavior with the roughness is observed, for this reason similar pyramid-like structures can be obtained. Texturing time was fixed in 20min for all samples. In the case of SF6/O2 plasmas, the Black Silicon formation is due to a competition among the etching process of silicon by fluorine radicals, the deposition of a SiO x F y film due the presence of oxygen, and the etching of this film by reactive ions like SF x +, fluorine and oxygen radicals as well. On the other hand, for SF6/O2/CH4 plasmas, another process contributes to the formation of Black Silicon, which is the deposition of a polymer CH x due the presence of methane. When CH4 is incorporated to the SF6/O2 mixture, the DC bias voltage is increased (as can be observed in Fig. 1). Ions can gain more energy and the passivation layer of polymer can be easily removed. Oxygen radicals also contribute to remove this polymer, and in this way the etching of silicon continues. In Fig. 2, all processes showed were textured during 20min. The best condition for the Black Silicon appearance was obtained for the SF6/O2/CH4 gas mixture with SF6 =30sccm, O2 =10sccm, CH4 =4sccm, 100W, 50mTorr, and 20min. In this case, the constant competition among etching of silicon, surface passivation for CH x or SiO x F y layers, and etching of these passivation layers promotes the formation of a Black Silicon surface. Fig. 3 shows the effect of the plasma texturing time using optimized conditions (SF6 =30sccm/O2 =10sccm/CH4 =4sccm, 100W, 50mTorr). For these conditions, the DC self-bias does not show a considerably increased when time is raised. However, the silicon surface appearance exhibits a considerably change. Optical microscopy images are inserted in Fig. 3A–C in order to illustrate how the surface color goes from dark gray to black as time increases. At relatively short plasma time (Fig. 3A – 20min), a low density of small and not well defined structures is observed. Even the structures are small in the c-Si surface at this stage; the color of the surface turns dark gray in comparison with the gray silicon surface without texturing. When time is increased (Fig. 3B – 30min), the roughness of the silicon surface increases as well and pyramid-like structures start to form until a high density is obtained at a larger plasma time. The time for this condition is 45min for texturing (Fig. 3C). In fact, a black appearance of the surface is obtained. Texturing time plays an important role to attain a Black Silicon surface. The main goal during the Black Silicon formation for solar-cells applications is to achieve a low c-Si surface reflectance. With this, most of the light arriving to the wafer surface can be absorbed, generating a higher electron concentration and consequently a higher short circuit current (J sc). Fig. 4 shows the specular surface reflectance as function of wavelength (200–900nm) of incident light in the textured samples processed under several conditions. The polished monocrystalline silicon sample without texturing, used as reference, exhibits the highest average reflectance (up to 35%). Reflectance decreases in the textured samples using both gas mixtures (SF6/O2 and SF6/O2/CH4). Moreover the lowest values of reflectance are observed in the samples textured using our optimized conditions for obtaining Black Silicon (SF6/O2/CH4 =30/10/4sccm, 100W, 50mTorr, and 45min). The average reflectance for this sample is 1%. Fig. 5 shows the diffuse surface reflectance as function of wavelength (400–700nm) using the integrating spheres technique. Reflectance values increase when compared with specular reflectance. According to the characteristics of the samples surface (roughness surface), integrating spheres technique exhibits more accurate measurements. However, it is important to observe that lowest values of reflectance remain when the SF6/O2/CH4 gas mixture is used. For the sample using our optimized conditions for Black Silicon, the average reflectance is 4%. When halocarbon gas is used in texturing of silicon surface (methane in our case), the deposition of a polymer-like layer is clearly important mainly if the application of texturing is solar cells. A carbon layer modifies the composition of the original c-Si material affecting the optical and electrical response. To obtain information about the surface composition of textured samples, IR spectra were obtained. Fig. 6 shows absorbance spectra for textured samples using SF6/O2 and SF6/O2/CH4, the spectrum of a layer of SiC is used to compare the presence of important bonds. CC bonding between 1500 and 1600cm−1, and CH x between 2800 and 3000cm−1 [33,34] are not observed in textured samples. Then, the effect of the formation of a carbon layer during the texturing process can therefore be neglected. The constant competition between etching and deposition processes during texturing, and the correct balance among plasma parameters like RF power, pressure and flow rates could guarantee Black Silicon surface without carbon layer. It is important to point out that the SF6/O2/CH4 gas mixture used in this work has not been reported in literature for plasma texturing, and the structures produced with the optimized process, are similar to those produced by wet texturing. These structures in the c-Si surface are suitable for a reliable surface passivation, than those reported for SF6/O2 gas mixtures [21]. 4 Conclusions The process for the formation of pyramid-like structures using a SF6/O2/CH4 gas mixture has been achieved. An optimized plasma texturing process (gas flow rates, RF power, and time) has resulted on Black Silicon, providing a very low specular and diffuse reflectance values in the textured wafer surface. Polymer formation due to the use of CH4 in the gas mixture is likely to enhance the micro-masking effect, resulting on the formation of a high density of pyramid-like structures. The constant competition between etching and deposition processes during texturing, and the correct balance among plasma parameters like RF power, pressure and flow rates could guarantee Black Silicon surface without polymer layer. Average values of 1% and 4% for specular and diffuse reflectance respectively have been measured on textured c-Si wafers, processed with our optimized plasma process. Those results are a very promising alternative for low cost fabrication of c-Si solar cells, since the process is completely dry, no DI water, wet chemicals or photolithography are used. Acknowledgment This research was partially supported by CONACyT projects 42906 and 154112. References [1] European Photovoltaic Industry Association Solar Generation V 2008 pp. 18–20 [2] K. Zweibel Sol. Energy Mater. Sol. Cells 63 2000 375 386 [3] R.W. Birkmire E. Eser Annu. Rev. Mater. Sci. 27 1997 625 653 [4] K.L. Chopra P.D. Paulson V. Dutta Prog. Photovolt: Res. Appl. 12 2004 69 92 [5] A.G. Martin Z. Jianhua W. Aihua R.W. Stuart IEE Trans. Electron. Devices 46 1999 1940 1947 [6] Y. Tsunomura Y. Yoshimine M. Taguchi T. Baba T. Kinoshita H. Kanno H. Sakata E. Maruyama M. Tanaka Sol. Energy Mater. Sol. Cells 93 2009 670 673 [7] D.L. King M. Elaine Buck Photovoltaic Specialist Conference IEEE 1991 303 308 [8] B. Katrin Z. Martin R. Jochen 23rd European Photovoltaic Solar Energy Conference Proceedings 2008 [9] J.M. Kim K.M. Young Sol. Energy Mater. Sol. Cells 81 2004 239 247 [10] A.K. Chu J.S. Wang Z.Y. Tsai C.K. Lee Sol. Energy Mater. Sol. Cells 93 2009 1276 1280 [11] E. Vazsonyi K. De Clercq R. Einhaus E. Van Kerschaver K. Said J. Poortmans J. Szlufcik J. Nijs Sol. Energy Mater. Sol. Cells 57 1999 179 188 [12] E. Matthew B. Stuart D. Ujjwal B. Michael Sol. Energy Mat. Sol. Cells 92 2008 1373 1377 [13] X. Zhenqiang Y. Deren D. Wu J. Chen L. Xianhang Q. Duanlin Renew. Energy 29 2004 2101 2107 [14] D. Iencinella E. Centurioni R. Rizzoli F. Zignani Sol. Energy Mater. Sol. Cells 87 2005 725 732 [15] P. Papet O. Nichiporuk A. Kaminski Y. Rozier J. Kraiem J.-F. Lelievre A. Chaumartin A. Fave M. Lemiti Sol. Energy Mater. Sol. Cells 90 2006 2319 2328 [16] U. Gangopadhyay K. Kim S.K. Dhungel P.K. Basu J. Yi Renew. Energy 31 2006 1906 1915 [17] S. De Wolf K. Schade H.F.W. Dekkers G. Beaucarne 20th European Photovoltaic Solar Energy Conference Proceedings 2005 729 732 [18] L. Carnel I. Gordon H. Dekkers F. Duekkers F. Duerinckx 21st European Photovoltaic Solar Energy Conference Proceedings 2006 830 833 [19] H.F.W. Dekkers G. Agostinelli D. Dechertoghe G. Beaucarne 19th European Photovoltaic Solar Energy Conference Proceedings 2004 412 415 [20] D.S. Ruby S.H. Zaidi S. Narayanan B.M. Damiani A. Rohatgi Sol. Energy Mater. Sol. Cells 74 2002 133 137 [21] J. Yoo K. Kim M. Thamilselvan N. Lakshminarayan Y.K. Kim J. Lee K.J. Yoo J. Yi J. Phys. D: Appl. Phys. 2008 1 7 [22] J. Henri B. Meint de L. Rob E. Miko J. Micromech. Microeng. 5 1995 115 120 [23] Y.F. Chang Q.R. Chou J.Y. Lin C.H. Lee Appl. Phys. A 86 2007 193 196 [24] R. Di Mundo M. Ambrico P.F. Ambrico R. d’Agostino F. Italiano F. Palumbo Plasma Process. Polym. 8 2011 239 245 [25] A.Y. Vorobyev G. Chunlei Appl. Surf. Sci. 257 2011 7291 7294 [26] Y. Xia B. Liu J. Liu Z. Shen C. Li Solar Energy 85 2011 574 1578 [27] D. Kumar S.K. Srivastava P.K. Singh M. Husain V. Kumar Sol. Energy Mater. Sol. Cells 95 2011 215 218 [28] Y.J. Hung S.L. Lee B.J. Thibeault L.A. Coldren IEEE J. Sel. Top. Quant. 17 2011 869 877 [29] J.S. Li H.Y. Yu Y.L. Li Nanoscale 3 2011 4888 4900 [30] S.K. Srivastava D. Kumar P.K. Singh M. Kar V. Kumar M. Husain Sol. Energy Mater. Sol. Cells 94 2010 1506 1511 [31] J. Shieh S. Ravipati F.H. Ko K. Ostrikov J. Phys. D: Appl. Phys. 44 2011 174010 [32] C.H. Hsu H.C. Lo C.F. Chen C.T. Wu J.S. Hwang D. Das J. Tsai L.C. Chen K.H. Chen Nano Lett. 4 2004 471 475 [33] R.A. Meyers Encyclopedia of Analytical Chemistry 2000 10815 10837 [34] Y.S. Park H.S. Myung J.G. Han B. Hong Thin Solid Films 482 2005 275 279", "scopus-id": "84866010803", "coredata": {"eid": "1-s2.0-S0921510712002012", "dc:description": "A study on the formation of Black Silicon on crystalline silicon surface using SF6/O2 and SF6/O2/CH4 based plasmas in a reactive ion etching (RIE) system is presented. The effect of the RF power, chamber pressure, process time, gas flow rates, and gas mixtures on the texture of silicon surface has been analyzed. Completely Black Silicon surfaces containing pyramid like structures have been obtained, using an optimized mask-free plasma process. Moreover, the Black Silicon surfaces have demonstrated average values of 1% and 4% for specular and diffuse reflectance respectively, feature that is suitable for the fabrication of low cost solar cells.", "openArchiveArticle": "false", "prism:coverDate": "2012-09-20", "openaccessUserLicense": null, "prism:aggregationType": "Journal", "prism:url": "https://api.elsevier.com/content/article/pii/S0921510712002012", "dc:creator": [{"@_fa": "true", "$": "Murias, D."}, {"@_fa": "true", "$": "Reyes-Betanzo, C."}, {"@_fa": "true", "$": "Moreno, M."}, {"@_fa": "true", "$": "Torres, A."}, {"@_fa": "true", "$": "Itzmoyotl, A."}, {"@_fa": "true", "$": "Ambrosio, R."}, {"@_fa": "true", "$": "Soriano, M."}, {"@_fa": "true", "$": "Lucas, J."}, {"@_fa": "true", "$": "Cabarrocas, P. Roca i"}], "link": [{"@_fa": "true", "@rel": "self", "@href": "https://api.elsevier.com/content/article/pii/S0921510712002012"}, {"@_fa": "true", "@rel": "scidir", "@href": "https://www.sciencedirect.com/science/article/pii/S0921510712002012"}], "dc:format": "application/json", "openaccessType": null, "pii": "S0921-5107(12)00201-2", "prism:volume": "177", "prism:publisher": "Elsevier B.V.", "dc:title": "Black Silicon formation using dry etching for solar cells applications", "prism:copyright": "Copyright © 2012 Elsevier B.V. All rights reserved.", "prism:issueName": "Advances in Semiconducting Materials", "openaccess": "0", "prism:issn": "09215107", "prism:issueIdentifier": "16", "dcterms:subject": [{"@_fa": "true", "$": "Plasma"}, {"@_fa": "true", "$": "Texturing"}, {"@_fa": "true", "$": "Solar cells"}], "openaccessArticle": "false", "prism:publicationName": "Materials Science and Engineering: B", "prism:number": "16", "openaccessSponsorType": null, "prism:pageRange": "1509-1513", "prism:endingPage": "1513", "pubType": "sco", "prism:coverDisplayDate": "20 September 2012", "prism:doi": "10.1016/j.mseb.2012.03.038", "prism:startingPage": "1509", "dc:identifier": "doi:10.1016/j.mseb.2012.03.038", "openaccessSponsorName": null}, "objects": {"object": [{"@category": "standard", "@height": "319", "@width": "374", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0921510712002012-gr1.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "30986", "@ref": "gr1", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "164", "@width": "192", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0921510712002012-gr1.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "3319", "@ref": "gr1", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "335", "@width": "590", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0921510712002012-gr2.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "92199", "@ref": "gr2", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "124", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0921510712002012-gr2.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "13988", "@ref": "gr2", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "199", "@width": "627", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0921510712002012-gr3.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "62097", "@ref": "gr3", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "69", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0921510712002012-gr3.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "8093", "@ref": "gr3", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "261", "@width": "339", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0921510712002012-gr4.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "37016", "@ref": "gr4", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "164", "@width": "213", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0921510712002012-gr4.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "4896", "@ref": "gr4", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "299", "@width": "380", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0921510712002012-gr5.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "40761", "@ref": "gr5", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "164", "@width": "208", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0921510712002012-gr5.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "4656", "@ref": "gr5", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "271", "@width": "362", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0921510712002012-gr6.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "31893", "@ref": "gr6", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "164", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0921510712002012-gr6.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "4446", "@ref": "gr6", "@mimetype": "image/gif"}]}, "link": {"@rel": "abstract", "@href": "https://api.elsevier.com/content/abstract/scopus_id/84866010803"}}