{"scopus-eid": "2-s2.0-84975799344", "originalText": "serial JL 271495 291210 291731 291732 291746 291809 291864 291865 291892 291893 31 Solar Energy Materials and Solar Cells SOLARENERGYMATERIALSSOLARCELLS 2016-04-22 2016-04-22 2016-04-22 2016-04-22 2016-08-26T08:09:38 1-s2.0-S0927024816300289 S0927-0248(16)30028-9 S0927024816300289 10.1016/j.solmat.2016.04.014 S300 S300.3 FULL-TEXT 1-s2.0-S0927024816X00074 2016-08-26T05:20:02.364623-04:00 0 0 20160801 20160831 2016 2016-04-22T01:04:11.420703Z articleinfo articletitlenorm authfirstinitialnorm authfirstsurnamenorm cid cids contenttype copyright crossmark dateloaded dateloadedtxt datesearch datesort dateupdated dco docsubtype doctype doi eid ewtransactionid hubeid indexeddate issn issnnorm itemstage itemtransactionid itemweight openaccess openarchive pg pgfirst pglast pii piinorm pubdateend pubdatestart pubdatetxt pubyr sortorder srctitle srctitlenorm srctype ssids alllist content subj subheadings suppl tomb volfirst volissue volumelist webpdf webpdfpagecount yearnav figure body mmlmath acknowledge affil articletitle auth authfirstini authfull authkeywords authlast grantnumber grantsponsor highlightsabst primabst ref 0927-0248 09270248 true 153 153 C Volume 153 4 18 24 18 24 201608 August 2016 2016-08-01 2016-08-31 2016 article fla © 2016 Elsevier B.V. All rights reserved. VERSATILESTRATEGIESFORIMPROVINGPERFORMANCEDIAMONDWIRESAWNMCSISOLARCELLS ZHUANG Y 1 Introduction 2 Experimental 2.1 Texturization of diamond wire sawn wafers 2.2 Fabrication of the DWS mc-Si solar cells 2.3 Characterization 3 Result and discussion 3.1 The comparison of DWS and CMWS mc-Si wafers 3.2 Surface morphology by a new method based on MACE 3.3 Optical characteristics and electrical analysis 3.4 Cell performance 4 Conclusions Acknowledgments References CHEN 2014 220 W WATANABE 2010 485 N MEINEL 2012 330 B CLARK 2003 523 W YU 2012 337 X CHEN 2015 148 K KUMAGAI 2015 216 A LIPPOLD 2014 104 M STAPF 2015 16 A CAO 2015 132 F MANN 2014 1180 S RUBYA 2002 133 D TOOR 2011 103501 F OH 2012 743 J HUANG 2015 302 Z ZHONG 2015 555 S LI 2014 242 S HUANG 2011 285 Z CHARTIER 2008 5509 C HUANG 2015 964 Z KIM 2012 782 J LIN 2013 235402 X YUAN 2009 123501 H ZHUANGX2016X18 ZHUANGX2016X18X24 ZHUANGX2016X18XY ZHUANGX2016X18X24XY 2018-04-22T00:00:00Z UnderEmbargo http://creativecommons.org/licenses/by-nc-nd/4.0/ © 2016 Elsevier B.V. All rights reserved. item S0927-0248(16)30028-9 S0927024816300289 1-s2.0-S0927024816300289 10.1016/j.solmat.2016.04.014 271495 2016-08-26T05:20:02.364623-04:00 2016-08-01 2016-08-31 1-s2.0-S0927024816300289-main.pdf https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024816300289/MAIN/application/pdf/3b87b85b9eb59005034717f086f386c8/main.pdf https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024816300289/MAIN/application/pdf/3b87b85b9eb59005034717f086f386c8/main.pdf main.pdf pdf true 4198091 MAIN 7 1-s2.0-S0927024816300289-main_1.png https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024816300289/PREVIEW/image/png/dd77679fcc11f2ddc49d6c53f41da8a3/main_1.png https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024816300289/PREVIEW/image/png/dd77679fcc11f2ddc49d6c53f41da8a3/main_1.png main_1.png png 60536 849 656 IMAGE-WEB-PDF 1 1-s2.0-S0927024816300289-gr1.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024816300289/gr1/THUMBNAIL/image/gif/0c309dd29a00e61ca4151b2e8561a4b1/gr1.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024816300289/gr1/THUMBNAIL/image/gif/0c309dd29a00e61ca4151b2e8561a4b1/gr1.sml gr1 gr1.sml sml 19822 118 219 IMAGE-THUMBNAIL 1-s2.0-S0927024816300289-gr3.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024816300289/gr3/THUMBNAIL/image/gif/0e56269706dc29d7a8ec0561eb26fa78/gr3.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024816300289/gr3/THUMBNAIL/image/gif/0e56269706dc29d7a8ec0561eb26fa78/gr3.sml gr3 gr3.sml sml 23839 164 108 IMAGE-THUMBNAIL 1-s2.0-S0927024816300289-gr4.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024816300289/gr4/THUMBNAIL/image/gif/12c447736091eca0fdbf3af8bfe3555a/gr4.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024816300289/gr4/THUMBNAIL/image/gif/12c447736091eca0fdbf3af8bfe3555a/gr4.sml gr4 gr4.sml sml 23744 164 207 IMAGE-THUMBNAIL 1-s2.0-S0927024816300289-gr5.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024816300289/gr5/THUMBNAIL/image/gif/dabdab0c381371c5b4fe9946f88e13ab/gr5.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024816300289/gr5/THUMBNAIL/image/gif/dabdab0c381371c5b4fe9946f88e13ab/gr5.sml gr5 gr5.sml sml 21841 164 125 IMAGE-THUMBNAIL 1-s2.0-S0927024816300289-gr2.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024816300289/gr2/THUMBNAIL/image/gif/de9005031240940197f781fe1309b298/gr2.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024816300289/gr2/THUMBNAIL/image/gif/de9005031240940197f781fe1309b298/gr2.sml gr2 gr2.sml sml 24090 164 109 IMAGE-THUMBNAIL 1-s2.0-S0927024816300289-gr1.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024816300289/gr1/DOWNSAMPLED/image/jpeg/851fd160ad9b9ce3f9619e4ff8f84d53/gr1.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024816300289/gr1/DOWNSAMPLED/image/jpeg/851fd160ad9b9ce3f9619e4ff8f84d53/gr1.jpg gr1 gr1.jpg jpg 81415 366 678 IMAGE-DOWNSAMPLED 1-s2.0-S0927024816300289-gr3.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024816300289/gr3/DOWNSAMPLED/image/jpeg/13f2893f6dc410f1b13d0a6a9d116c20/gr3.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024816300289/gr3/DOWNSAMPLED/image/jpeg/13f2893f6dc410f1b13d0a6a9d116c20/gr3.jpg gr3 gr3.jpg jpg 284933 978 646 IMAGE-DOWNSAMPLED 1-s2.0-S0927024816300289-gr4.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024816300289/gr4/DOWNSAMPLED/image/jpeg/64c21cce58403f3ce9e01cb19e1b2af8/gr4.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024816300289/gr4/DOWNSAMPLED/image/jpeg/64c21cce58403f3ce9e01cb19e1b2af8/gr4.jpg gr4 gr4.jpg jpg 147865 596 755 IMAGE-DOWNSAMPLED 1-s2.0-S0927024816300289-gr5.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024816300289/gr5/DOWNSAMPLED/image/jpeg/256ff4f4c7776acd337e85f495bdbf25/gr5.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024816300289/gr5/DOWNSAMPLED/image/jpeg/256ff4f4c7776acd337e85f495bdbf25/gr5.jpg gr5 gr5.jpg jpg 104634 492 376 IMAGE-DOWNSAMPLED 1-s2.0-S0927024816300289-gr2.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024816300289/gr2/DOWNSAMPLED/image/jpeg/3da01fd6742b8772986e8ac4dd293a6b/gr2.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024816300289/gr2/DOWNSAMPLED/image/jpeg/3da01fd6742b8772986e8ac4dd293a6b/gr2.jpg gr2 gr2.jpg jpg 230357 978 651 IMAGE-DOWNSAMPLED 1-s2.0-S0927024816300289-si0001.gif https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024816300289/STRIPIN/image/gif/6642b8a342b6e199c1c0d2f4da26ba2c/si0001.gif https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024816300289/STRIPIN/image/gif/6642b8a342b6e199c1c0d2f4da26ba2c/si0001.gif si0001 si0001.gif gif 1277 42 177 ALTIMG 1-s2.0-S0927024816300289-si0002.gif https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024816300289/STRIPIN/image/gif/a66149a1a68ef0bf8c87cf0f65829106/si0002.gif https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024816300289/STRIPIN/image/gif/a66149a1a68ef0bf8c87cf0f65829106/si0002.gif si0002 si0002.gif gif 129 12 9 ALTIMG SOLMAT 8238 S0927-0248(16)30028-9 10.1016/j.solmat.2016.04.014 Elsevier B.V. Fig. 1 Schematic illustration of the main steps preparing the CM-T, N-T, M-T and N/M-T on DWS mc-Si wafers. Fig. 1 Fig. 2 SEM images of mc-Si wafers: (a) as-cut CMWS wafers (b) as-cut DWS wafers (c) routine textured CMWS wafers, and (d) routine textured DWS wafers. Surface photos of DWS mc-Si wafers: (e) as-cut wafers, and (f) HF/HNO3 etched wafers. Fig. 2 Fig. 3 SEM images of the textured wafers: (a) N-T, (b) M-T, (c) N/M-T. (a′)–(c′) are the enlargements of (a)–(c), together with the SEM images of the cross-section of the wafers in the inset. Fig. 3 Fig. 4 (a) Reflectance spectra (400–1100nm) of the as-etched and SiN x -coated CM-T, N-T, M-T and N/M-T. (b) Averaged reflectance of the reflectance spectra shown in (a). (c) Experimental IQE and PC1D-fitting IQE of the CM-T, N-T, M-T and N/M-T based solar cells, together with the zoomed-in IQE spectra ranging from 400–600nm in the inset. (d) Experimental EQE of the CM-T, N-T, M-T and N/M-T based solar cells. Fig. 4 Fig. 5 Cell performance: (a) V OC, (b) I SC, (c) FF and (d) η for CM-T, N-T, M-T and N/M-T based solar cells. The yellow dots represent the experimental data while the height of the histograms represents the averaged value of the data. (e) I–V, P–V characteristics and the photograph of the highest-efficient N/M-T based DWS mc-Si solar cell. (For interpretation of the references to color in this figure legend, the reader is referred to the web version of this article.) Fig. 5 Versatile strategies for improving the performance of diamond wire sawn mc-Si solar cells Y.F. Zhuang a S.H. Zhong a Z.G. Huang a b W.Z. Shen a c ⁎ a Institute of Solar Energy, and Key Laboratory of Artificial Structures and Quantum Control (Ministry of Education), Department of Physics and Astronomy, Shanghai Jiao Tong University, Shanghai 200240, People׳s Republic of China Institute of Solar Energy, and Key Laboratory of Artificial Structures and Quantum Control (Ministry of Education), Department of Physics and Astronomy, Shanghai Jiao Tong University Shanghai 200240 People׳s Republic of China b School of Science, Huaihai Institute of Technology, Lianyungang 222005, Jiangsu Province, People׳s Republic of China School of Science, Huaihai Institute of Technology Lianyungang Jiangsu Province 222005 People׳s Republic of China c Collaborative Innovation Center of Advanced Microstructures, Nanjing 210093, People׳s Republic of China Collaborative Innovation Center of Advanced Microstructures Nanjing 210093 People׳s Republic of China ⁎ Corresponding author. Unlike conventional multi-wire sawn (CMWS) multi-crystalline silicon (mc-Si) wafers, diamond wire sawn (DWS) mc-Si wafers textured by conventional acidic solution of HF/HNO3 are not suitable for solar cells because visible saw marks set significant barriers in both cell performance and surface appearance. In this work, we have employed versatile strategies based on metal-assisted chemical etching (MACE) technique to eliminate the saw marks and realize effective surface textures on DWS mc-Si wafers, including nano-texture (N-T), micro-texture (M-T) and nano/micro-texture (N/M-T). Especially, benefiting from the tradeoff between optical gain and electrical loss, the efficiency of 18.45% for N/M-T based DWS mc-Si solar cells with a standard wafer size of 156×156mm2 is reported to be higher by an absolute 0.57% compared with that of CMWS mc-Si solar cells (17.88%). Our work provides ways of fabricating DWS mc-Si solar cells with high efficiencies and satisfactory visual appearance. Keywords Solar cell Diamond wire sawn Multicrystalline silicon Metal-catalyzed chemical etching Nano/micro-texture 1 Introduction Diamond wire sawing (DWS) technique is widely used in cutting hard and brittle non-metallic materials [1]. In the photovoltaic (PV) industry, DWS has been used in slicing single crystalline silicon (sc-Si) and multi-crystalline silicon (mc-Si) in recent years. Compared with conventional multi-wire sawing (CMWS) with slurry of SiC abrasives, DWS has several advantages including higher productivity, lower material waste, higher precision in cutting thin wafers and less surface mechanical damages [2–6]. More importantly, the conversion efficiency (η) of DWS sc-Si solar cells is over 19% in a traditional industrial production line [7], which is comparable to the η of slurry sawn ones. Therefore, DWS is expected to become the mainstream technique for Si-based solar cells in the near future. Unfortunately, the production of DWS mc-Si solar cells is not so successful due to the ineffective surface texturization. In the PV industry, acidic solution of HF/HNO3 is most commonly used in fabricating CMWS mc-Si solar cells [8,9]. During the etching, the surface defects are removed and micron-pits are formed randomly. Unlike CMWS wafers, which are characterized by a thicker damaged layer with random distribution of broken crystals, a lower rough surface with parallel deep saw marks is observed on DWS wafers [2,10]. Resulting from nonuniform etching of the saw marks, DWS mc-Si wafers cannot form an effective texture by this method and the surface reflectance is still higher than 25% [8,11]. Since 80% of mc-Si wafers will be sawn with diamond wires by 2020 [12], it is an urgent affair to realize an effective texture method for DWS mc-Si wafers. Although reactive ion etching is effective for texturization of mc-Si wafers [13,14], it is not suitable for the PV industry due to the high cost. On the other hand, recent researches shows that effective surface textures with Si nanostructures can be easily formed on silicon wafers by metal-assisted chemical etching (MACE) [15–18], which is simple, cost-effective and compatible with current production lines. In this study, we present versatile strategies to realize effective surface textures on DWS mc-Si wafers based on the MACE technique, including nano-texture (N-T), micro-texture (M-T) and nano/micro-texture (N/M-T). We have demonstrated that all the N-T, M-T and N/M-T based solar cells exhibit higher η than the conventional micro-textured (CM-T) cells. Especially, for the N/M-T based cells, their average η is increased by 0.57% absolutely, reaching 18.45% on a large wafer size of 156×156mm2, which is attributed to its both better optical and electrical properties. Furthermore, our results reveal that the saw marks have negative influence on the electrical properties of the solar cells but fortunately can be resolved by our texturing methods. 2 Experimental 2.1 Texturization of diamond wire sawn wafers In this work, the used silicon wafers were p-type DWS mc-Si with a size of 156×156mm2, a thickness of 200±20μm and resistivity of 1–3Ωcm. The main steps for texturization of the wafers are shown in Fig. 1. Deionized water (DIW) cleaning was performed after every step. CM-T was prepared by immersing the wafers in the mixed acid solution of HF:HNO3:DIW=1:5:4 (volume ratio) for 3min at 8°C. N-T, M-T and N/M-T were obtained by multiple-etching processes based on MACE technique. The wafers were firstly dipped into MACE solution (2.6M HF/1.1M H2O2/0.0002M AgNO3) for 5mins at 45°C. In this process, Ag nanoparticles were deposited onto the silicon and nano-holes were obtained. After that, one group of the wafers were placed in the etching solution of NaOH (5wt%) for 5min to form the N-T. Another group of the wafers were immersed into the HF/HNO3 mixed solution for 3min at 8°C. As a result, nano-holes were expanded, and M-T was obtained. Then, a set of the M-T wafers were placed in MACE solution for 5min again, followed by NaOH etching for 5min to form the N/M-T. Finally, all the textured wafers were immersed in the HNO3:DIW=1:1 (volume ration) for 10min to remove the residual metal impurities, followed by rinsing with DIW and spin-drying. Here, after all the processes, the removing of the silicon wafers is about 3–4μm on each side. 2.2 Fabrication of the DWS mc-Si solar cells After the texturization, all the wafers underwent the same standard industrial solar cell fabricating process, including diffusion, SiN x :H coating and screen printing. The wafers were firstly placed in a tube furnace for about 100min at 800°C by using POCl3 as doping source. Then, the phosphosilicate glass was removed by HF solution (9% by volume). After that, SiN x :H was deposited on the front surface as the antireflection and passivation layer by plasma enhanced chemical vapor deposition for 40min at 400°C. Finally, the fabrication of front and back electrodes were performed by the screen-printing, followed by a co-firing step at 750°C for 30s. 2.3 Characterization The morphologies of the wafers were investigated by field emission scanning electron microscopy (FE-SEM) (Zeiss Ultra Plus). The reflectance spectra together with the internal quantum efficiency (IQE) and external quantum efficiency (EQE) were measured by QEX10 (PV MEASUREMENTS). And the electrical parameters of the solar cells were measured under AM1.5 spectrum at the temperature of 25°C. 3 Result and discussion 3.1 The comparison of DWS and CMWS mc-Si wafers Fig. 2(a–d) shows the SEM images of as-cut CMWS and DWS mc-Si wafers, together with the images of the wafers after a routine texture process. For as-cut CMWS wafers shown in Fig. 2(a), the surface damage features randomly distributed cracks and fissures. In contrast, irregular surface damage of parallel grooves, smooth areas, cracks and damaged pits is observed on as-cut DWS wafers [Fig. 2(b)]. Both as-cut CMWS and DWS wafers underwent the same HF/HNO3 etching to remove the damage layer and form microstructures on the surface. As shown in Fig. 2(c), for as-etched CMWS wafers, wormlike pits with the size of about 3μm in width are formed randomly on the whole surface. However, for as-etched DWS wafers, CM-T characterized by parallel grooves with different sizes closely formed on the Si surface is observed. Among them, the narrow grooves consist of elliptical pits with the opening size of about 2μm in width while the elliptical pits oriented along the wide grooves are about 4μm in width [Fig. 2(d)]. Although the saw marks are less noticeable compared with the as-cut ones, the HF/HNO3 etching fail to eliminate them [see surface photos of as-cut DWS mc-Si wafers in Fig. 2(e) and HF/HNO3 etched wafers in Fig. 2(f)]. 3.2 Surface morphology by a new method based on MACE In order to eliminate the saw marks and realize effective surface textures on DWS mc-Si wafers, systematic investigation was conducted in this work. Fig. 3 illustrates the SEM images of the textured DWS mc-Si wafers. By employing MACE technique, followed by NaOH etching, the saw marks are nearly removed [Fig. 3(a)] and inverted-pyramid-like N-T is formed [Fig. 3(a′)]. The average size of the N-T is about 700nm in width and 600nm in height. On the other hand, a group of the wafers are immersed in HF/HNO3 solution after MACE process, leading to the formation of M-T as shown in Fig. 3(b) and (b′). The surface is covered with round pits with the size of about 2μm in diameter and about 500nm in height. Compared with CM-T, only few string structures can be found. In order to reduce the reflectance of the surface and enhance the optical gain, we have further fabricated N/M-T, which is characterized by nanostructures (about 400nm in width) embedded in micro pits (about 2μm in diameter), as illustrated in Fig. 3(c) and (c′). The structures are uniformly formed on the whole surface and no string structures can be found, which implies that all the saw marks are removed. We propose the following chemical etching mechanism to understand how the saw marks are removed. MACE is a local electrochemical process with the metal particles acting as a local cathode and the Si substrate as the anode. In a typical MACE process, Ag nanoparticles are firstly deposited onto the surface of the Si substrate and inject holes into the valence band of Si, resulting in the oxidization of Si. Then the Si oxide is removed by HF. As a result, the Ag particles generate pits on the Si substrate. In the meantime, the surface is also etched by HF/H2O2. According to the results proved in Refs. [19–21], the dissolution rate of Si is faster at the Ag–Si interface than the one on Ag-free Si substrate due to the catalytic role of the Ag particles, leading to the expansion of pits under the Ag particles. With increasing etching time, the pits are expanded into cylindrical pores and the Ag particles sink at the bottom of the pores. On the one hand, after further etching in NaOH solution, inverted-pyramid-like N-T is formed owing to the anisotropic etching of Si. At the same time, general corrosion of the Si substrate helps to shallow the saw marks. On the other hand, HF/HNO3 etching after MACE process is also effective in easing off the saw marks but forms sphere-like M-T. The cylindrical pores are enlarged and connected to each other, resulting in the elimination of the narrow saw marks, while deep saw marks become shallower due to the general corrosion of Si surface. After multiple-etching processes (sequentially, MACE process, HF/HNO3 etching, MACE process and NaOH etching), all the saw marks are completely removed in N/M-T [Fig. 3(c)]. 3.3 Optical characteristics and electrical analysis As we all know, there are two main processes when the solar cell works, including generation of photocarriers and collection of photocarriers. In the former process, the optical character directly affects the number of the photons entering into the solar cells [15,22]. And electrical loss determines the number of the collected carriers in the latter process. Therefore, we investigate the influence of the surface structures on both optical and electrical properties to find an efficient texture for DWS mc-Si solar cells. Fig. 4(a) presents the reflectance spectra of the CM-T, N-T, M-T, and N/M-T for the as-etched and SiN x -coated cases in the wavelength ranging from 400nm to 1100nm. For the as-etched cases, the reflectance of CM-T and M-T is nearly the same in the whole wavelength range while the reflectance spectrum of N-T is a little lower than the one of N/M-T. However, the reflectance of nanostructure contained surface (N-T and N/M-T) is much lower than the one of microstructure based surface (CM-T and M-T) in the whole wavelength range, which is attributed to the strong forward light scattering of the nanostructures in the short wavelength range and the gradual decrease of effective refractive index in the long wavelength range by the formed density-graded layer. For SiN x -coated CM-T and M-T cases, antireflection effect is enhanced in the whole wavelength range, especially in the destructive interference region (about 750–950nm). The reflectance is lower than 5% in this region but increases drastically in the short wavelength range with the highest value of about 35%. In contrast, for SiN x -coated N-T and N/M-T cases, the reflectance at short wavelength is suppressed due to effective antireflection of the nanostructures and excellent broadband antireflection is achieved. The averaged reflectance (R ave) for the cases mentioned above is illustrated in Fig. 4(b). Here, R ave is calculated by averaging the reflectance over the standard AM1.5 spectrum in the wavelength ranging from 400nm to 1100nm as follows: (1) R ave = ∫ 400 nm 1100 nm R ( λ ) ⋅ S ( λ ) ⋅ d λ ∫ 400 nm 1100 nm S ( λ ) ⋅ d λ where R( λ ) represents the experimental reflectance and S( λ ) represents the standard AM1.5 solar photon spectral distribution. The R ave of the as-etched CM-T, N-T, M-T and N/M-T is 29.6%, 14.4%, 29.4% and 15.9%, respectively, and is reduced by a factor of 3 (11.4% for CM-T, 5.2% for N-T, 11.6% for M-T and 5.6% for N/M-T) after coating with SiN x thin films. The results show that SiN x coating is an effective technique to reduce reflectance on different structures. On the other hand, in order to investigate the influence of morphology on electrical loss, the IQE of CM-T, N-T, M-T and N/M-T based solar cells is tested, as illustrated in Fig. 4(c), together with the corresponding ones simulated by PC1D. The inset presents the zoomed-in IQE spectra from 400–600nm. It is found that the IQE decreases over the whole wavelength range with the formation of nanostructures, particularly at short wavelength. In addition, it is worth noting that the M-T based cells exhibit higher IQE, compared with CM-T based cells, suggesting that the elimination of the saw marks benefits the reduction of electrical loss. Actually, resulting from a “dead layer” (DL) from the heavily doped Si emitter [23], the surface and Auger recombination dominates the degradation of IQE in the short wavelength region. In our cases, we treat the nanostructures and the saw marks as a low lifetime DL and simulate the IQE with PC1D software to evaluate the DL thickness, as reported in the literatures [24,25]. Note that, our simulated IQE spectra match well with the experimental ones [see Fig. 4(c)], which guarantees the reliability. For N-T and N/M-T based cells, the thickness of the DL is 220 and 170nm, respectively. The results indicate that the surface and Auger recombination becomes worse with the increasing height of nanostructures. Furthermore, M-T based cells exhibit a thinner DL of 80nm, compared with that of CM-T based cells (110nm), suggesting that eliminating the saw marks can reduce the electrical loss and enhance IQE. Here, in order to evaluate the comprehensive influence of optical gain and electrical loss on cell performance, we illustrate in Fig. 4(d) the EQE data of the cells mentioned above. Obviously, the EQE of M-T is higher than that of CM-T in nearly the whole wavelength range, which implies that the elimination of the saw marks can significantly benefit the electrical performance of the cells. On the other hand, although suffering from worse surface recombination and Auger recombination, N-T and N/M-T based cells exhibit higher EQE at short wavelength attributed to remarkable antireflection effect of the nanostructures, compared with CM-T and M-T based cells. However, N-T based cells exhibit low EQE at long wavelength due to severe electrical loss. In contrast, for N/M-T based cells, the EQE value remains at a high level in the whole wavelength ranging from 550nm to 950nm, benefiting from the tradeoff between the optical gain and electrical loss. 3.4 Cell performance Fig. 5(a–d) illustrates the measured output parameters including short circuit current (I sc), open circuit voltage (V oc), fill factor (FF) and η of the CM-T, N-T, M-T and N/M-T based DWS mc-Si solar cells (the yellow dots represent the experimental data while the height of the histograms represents the averaged value of the data.). Obviously, compared with CM-T based cells, all the N-T, M-T and N/M-T based cells exhibit higher I sc, V oc (except N-T based cells) and η, suggesting that our methods based on MACE are effective for the texturization of DWS mc-Si solar cells. For N-T based cells, the I sc of 8.756A is much higher than 8.617A of CM-T based cells, which is attributed to the outstanding antireflection performance of the nanostructures, while the performance degradation of V OC occurs due to the worse surface and Auger recombination. On the other hand, resulting from less electrical loss by eliminating the saw marks, M-T based cells exhibit high V OC of 634.3mV, which is higher by 2.1mV compared with 632.2mV of the CM-T based cells, together with I sc of 8.743A (higher than the one of CM-T based cells but a little lower than the one of N-T based cells). Moreover, benefiting from the tradeoff between optical gain and electrical loss, N/M-T based cells exhibit good performance in both I sc and V oc and thus possess the highest η of 18.45% among all the cells, which is higher by an absolute 0.57% compared with 17.88% of CM-T based cells. In addition, as shown in Fig. 5(c), the difference among the FF of the cells is not obvious, which implies that the surface morphology has nearly no influence on FF. Fig. 5(e) presents the current–voltage (I–V) and power–voltage (P–V) characteristics of the N/M-T based solar cell, together with the photograph of the cell. The maximum output power reaches 4.49W on the wafer size of 243.36cm2, and the whole surface of the cell exhibits the color of dark blue, which is a satisfying color in industry. 4 Conclusions In summary, DWS mc-Si wafers cannot be effectively textured by conventional methods due to the nonuniform etching of the saw marks, exhibiting high reflectance (about 12% in average after SiN x coating) and poor electrical properties. In this work, we have presented effective texture methods for DWS mc-Si wafers based on MACE technique. We have successfully fabricated high-efficiency N-T, M-T, N/M-T based DWS mc-Si solar cells on the standard wafer size of 156×156mm2. From the study of optical characteristics, we find that the reflectance can be suppressed to a low level with the formation of nanostructures (about 5% in average after SiN x coating), especially at short wavelength. However, at the same time, electrical loss from the surface recombination and Auger recombination becomes severe owing to the heavily doped Si emitter. Benefiting from the tradeoff between the optical gain and electrical loss, we have realized the N/M-T based DWS mc-Si solar cells with a high η of 18.45%, which is higher by an absolute 0.57% compared with 17.88% of CM-T based cells. Note that this technique also removes all the saw marks in DWS mc-Si wafers. Our work provides ways of fabricating DWS mc-Si solar cells with high efficiencies and satisfactory visual appearance. Acknowledgments This work was supported by the Natural Science Foundation of China (61234005, 11474201 and 11174202) and Natural Science Foundation of Jiangsu Province (BK20151284). References [1] W.H. Chen X.M. Liu M. Li C.Q. Yin L. Zhou On the nature and removal of saw marks on diamond wire sawn multicrystalline silicon wafers Mater. Sci. Semicond. Process. 27 2014 220 [2] N. Watanabe Y. Kondo D. Ide T. Matsuki H. Takato I. Sakata Characterization of polycrystalline silicon wafers for solar cells sliced with novel fixed-abrasive wire Prog. Photovolt. Res. Appl. 18 2010 485 [3] B. Meinel T. Koschwitz J. Acker Textural development of SiC and diamond wire sawed sc-silicon wafer Energy Procedia 27 2012 330 [4] W.I. Clark A.J. Shih C.W. Hardin R.L. Lemaster S.B. McSpadden Fixed abrasive diamond wire machining—Part I: process monitoring and wire tension force Int. J. Mach. Tools Manuf. 43 2003 523 [5] A. Bidiville, K. Wasmer, R. Kraft, C. Ballif, Diamond wire-sawn silicon wafers-from the lab to the cell production, in: Proceedings of the 24th EU PV-SEC, 2009. [6] X.G. Yu P. Wang X.Q. Li D.R. Yang Thin Czochralski silicon solar cells based on diamond wire sawing technology Sol. Energy Mater. Sol. Cells 98 2012 337 [7] K.X. Chen Y.Y. Liu X.S. Wang L.J. Zhang X.D. Su Novel texturing process for diamond-wire-sawn single-crystalline silicon solar cell Sol. Energy Mater. Sol. Cells 133 2015 148 [8] A. Kumagai Texturization using metal catalyst wet chemical etching for multicrystalline diamond wire sawn wafer Sol. Energy Mater. Sol. Cells 133 2015 216 [9] M. Lippold F. Buchholz C. Gondek F. Honeit E. Wefringhaus E. Kroke Texturing of SiC-slurry and diamond wire sawn silicon wafers by HF–HNO3–H2SO4 mixtures Sol. Energy Mater. Sol. Cells 127 2014 104 [10] A. Stapf C. Gondek M. Lippold E. Kroke HF–(NH4)2S2O8–HCl mixtures for HNO3-and NO x ‑free etching of diamond wire- and SiC-slurry-sawn silicon wafers: reactivity studies, surface chemistry, and unexpected pyramidal surface morphologies ACS Appl. Mater. Interfaces 7 2015 16 [11] F. Cao K.X. Chen J.J. Zhao X.Y. Ye J.J. Li S. Zou X.D. Su Next-generation multi-crystalline silicon solar cells: diamond-wire sawing, nano-texture and high efficiency Sol. Energy Mater. Sol. Cells 141 2015 132 [12] S.A. Mann M.J.D. Wild-Scholten V.M. Fthenakis The energy payback time of advanced crystalline silicon PV modules in 2020: a prospective study Prog. Photovolt. Res. Appl. 22 2014 1180 [13] K. Shirasawa, K. Fukui, K. Okada, Y. Inomata, H. Takahashi, Y. Fukawa, S. Fujii, Over 17% large area multicrystaline silicon solar cells, in: Proceedings of the 14th EU PV-SEC, 1997. [14] D.S. Rubya S.H. Zaidi S. Narayanan B.M. Damianid A. Rohatgi Rie-texturing of multicrystalline silicon solar cells Sol. Energy Mater. Sol. Cells 74 2002 133 [15] F. Toor H.M. Branz M.R. Page K.M. Jones H.C. Yuan Multi-scale surface texture to improve blue response of nanoporous black silicon solar cells Appl. Phys. Lett. 99 2011 103501 [16] J.H. Oh H.C. Yuan H.M. Branz An 18.2%-efficient black-silicon solar cell achieved through control of carrier recombination in nanostructures Nat. Nanotechnol. 7 2012 743 [17] Z.G. Huang X.X. Lin Y. Zeng S.H. Zhong X.M. Song C. Liu X. Yuan W.Z. Shen One-step-MACE nano/microstructures for high-efficient large-size multicrystalline Si solar cells Sol. Energy Mater. Sol. Cells 143 2015 302 [18] S.H. Zhong Z.G. Huang X.X. Lin Y. Zeng Y.C. Ma W.Z. Shen High-efficiency nanostructured silicon solar cells on a large scale realized through the suppression of recombination channels Adv. Mater. 27 2015 555 [19] S.Y. Li W.H. Ma Y. Zhou X.H. Chen Y.Y. Xiao M.Y. Ma F. Wei X. Yang Fabrication of p-type porous silicon nanowire with oxidized silicon substrate through one-step MACE J. Solid State Chem. 213 2014 242 [20] Z.P. Huang N. Geyer P. Werner J.D. Boor U. Gösele Metal-assisted chemical etching of silicon: a review Adv. Mater. 23 2011 285 [21] C. Chartier S. Bastide C. Le´vy-Cle´ment Metal-assisted chemical etching of silicon in HF–H2O2 Electrochim. Acta 53 2008 5509 [22] Z.G. Huang S.H. Zhong X. Hua X.Y. Kong N. Dai W.Z. Shen An effective way to simultaneous realization of excellent optical and electrical performance in large-scale Si nano/microstructures Prog. Photovolt. Res. Appl. 23 2015 964 [23] J.Y. Kim M.K. Kwon V.J. Logeeswaran S. Grego M.S. Islam Post-growth in situ chlorine passivation for suppressing surface-dominant transport in silicon nanowire devices IEEE Trans. Nanotechnol. 11 2012 782 [24] X.X. Lin X. Hua Z.H. Huang W.Z. Shen Realization of high performance silicon nanowire based solar cells with large size Nanotechnology 24 2013 235402 [25] H.C. Yuan V.E. Yost M.R. Page P. Stradins. D.L. Meier H.M. Branz Efficient black silicon solar cell with a density-graded nanoporous surface: optical properties, performance limitations, and design rules Appl. Phys. Lett. 95 2009 123501", "scopus-id": "84975799344", "coredata": {"eid": "1-s2.0-S0927024816300289", "dc:description": "Unlike conventional multi-wire sawn (CMWS) multi-crystalline silicon (mc-Si) wafers, diamond wire sawn (DWS) mc-Si wafers textured by conventional acidic solution of HF/HNO3 are not suitable for solar cells because visible saw marks set significant barriers in both cell performance and surface appearance. In this work, we have employed versatile strategies based on metal-assisted chemical etching (MACE) technique to eliminate the saw marks and realize effective surface textures on DWS mc-Si wafers, including nano-texture (N-T), micro-texture (M-T) and nano/micro-texture (N/M-T). Especially, benefiting from the tradeoff between optical gain and electrical loss, the efficiency of 18.45% for N/M-T based DWS mc-Si solar cells with a standard wafer size of 156×156mm2 is reported to be higher by an absolute 0.57% compared with that of CMWS mc-Si solar cells (17.88%). Our work provides ways of fabricating DWS mc-Si solar cells with high efficiencies and satisfactory visual appearance.", "openArchiveArticle": "false", "prism:coverDate": "2016-08-31", "openaccessUserLicense": null, "prism:aggregationType": "Journal", "prism:url": "https://api.elsevier.com/content/article/pii/S0927024816300289", "dc:creator": [{"@_fa": "true", "$": "Zhuang, Y.F."}, {"@_fa": "true", "$": "Zhong, S.H."}, {"@_fa": "true", "$": "Huang, Z.G."}, {"@_fa": "true", "$": "Shen, W.Z."}], "link": [{"@_fa": "true", "@rel": "self", "@href": "https://api.elsevier.com/content/article/pii/S0927024816300289"}, {"@_fa": "true", "@rel": "scidir", "@href": "https://www.sciencedirect.com/science/article/pii/S0927024816300289"}], "dc:format": "application/json", "openaccessType": null, "pii": "S0927-0248(16)30028-9", "prism:volume": "153", "prism:publisher": "Elsevier B.V.", "dc:title": "Versatile strategies for improving the performance of diamond wire sawn mc-Si solar cells", "prism:copyright": "© 2016 Elsevier B.V. All rights reserved.", "openaccess": "0", "prism:issn": "09270248", "dcterms:subject": [{"@_fa": "true", "$": "Solar cell"}, {"@_fa": "true", "$": "Diamond wire sawn"}, {"@_fa": "true", "$": "Multicrystalline silicon"}, {"@_fa": "true", "$": "Metal-catalyzed chemical etching"}, {"@_fa": "true", "$": "Nano/micro-texture"}], "openaccessArticle": "false", "prism:publicationName": "Solar Energy Materials and Solar Cells", "openaccessSponsorType": null, "prism:pageRange": "18-24", "prism:endingPage": "24", "pubType": "fla", "prism:coverDisplayDate": "August 2016", "prism:doi": "10.1016/j.solmat.2016.04.014", "prism:startingPage": "18", "dc:identifier": "doi:10.1016/j.solmat.2016.04.014", "openaccessSponsorName": null}, "objects": {"object": [{"@category": "thumbnail", "@height": "118", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024816300289-gr1.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "19822", "@ref": "gr1", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "164", "@width": "108", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024816300289-gr3.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "23839", "@ref": "gr3", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "164", "@width": "207", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024816300289-gr4.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "23744", "@ref": "gr4", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "164", "@width": "125", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024816300289-gr5.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "21841", "@ref": "gr5", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "164", "@width": "109", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024816300289-gr2.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "24090", "@ref": "gr2", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "366", "@width": "678", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024816300289-gr1.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "81415", "@ref": "gr1", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "978", "@width": "646", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024816300289-gr3.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "284933", "@ref": "gr3", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "596", "@width": "755", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024816300289-gr4.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "147865", "@ref": "gr4", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "492", "@width": "376", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024816300289-gr5.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "104634", "@ref": "gr5", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "978", "@width": "651", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024816300289-gr2.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "230357", "@ref": "gr2", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "42", "@width": "177", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024816300289-si0001.gif?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "ALTIMG", "@size": "1277", "@ref": "si0001", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "12", "@width": "9", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024816300289-si0002.gif?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "ALTIMG", "@size": "129", "@ref": "si0002", "@mimetype": "image/gif"}]}, "link": {"@rel": "abstract", "@href": "https://api.elsevier.com/content/abstract/scopus_id/84975799344"}}