{"scopus-eid": "2-s2.0-77955419443", "originalText": "serial JL 271495 291210 291731 291732 291746 291809 291864 291865 291892 291893 31 Solar Energy Materials and Solar Cells SOLARENERGYMATERIALSSOLARCELLS 2010-03-20 2010-03-20 2010-10-31T05:24:52 1-s2.0-S0927024810000863 S0927-0248(10)00086-3 S0927024810000863 10.1016/j.solmat.2010.02.033 S300 S300.1 FULL-TEXT 1-s2.0-S0927024810X00095 2015-05-15T03:20:14.04684-04:00 0 0 20100901 20100930 2010 2010-03-20T00:00:00Z articleinfo crossmark dco dateupdated tomb dateloaded datesearch indexeddate issuelist volumelist yearnav articletitlenorm authfirstinitialnorm authfirstsurnamenorm cid cids confeditor contenttype copyright dateloadedtxt docsubtype doctype doi eid ewtransactionid hubeid issfirst issn issnnorm itemstage itemtransactionid itemweight openaccess openarchive pg pgfirst pglast pii piinorm pubdateend pubdatestart pubdatetxt pubyr sortorder srctitle srctitlenorm srctype subheadings vol volfirst volissue webpdf webpdfpagecount figure body acknowledge affil articletitle auth authfirstini authfull authkeywords authlast primabst ref alllist content subj ssids 0927-0248 09270248 94 94 9 9 Volume 94, Issue 9 19 1506 1511 1506 1511 201009 September 2010 2010-09-01 2010-09-30 2010 PVSEC 18 Bibek Bandyopadhyay Kasturi L. Chopra article fla Copyright © 2010 Elsevier B.V. All rights reserved. EXCELLENTANTIREFLECTIONPROPERTIESVERTICALSILICONNANOWIREARRAYS SRIVASTAVA S 1 Introduction 2 Experiment 3 Results and discussion 4 Conclusions Acknowledgements References BEYER 1998 1191 1193 T RAJTERI 2000 461 464 M STRIEMER 2002 2980 2982 C GREEN 1995 M SILICONSOLARCELLSADVANCEDPRINCIPLESPRACTICE ZHAO 1998 1991 1993 J KOYNOV 2007 203107(1) 203107(3) S SINGH 2001 103 113 P MENNA 1995 13 24 P LIPINSKI 2003 512 517 M KANAMORI 1999 1422 1424 Y MOTAMEDI 1992 4371 4376 M HADOBAS 2000 161 164 K SAI 2006 201116(1) 201116(3) H WANG 2007 061105(1) 061105(3) S SUN 2007 231105(1) 231105(3) C YU 2003 2874 2877 Z ZHANG 2006 1440 1443 G KANAMORI 2005 287 293 Y LALANNE 1997 53 56 P AYDIN 2002 2242 2244 C PENG 2006 387 394 K PENG 2006 7942 7947 K CHAKRAVARTY 2007 701 706 B MA 2006 171907(1) 171907(3) L KUO 2008 2527 2529 M SRIVASTAVA 2009 1851 1856 S SRIVASTAVAX2010X1506 SRIVASTAVAX2010X1506X1511 SRIVASTAVAX2010X1506XS SRIVASTAVAX2010X1506X1511XS item S0927-0248(10)00086-3 S0927024810000863 1-s2.0-S0927024810000863 10.1016/j.solmat.2010.02.033 271495 2010-11-30T15:55:22.929244-05:00 2010-09-01 2010-09-30 1-s2.0-S0927024810000863-main.pdf https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024810000863/MAIN/application/pdf/fc6ad135c676bf7b1ba4a428caa7a016/main.pdf https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024810000863/MAIN/application/pdf/fc6ad135c676bf7b1ba4a428caa7a016/main.pdf main.pdf pdf true 1139301 MAIN 6 1-s2.0-S0927024810000863-main_1.png https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024810000863/PREVIEW/image/png/1863763c27d93214fd79768bd87721d6/main_1.png https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024810000863/PREVIEW/image/png/1863763c27d93214fd79768bd87721d6/main_1.png main_1.png png 64731 849 656 IMAGE-WEB-PDF 1 1-s2.0-S0927024810000863-gr1.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024810000863/gr1/DOWNSAMPLED/image/jpeg/0aa22738721aa9d815611db348c36765/gr1.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024810000863/gr1/DOWNSAMPLED/image/jpeg/0aa22738721aa9d815611db348c36765/gr1.jpg gr1 gr1.jpg jpg 92164 554 391 IMAGE-DOWNSAMPLED 1-s2.0-S0927024810000863-gr1.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024810000863/gr1/THUMBNAIL/image/gif/8d8f066401705d69c655936e885eab97/gr1.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024810000863/gr1/THUMBNAIL/image/gif/8d8f066401705d69c655936e885eab97/gr1.sml gr1 gr1.sml sml 8660 163 115 IMAGE-THUMBNAIL 1-s2.0-S0927024810000863-gr2.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024810000863/gr2/DOWNSAMPLED/image/jpeg/582d3405e1a4e9cc04b575991dc676a3/gr2.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024810000863/gr2/DOWNSAMPLED/image/jpeg/582d3405e1a4e9cc04b575991dc676a3/gr2.jpg gr2 gr2.jpg jpg 66798 801 391 IMAGE-DOWNSAMPLED 1-s2.0-S0927024810000863-gr2.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024810000863/gr2/THUMBNAIL/image/gif/d3c4ce259748de58494178ffeda98040/gr2.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024810000863/gr2/THUMBNAIL/image/gif/d3c4ce259748de58494178ffeda98040/gr2.sml gr2 gr2.sml sml 5715 164 80 IMAGE-THUMBNAIL 1-s2.0-S0927024810000863-gr3.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024810000863/gr3/DOWNSAMPLED/image/jpeg/b0ffa8440ada0df44ce38c1b8b109d52/gr3.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024810000863/gr3/DOWNSAMPLED/image/jpeg/b0ffa8440ada0df44ce38c1b8b109d52/gr3.jpg gr3 gr3.jpg jpg 110867 378 542 IMAGE-DOWNSAMPLED 1-s2.0-S0927024810000863-gr3.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024810000863/gr3/THUMBNAIL/image/gif/d72194a3e42f3ac4dd8bec230aeb1ec5/gr3.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024810000863/gr3/THUMBNAIL/image/gif/d72194a3e42f3ac4dd8bec230aeb1ec5/gr3.sml gr3 gr3.sml sml 19860 153 219 IMAGE-THUMBNAIL 1-s2.0-S0927024810000863-gr4.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024810000863/gr4/DOWNSAMPLED/image/jpeg/e202f9d6c5fb54fb71a30dfd106e7d33/gr4.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024810000863/gr4/DOWNSAMPLED/image/jpeg/e202f9d6c5fb54fb71a30dfd106e7d33/gr4.jpg gr4 gr4.jpg jpg 38098 320 391 IMAGE-DOWNSAMPLED 1-s2.0-S0927024810000863-gr4.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024810000863/gr4/THUMBNAIL/image/gif/c89474f432a2eb28609d7846798d9261/gr4.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024810000863/gr4/THUMBNAIL/image/gif/c89474f432a2eb28609d7846798d9261/gr4.sml gr4 gr4.sml sml 8235 164 200 IMAGE-THUMBNAIL 1-s2.0-S0927024810000863-gr5.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024810000863/gr5/DOWNSAMPLED/image/jpeg/92bef29a467e16b281072ea1320a5671/gr5.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024810000863/gr5/DOWNSAMPLED/image/jpeg/92bef29a467e16b281072ea1320a5671/gr5.jpg gr5 gr5.jpg jpg 34069 327 391 IMAGE-DOWNSAMPLED 1-s2.0-S0927024810000863-gr5.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024810000863/gr5/THUMBNAIL/image/gif/02e2fdc3155021aa07123ef2ba856981/gr5.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024810000863/gr5/THUMBNAIL/image/gif/02e2fdc3155021aa07123ef2ba856981/gr5.sml gr5 gr5.sml sml 5327 164 196 IMAGE-THUMBNAIL 1-s2.0-S0927024810000863-gr6.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024810000863/gr6/DOWNSAMPLED/image/jpeg/111df2fa850b0b613dff384ce30acab9/gr6.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024810000863/gr6/DOWNSAMPLED/image/jpeg/111df2fa850b0b613dff384ce30acab9/gr6.jpg gr6 gr6.jpg jpg 23182 141 542 IMAGE-DOWNSAMPLED 1-s2.0-S0927024810000863-gr6.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024810000863/gr6/THUMBNAIL/image/gif/3c44decd96f1a86a4819817a8c377dc7/gr6.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024810000863/gr6/THUMBNAIL/image/gif/3c44decd96f1a86a4819817a8c377dc7/gr6.sml gr6 gr6.sml sml 4287 57 219 IMAGE-THUMBNAIL 1-s2.0-S0927024810000863-gr7.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024810000863/gr7/DOWNSAMPLED/image/jpeg/bdc8959a94e97c9c1f95959fa25ac81d/gr7.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024810000863/gr7/DOWNSAMPLED/image/jpeg/bdc8959a94e97c9c1f95959fa25ac81d/gr7.jpg gr7 gr7.jpg jpg 23838 326 391 IMAGE-DOWNSAMPLED 1-s2.0-S0927024810000863-gr7.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024810000863/gr7/THUMBNAIL/image/gif/40378981b07d5bb10abdae59b3f69bf3/gr7.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024810000863/gr7/THUMBNAIL/image/gif/40378981b07d5bb10abdae59b3f69bf3/gr7.sml gr7 gr7.sml sml 3018 164 196 IMAGE-THUMBNAIL SOLMAT 5067 S0927-0248(10)00086-3 10.1016/j.solmat.2010.02.033 Elsevier B.V. Fig. 1 SEM images of VA-SiNWA obtained after 45min etching showing (a) top view and the inset shows the cross-sectional view of Si wires of length ∼12μm, and (b) magnified tilted view with angle of tilt 12°. Fig. 2 Cross-sectional SEM images of the VA-SiNWA fabricated for (a) 5min, (b) 45min and (c) VA-SiNWA length vs. etching time for (100) silicon wafers at 300K showing linear increase of arrays length with etching time. (b) indicates the regions where agglomeration of silicon nanowires at the top takes place resulting in large voids (etched islands) and hence increased porosity at top compared to bottom. Fig. 3 Surface morphology of silicon wafers after Ag induced chemical etching for different time showing sequential generation of nanowires structures with increasing net porosity in the top region (a) 2min, (b) 5min, (c) 15min, and (d) 45min. Inset of (a) is the magnified view of the etched and un-etched silicon surfaces by dark and bright contrast, respectively. Inset shown in (b) is the variation of porosity in the top region of the Si wires with etching time. Fig. 4 (a) Reflectivity (R λ ) as function of wavelength (λ) of silicon (or sample) surface with Si wires obtained after different etching times of (1) 0min (polished wafer); (2) 1min; (3) 1.5min; (4) 2min; (5) 5min; (6) 15min and (7) 45min. Inset shows the optical photograph of a polished Si wafer and a silicon wafer with VA-SiNWA prepared for 45min. Fig. 5 Reflectivity of different silicon surfaces: (1) polished, (2) alkaline textured surface, (3) textured and Si x N y coating, (4) PS surface and, (5) VA-SiNWA surface. Fig. 6 Schematic presentation of (a) sub-wavelength structures (SWSs) and (b) multiple coatings of different refractive indexes ‘n’, with increasing n from top to bottom. Fig. 7 Reflectivity of VA-SiNWA at 600nm wavelength with increasing etching time. Excellent antireflection properties of vertical silicon nanowire arrays Sanjay K. Srivastava a ⁎ Dinesh Kumar a P.K. Singh a M. Kar a Vikram Kumar a M. Husain b a National Physical Laboratory, Dr. K.S. Krishnan Marg, New Delhi-110012, India b Department of Physics, Faculty of Natural Sciences, Jamia Millia Islamia, New Delhi-110025, India ⁎ Corresponding author. Tel.: +911145608617; fax: +911145609310. We report a simple approach to prepare cost effective antireflective surface directly on silicon wafers, which consists of arrays of vertically aligned silicon nanowires (VA-SiNWA). Large area VA-SiNWA were realized by silver induced wet chemical etching of p-silicon (100) substrates in aqueous HF and AgNO3 solution at room temperature. Length of Si wires (diameter in 50–300nm range) was found to increase linearly with etching time (0–120min). A remarkable reduction in reflectivity (R λ ) for surfaces with Si wires was observed. The value of R λ less than 2% was realized in the 300–600nm wavelength range in the case of ∼12μm long Si wires, a value better than the best R λ reported in anisotropically textured surface or single layer antireflection coatings. The VA-SiNWA behaves as a subwavelength structured surface that could suppress the reflectivity to a great extent. Such surfaces may have potential applications as antireflection surface for silicon solar cells. Keywords Silicon nanowires Metal induced etching Black silicon Antireflective coatings (ARC) 1 Introduction Surface antireflection techniques are important for improving the performance of many optical and optoelectronic devices such as solar cells, planar displays, videos, camera monitors, and light sensors [1–3]. For example, flat silicon surfaces have high reflectivity (35–40%) with a strong spectral dependence, which limits the power conversion efficiency of silicon based solar cells. Usually, transparent quarter wavelength layers of SiO x , TiO x , or Si x N y with intermediate or gradient refractive indices are used as antireflection coatings (ARC) [4]. ARC is formed by single or multiple layer film deposition through various processes such as plasma enhanced chemical vapor deposition, sputtering processes, wet coating, sol-gel methods, etc.. These coatings have resonant structures and work effectively only in a limited spectral range and for specific angles of incidence [4]. Also, these coatings have several problems such as thermal mismatch, adhesiveness, stability, etc. In the case of silicon solar cells, a variety of other approaches have also been developed to minimize the reflection losses through modifying surface morphology [3–6] wherein reflection losses in a broad spectral range are reduced by surface texturing by anisotropic etching generally in aqueous alkaline solution. However, this process is limited to single crystalline silicon only [4,7]. An alternate approach to minimize reflectivity (R λ ) utilizes a fine surface textured surface, comprising features on the nanometer scale. Porous silicon (PS) is one such approach to reduce R λ in the range of 5–8% [8,9]. However, reproduction and fragile nature of the PS layer have always been a matter of concern [6]. Recently, antireflection surfaces based on subwavelength structures (SWSs) have also been investigated [10]. The SWSs are the surface relief structures with dimensions smaller than the wavelength of the incident light. An SWS surface with a deep and tapered profile can suppress the Fresnel reflection substantially over a wide spectral bandwidth. These layers are intrinsically more stable than multilayer ARCs since no layers of foreign materials are involved. It has been shown that optical thickness of the SWS layer to wavelength ratio greater than 0.4 drastically reduces reflection losses and the R λ approaches zero though it fluctuates slightly at times on further increase of the SWS height [11,12]. For ideal SWSs with near zero reflectivity requires perfectly tapered V-shaped grooves of the SWSs [13]. To date, different methods have been employed to fabricate SWS surfaces [10–15]. Dry etching methods such as reactive ion etching, nanoimprint lithography, etc. are commonly used for the fabrication of SWSs, in which imprinting or shadow masks with resolutions in subwavelength scale are required [10,12,13,16,17]. The masks can be obtained by electron beam lithography (EBL) [10], by laser interference lithography [12, 16], self-assembly like alumina template [13] or from nature materials [17]. However, the low throughput and the cost, for example of the EBL, are of great concerns [10,18]. On the other hand, interference lithography [19,20] and nanoimprint lithography [16] enable the creation of antireflective SWS over large areas but are complex and expensive, hence limiting their applications. In this paper, we propose a simple, low cost process to produce antireflective surface consisting of vertically aligned silicon nanowires arrays (VA-SiNWA), which clearly resembles SWSs surface. The Si wires are fabricated at room temperature through metal-induced selective etching of silicon wafers in aqueous HF solution [21]. The growth and morphology of VA-SiNWA and the corresponding reflectivity of the silicon surface with etching time have been investigated and are correlated with the surface morphology. 2 Experiment Growth of VA-SiNWA was carried out on (100) p-type (1–5Ωcm), chemically–mechanically polished (CMP), B-doped crystalline silicon wafers. The etching of 300±10μm thick wafers was carried out in a teflon vessel containing 5molL−1 aqueous HF solution and 0.02molL−1 AgNO3 at room temperature for different etching times. Prior to etching, silicon wafers were sequentially cleaned with acetone, de-ionized water, and boiled in piranha solution (H2SO4: H2O2=3:1 by volume for 30min) followed by rinsing with de-ionized water and 5% HF dip to remove oxide. The cleaned silicon wafers were etched for different time durations keeping all other parameters such as concentration of the solution, volume, temperature, etc. constant. The samples surfaces obtained after etching were found to be wrapped with a thick silver (Ag) layer, which consisted of high density tree-like dendritic structures. To remove the Ag layer completely, the as-prepared samples were treated in a conventional Ag etchant solution consisting of NH3OH: H2O2 in the ratio of 3:1 by volume and were rinsed with de-ionized water. After being blown dry in air they were subjected to further investigations. Morphology of the samples was examined by scanning electron microscope (SEM) (LEO model 440VP) and the reflectivity measurements were carried out by spectrophotometer (Shimadzu-UV model 3101PC) in the 300–1100nm wavelength range. 3 Results and discussion Typical SEM images of etched silicon wafer are shown in Fig. 1. The low magnification top view of the silicon surface etched for 45min is shown in Fig. 1a and the corresponding cross-sectional view in the inset. The highly magnified and tilted view of the sample is shown in Fig. 1b. The SEM images indicate that etched silicon wafers consist of dense and vertically aligned one-dimensional nanostructures (VA-SiNWA). From the top tilted view of SEM image shown, surface relief structures with dimensions less than the wavelength of visible light could be seen. The diameters of the Si wires are estimated to be in the range of 50–300nm by SEM investigations. With increasing etching time, length of the nanowires increased from few nanometers to several micrometers depending on the etching time. The dimensions of the nanostructures, particularly the diameter, remain almost the same throughout the length as can be seen from Fig. 2a and b for etching times of 5 and 45min where the nanowires length are ∼1 and ∼12μm, respectively. It has been found that the length (as determined from cross-sectional view of SEM images) of Si wires increases linearly with etching time for durations (0–120min), and arrays length vs. etching time curve is shown in Fig. 2c. The estimated average etching rate is ∼250nmmin−1 for HF and AgNO3 concentration of 5 and 0.02molL−1, respectively, at 300K. The plot clearly indicates that VA-SiNWA of tunable length can be fabricated at room temperature by controlling the etching time. Fig. 3a–d shows the SEM images (top and tilted view) of VA-SiNWA surfaces fabricated for 2, 5, 15, and 45min where regions with bright contrast correspond to un-etched silicon surface and with black contrast to the etched regions of the samples. Fig. 3a shows uniformly distributed nanostructures of low dimensions across the whole area at the onset of etching process. With increase in etching time, etched regions seem to sink deeper and deeper, resulting in the evolution of un-etched silicon regions as one-dimensional structure with diameter in nanometer scale. As the etching progresses, etching of nanowires may also take place due to etching from the top surfaces of the wires that result in the increase of porosity, particularly in the region that are exposed to the etching solutions for longer durations (i.e. close to the top surface). It is noted that with increase in wire length, porosity is more at the top compared to its value at the bottom (Fig. 3d). The porosity was estimated by the image processing method (i.e. top un-etched surface area) of SEM images. The porosity vs. etching time is shown in the inset of Fig. 3b, which shows sharp increase in porosity initially and tend to slow down for larger etching times. The top region porosity was estimated to be ∼32% in the sample etched for 2min whereas its value increased to ∼65% for the sample etched for 45min. It is important to point out that porosity at the Si nanowires–Si substrate interface should remain almost the same (∼32%) in all the samples etched for different time durations. It is expected since the density of silicon nanowires attached to the silicon surface remains almost the same with increase in etching duration as is evident from the cross-sectional view of the nanowires shown in Fig. 2a and b. In addition, it is evident that after a certain length, the nanowires could not support themselves to stand vertically of their own and lean over surrounding wires for support, resulting in agglomeration of nanowires in the top region (Figs. 2b and 3d). The graded porosity with increase in Si wires length may also be attributed to the surface tensional and van der Walls forces acting among the nanowires, which may hold them together in the top region to form the pyramidal shape structures (see Fig. 1b), similar to agglomeration of a shaving brush after rinsing with water. Further, the presence of defects in wafers may also lead to such morphology. However, the exact mechanism is not clear and needs further investigations. The growth mechanism of VA-SiNWA has been widely studied [21,22]. The mechanism of VA-SiNWA formation can be understood as being a self-assembled Ag induced selective etching process based on the localized microscopic electrochemical cell model proposed by Peng et al. [21]. The process is based on the continuous galvanic displacement of Si by Ag+ via Ag+→Ag reduction on the silicon surface and hence forming many local nano-electrochemical cells. The Ag nanoparticles deposited act as active cathode and silicon surface in contact with the Ag nanoparticles as active anode. The whole reaction can be divided into two parts: cathode and anode reactions, which are described as follows [21]: Cathodic reaction: Ag++e−(VB)→Ag°(s) Anodic reaction: Si(s)+2H2O→SiO2+4H++4e−(VB) SiO2(s)+6HF→H2SiF6+2H2O In brief, Ag+ ions get reduced to Ag onto the silicon surface by injecting holes into the Si valence band and oxidizing the silicon surface locally in contact with Ag. The oxidized wafer surface is subsequently etched away by HF. The initial reduction of Ag+ results in Ag nanoclusters, which restricts the oxidation of silicon surface and the etching process occurs locally. The deposited Ag nanoclusters are uniformly distributed throughout the silicon surface at the initial stage. Further reduction of Ag+ occurs on the Ag nanoclusters itself (being relatively highly electronegative than silicon and hence provide easy injection path for holes) being an active cathode by electron transfer from the underlying wafer, not from the un-etched Si surface. Hence, self-assembly of Ag nanoclusters to the dendritic structure and lack of coalescence to a compact grain Ag film causes a selective oxidation and dissolution of Si in the aqueous HF-AgNO3 solution. The Ag nanoparticles trapped in pores sink continuously, thus resulting in the wire like Si-structure. The etched silicon wafers (>2min etching) after removing the silver layer appeared dark black, which is indicative of low surface reflectivity. This motivated us to investigate the reflectivity property of surfaces consisting of VA-SiNWA structure. Fig. 4 shows the comparative spectral reflectivity plot of single-crystalline silicon wafers etched for different times (0 to 45min). It is observed that R λ decreases with increase in etching time (i.e. with increasing wire length) and reaches a minimum of ∼1.5% in the 300–600nm range and <4% in the spectral range 600–1000nm in the samples etched for 15min or more. An optical photograph of the VA-SiNWA sample prepared for 45min is shown in the inset of Fig. 4 along with that of a polished silicon surface for comparison. Fig. 5 compares the reflectivity of VA-SiNWA with that of the anisotropically textured silicon surface, textured along with Si x N y coating and porous silicon ARCs [7,23], which clearly shows the superiority of the VA-SiNWA as an antireflection surface. The superior antireflection property of nanowires array surface can be attributed to the following: (i) the nanowires arrays have structural morphology similar to SWSs surface as shown schematically in Fig. 6a, which can suppress the reflection loss over a wide spectral range [10–14], (ii) the nanowires array surface has varying porosity from top (air–Si nanowires interface) to the bottom end of the nanowires (nanowires–Si substrate interface) where the porosity gradient causes a graded refractive index layer from top to bottom (refractive index ‘n’ increases with decrease in porosity) as shown schematically in Fig. 6b [3,6,24]which closely resembles a multilayer antireflection coating [25], and (iii) highly rough surfaces and network assembly of the nanowires may lead to strong light scattering and consequently its absorption. Fig. 7 shows that the reflectivity of the VA-SiNWA at 600nm wavelength with different etching times has no significant reduction in R λ for more than 25min etching and has a direct co-relation with porosity data (inset of Fig. 3b). Fluctuation in R λ is observed in the samples etched for longer time durations. We intend to use Si nanowires based substrates for solar cells application where long wires may not be suitable due to their fragile nature. A process for solar cell fabrication of Si nanowires based black silicon substrates is being developed and the preliminary results on cell performance have been reported [26] where efficiency of the nanowires based solar cell was less compared to the control cell with a planar surface. These cells were fabricated on substrates with Si wires array of desired length over the entire active device area using the following methodology. The n+–p–p+ structure based solar cells on substrate fully covered with nanowires were fabricated by conventional cell fabrication protocol involving phosphorus diffusion followed by alloying of a thin Al layer deposited on the rear surface to form back surface field. The front and back metal contacts were made by Ti/Ag and Al, respectively. The control cell having CMP surface was also processed in the same batch. The metal contacts formation on the VA-SiNWA surface has been a major problem, which was one of the reasons for the lower performance of Si wires based cells compared to the control cell. This problem has been alleviated by selective growth of the nanowires on the front protecting the regions, where bus bars and fingers of cells are to be made, using an etch resist coating. As a result, the electrode area remains planar similar to the control cell and the active area is covered with the nanowires. It was found that 5μm long Si wires may be sufficient to achieve reflectivity around 2–3%. The cell made on selectively grown VA-SiNWA surfaces has resulted in a significant improvement in short circuit current density (15–20% with respect to the control cell). The open circuit voltage was found ∼2–4% lower compared to the control cell which may be attributed to enhanced recombination loss due to manifold increase in the surface area after the nanowire formation. It is important to mention that fill factor of the two cells was comparable. The efficiency of the Si wires based cells was 10–15% more compared to the control cell, which could be primarily due to improvement in short circuit current. The process optimization, particularly the issues related with the surface recombination losses associated with enhanced surface area, nanowire length, etc. is being carried out and will be reported elsewhere. 4 Conclusions We have demonstrated the growth of large area VA-SiNWA similar to SWSs by a simple and inexpensive process known as silver induced electroless etching of silicon, which minimizes reflection loss to as low as ∼2% in the spectral range of interest for silicon solar cells. The surface acts as a tunable antireflection layer that is controlled by the nanowires length. The process is simple and scalable for fabrication of Si wires on large area and could easily be adopted in silicon device process technology. We have made silicon solar cells on VA-SiNWA based substrates that show interesting results in terms of enhanced short circuit current density and hence the cell efficiency without affecting other solar cell performance parameters. Acknowledgements The present study was funded by the Council of Scientific and Industrial Research (CSIR) India under network project SIP-017. One of the authors, Dinesh Kumar, is grateful to University Grant Commission, India, for the financial support in the form of research fellowship during this work. References [1] T. Beyer M. Tacke Antireflection coatings for PbSe diode lasers Appl. Phys. Lett. 73 1998 1191 1193 [2] M. Rajteri M.L. Rastello E. Monticone Antireflection coatings for superconducting photodetectors Nucl. Instrum. Methods Phys. Rev. A 444 2000 461 464 [3] C.C. Striemer P.M. Fauchet Dynamic etching of silicon for broadband antireflection applications Appl. Phys. Lett. 81 2002 2980 2982 [4] M.A. Green Silicon Solar Cells: Advanced Principles and Practice 1995 Bridge Sydney [5] J. Zhao A. Wang M.A. Green F. Ferrazza 19.8% efficient “honeycomb” textured multicrystalline and 24.4% monocrystalline silicon solar cells Appl. Phys. Lett. 73 1998 1991 1993 [6] S. Koynov M.S. Brandt M. Srutzmann Black non-reflecting silicon surfaces for solar cells Appl. Phys. Lett. 88 2007 203107(1) 203107(3) [7] P.K. Singh R. Kumar M. Lal S.N. Singh B.K. Das Effectiveness of silicon in aqueous alkaline solutions Sol Energy Mater. Sol. Cells 70 2001 103 113 [8] P. Menna G.D. Francia V.L. Ferrara Porous silicon in solar cells: a review and a description of its application as an AR coating Sol. Energy Mater. Sol. Cells 37 1995 13 24 [9] M. Lipinski S. Bastide P. Panek C.L. Clement Porous silicon antireflection coating by electrochemical and chemical etching for silicon solar cell manufacturing Phys. Stat. Sol. (a) 197 2003 512 517 [10] Y. Kanamori M. Sasaki K. Hane Broadband antireflection gratings fabricated upon silicon substrates Opt. Lett. 24 1999 1422 1424 [11] M.E. Motamedi W.H. Southwell W.J. Gunning Antireflection surfaces in silicon using binary optics technology Appl. Opt. 31 1992 4371 4376 [12] K. Hadobas S. Kirsch A. Carl M. Acet E.F. Wassermann Reflection properties of nanostructure-arrayed silicon surfaces Nanotechnology 11 2000 161 164 [13] H. Sai H. Fujii K. Arafune Y. Ohshita M. Yamaguchi Y. Kanamori H. Yugami Antireflective sub-wavelength structures on crystalline Si fabricated using directly formed anodic porous alumina masks Appl. Phys. Lett. 88 2006 201116(1) 201116(3) [14] S. Wang X.Z. Yu H.T. Fan Simple lithographic approach for subwavelength structure antireflection Appl. Phys. Lett. 91 2007 061105(1) 061105(3) [15] C.H. Sun W.L. Min N.C. Linn P. Jiang Templated fabrication of large area subwavelength antireflection gratings on silicon Appl. Phys. Lett. 91 2007 231105(1) 231105(3) [16] Z.N. Yu H. Gao W. Wu H.X. Ge S.Y. Chou Fabrication of large area subwavelength antireflection structures on Si using trilayer resist nanoimprint lithography and lift-off J. Vac. Sci. Technol. B 21 2003 2874 2877 [17] G. Zhang J. Zhang G.Y. Xie Z.F. Liu H.B. Shao Cicada wings: a stamp from nature for nanoimprint lithography Small 2 2006 1440 1443 [18] Y. Kanamori E. Roy Y. Chen Antireflection sub-wavelength gratings fabricated by spin-coating replication Microelectron. Eng. 78-79 2005 287 293 [19] P. Lalanne G.M. Morris Antireflection behavior of silicon subwavelength periodic structures for visible light Nanotechnology 8 1997 53 56 [20] C. Aydin A. Zaslavsky G.J. Sonek J. Goldstein Reduction of reflection losses in ZnGeP2 using moth eye antireflection surface relief structures Appl. Phys. Lett. 80 2002 2242 2244 [21] K. Peng J. Hu Y. Yan Y. Wu H. Fang Y. Xu S.T. Lee J. Zhu Fabrication of single-crystalline silicon nanowires by scratching a silicon surface with catalytic metal particles Adv. Funct. Mater. 16 2006 387 394 [22] K. Peng H. Fang J. Hu Y. Wu J. Zhu Y. Yan S.T. Lee Metal-particle-induced, highly localized site-specific etching of Si and formation of single-crystalline Si nanowires in aqueous fluoride solution Chem. Eur. J. 12 2006 7942 7947 [23] B.C. Chakravarty J. Tripathi A.K. Sharma R. Kumar K.N. Sood S.B. Samanta S.N. Singh The growth kinetics and optical confinement studies of porous Si for application in terrestrial Si solar cells as antireflection coating Sol. Energy Mater. Sol. Cells 91 2007 701 706 [24] L.L. Ma Y.C. Zhou N. Jiang X. Lu J. Shao W. Lu J. Ge X.M. Ding X.Y. Hou Wide-band \"black silicon\" based on porous silicon Appl. Phys. Lett. 88 2006 171907(1) 171907(3) [25] M.L. Kuo D.J. Poxon Y.S. Kim F.W. Mont J.K. Kim E.F. Schubert S.Y. Lin Realization of a near-perfect antireflection coating for silicon solar energy utilization Opt. Lett. 33 2008 2527 2529 [26] S.K. Srivastava D. Kumar P.K. Singh V. Kumar Silicon nanowires based “black silicon” solar cells in: Proceedings of the 34th IEEE Photovoltaic Specialists Conference (PVSC) 2009 1851 1856 Philadelphia, 6–12 June", "scopus-id": "77955419443", "coredata": {"eid": "1-s2.0-S0927024810000863", "dc:description": "We report a simple approach to prepare cost effective antireflective surface directly on silicon wafers, which consists of arrays of vertically aligned silicon nanowires (VA-SiNWA). Large area VA-SiNWA were realized by silver induced wet chemical etching of p-silicon (100) substrates in aqueous HF and AgNO3 solution at room temperature. Length of Si wires (diameter in 50–300nm range) was found to increase linearly with etching time (0–120min). A remarkable reduction in reflectivity (R λ ) for surfaces with Si wires was observed. The value of R λ less than 2% was realized in the 300–600nm wavelength range in the case of ∼12μm long Si wires, a value better than the best R λ reported in anisotropically textured surface or single layer antireflection coatings. The VA-SiNWA behaves as a subwavelength structured surface that could suppress the reflectivity to a great extent. Such surfaces may have potential applications as antireflection surface for silicon solar cells.", "openArchiveArticle": "false", "prism:coverDate": "2010-09-30", "openaccessUserLicense": null, "prism:aggregationType": "Journal", "prism:url": "https://api.elsevier.com/content/article/pii/S0927024810000863", "dc:creator": [{"@_fa": "true", "$": "Srivastava, Sanjay K."}, {"@_fa": "true", "$": "Kumar, Dinesh"}, {"@_fa": "true", "$": "Singh, P.K."}, {"@_fa": "true", "$": "Kar, M."}, {"@_fa": "true", "$": "Kumar, Vikram"}, {"@_fa": "true", "$": "Husain, M."}], "link": [{"@_fa": "true", "@rel": "self", "@href": "https://api.elsevier.com/content/article/pii/S0927024810000863"}, {"@_fa": "true", "@rel": "scidir", "@href": "https://www.sciencedirect.com/science/article/pii/S0927024810000863"}], "dc:format": "application/json", "openaccessType": null, "pii": "S0927-0248(10)00086-3", "prism:volume": "94", "prism:publisher": "Elsevier B.V.", "dc:title": "Excellent antireflection properties of vertical silicon nanowire arrays", "prism:copyright": "Copyright © 2010 Elsevier B.V. All rights reserved.", "prism:issueName": "PVSEC 18", "openaccess": "0", "prism:issn": "09270248", "prism:issueIdentifier": "9", "dcterms:subject": [{"@_fa": "true", "$": "Silicon nanowires"}, {"@_fa": "true", "$": "Metal induced etching"}, {"@_fa": "true", "$": "Black silicon"}, {"@_fa": "true", "$": "Antireflective coatings (ARC)"}], "openaccessArticle": "false", "prism:publicationName": "Solar Energy Materials and Solar Cells", "prism:number": "9", "openaccessSponsorType": null, "prism:pageRange": "1506-1511", "prism:endingPage": "1511", "pubType": "fla", "prism:coverDisplayDate": "September 2010", "prism:doi": "10.1016/j.solmat.2010.02.033", "prism:startingPage": "1506", "dc:identifier": "doi:10.1016/j.solmat.2010.02.033", "openaccessSponsorName": null}, "objects": {"object": [{"@category": "standard", "@height": "554", "@width": "391", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024810000863-gr1.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "92164", "@ref": "gr1", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "163", "@width": "115", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024810000863-gr1.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "8660", "@ref": "gr1", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "801", "@width": "391", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024810000863-gr2.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "66798", "@ref": "gr2", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "164", "@width": "80", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024810000863-gr2.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "5715", "@ref": "gr2", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "378", "@width": "542", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024810000863-gr3.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "110867", "@ref": "gr3", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "153", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024810000863-gr3.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "19860", "@ref": "gr3", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "320", "@width": "391", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024810000863-gr4.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "38098", "@ref": "gr4", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "164", "@width": "200", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024810000863-gr4.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "8235", "@ref": "gr4", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "327", "@width": "391", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024810000863-gr5.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "34069", "@ref": "gr5", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "164", "@width": "196", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024810000863-gr5.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "5327", "@ref": "gr5", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "141", "@width": "542", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024810000863-gr6.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "23182", "@ref": "gr6", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "57", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024810000863-gr6.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "4287", "@ref": "gr6", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "326", "@width": "391", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024810000863-gr7.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "23838", "@ref": "gr7", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "164", "@width": "196", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024810000863-gr7.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "3018", "@ref": "gr7", "@mimetype": "image/gif"}]}, "link": {"@rel": "abstract", "@href": "https://api.elsevier.com/content/abstract/scopus_id/77955419443"}}