{"scopus-eid": "2-s2.0-84888420705", "originalText": "serial JL 271459 291210 291731 291892 291893 31 Solar Energy SOLARENERGY 2013-11-28 2013-11-28 2016-12-23T14:13:42 1-s2.0-S0038092X13004295 S0038-092X(13)00429-5 S0038092X13004295 10.1016/j.solener.2013.10.017 S300 S300.2 FULL-TEXT 1-s2.0-S0038092X13X00143 2016-12-23T09:20:37.678381-05:00 0 0 20140101 20140131 2014 2013-11-28T00:00:00Z articleinfo articletitlenorm authfirstinitialnorm authfirstsurnamenorm cid cids contenttype copyright crossmark dateloaded dateloadedtxt datesearch datesort dateupdated dco docsubtype doctype doi eid ewtransactionid hubeid indexeddate issn issnnorm itemstage itemtransactionid itemweight openaccess openarchive pg pgfirst pglast pii piinorm pubdateend pubdatestart pubdatetxt pubyr sectiontitle sortorder srctitle srctitlenorm srctype ssids alllist content subj subheadings suppl tomb volfirst volissue volumelist webpdf webpdfpagecount yearnav figure table body mmlmath acknowledge affil articletitle auth authfirstini authfull authkeywords authlast grantnumber grantsponsor highlightsabst misctext primabst ref 0038-092X 0038092X true 99 99 C Volume 99 11 95 99 95 99 201401 January 2014 2014-01-01 2014-01-31 2014 Regular Articles article fla Copyright © 2013 Published by Elsevier Ltd. ENHANCEDELECTRODECONTACTPROPERTYSILICONNANOTEXTUREDSOLARCELLSVIASELECTIVEETCHING DOU B 1 Introduction 2 Experimental details 3 Results and discussion 4 Conclusions Acknowledgments References BEN 2010 486 491 R BEN 2012 1411 1415 R CHEN 2011 143108-1 143108-3 C DOU 2012 183901-1 183901-4 B DOU 2013 145 151 B FANG 2008 255703-1 255703-6 H GARNETT 2008 9224 9225 E GREEN 1982 M SOLARCELLSOPERATINGPRINCIPLESTECHNOLOGYSYSTEMAPPLICATIONS HAMILTON 1995 1187 1207 B HOCHBAUM 2005 457 460 A HSU 2012 W KUMAR 2011 215 218 D LEE 2013 256 262 I LI 2011 151116-1 151116-3 H NELSON 2003 J PHYSICSSOLARCELLS NOSITSCHKA 2003 155 166 W OELHAFEN 2005 110 121 P PENG 2005 1062 1067 K PENG 2008 163103-1 163103-3 K SZE 1981 S PHYSICSSEMICONDUCTORDEVICES TIEDJE 1984 711 716 T TSAKALAKOS 2007 013552-1 013552-10 L WU 2009 2418 2422 Z YAE 2006 701 706 S DOUX2014X95 DOUX2014X95X99 DOUX2014X95XB DOUX2014X95X99XB item S0038-092X(13)00429-5 S0038092X13004295 1-s2.0-S0038092X13004295 10.1016/j.solener.2013.10.017 271459 2016-12-23T09:20:37.678381-05:00 2014-01-01 2014-01-31 1-s2.0-S0038092X13004295-main.pdf https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0038092X13004295/MAIN/application/pdf/1683cc8795dc946636d9866952f148ac/main.pdf https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0038092X13004295/MAIN/application/pdf/1683cc8795dc946636d9866952f148ac/main.pdf main.pdf pdf true 1415589 MAIN 5 1-s2.0-S0038092X13004295-main_1.png https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0038092X13004295/PREVIEW/image/png/2d05529559e572a0eaa0e1fa7cb85afd/main_1.png https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0038092X13004295/PREVIEW/image/png/2d05529559e572a0eaa0e1fa7cb85afd/main_1.png main_1.png png 64301 849 656 IMAGE-WEB-PDF 1 1-s2.0-S0038092X13004295-gr1.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0038092X13004295/gr1/THUMBNAIL/image/gif/6e03849fa59a5414aee36110260afe3b/gr1.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0038092X13004295/gr1/THUMBNAIL/image/gif/6e03849fa59a5414aee36110260afe3b/gr1.sml gr1 gr1.sml sml 14868 163 68 IMAGE-THUMBNAIL 1-s2.0-S0038092X13004295-gr2.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0038092X13004295/gr2/THUMBNAIL/image/gif/0dd45547957feebd3815bc924df5cc44/gr2.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0038092X13004295/gr2/THUMBNAIL/image/gif/0dd45547957feebd3815bc924df5cc44/gr2.sml gr2 gr2.sml sml 28332 119 219 IMAGE-THUMBNAIL 1-s2.0-S0038092X13004295-gr3.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0038092X13004295/gr3/THUMBNAIL/image/gif/b3b5d0d8b65351ae747c70d1e931d041/gr3.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0038092X13004295/gr3/THUMBNAIL/image/gif/b3b5d0d8b65351ae747c70d1e931d041/gr3.sml gr3 gr3.sml sml 20177 164 197 IMAGE-THUMBNAIL 1-s2.0-S0038092X13004295-gr1.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0038092X13004295/gr1/DOWNSAMPLED/image/jpeg/51f2435799218bbfb1cbef8d2a88e0b3/gr1.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0038092X13004295/gr1/DOWNSAMPLED/image/jpeg/51f2435799218bbfb1cbef8d2a88e0b3/gr1.jpg gr1 gr1.jpg jpg 98758 743 311 IMAGE-DOWNSAMPLED 1-s2.0-S0038092X13004295-gr2.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0038092X13004295/gr2/DOWNSAMPLED/image/jpeg/acabeb6ab8e34bbe24109f8f516cd36f/gr2.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0038092X13004295/gr2/DOWNSAMPLED/image/jpeg/acabeb6ab8e34bbe24109f8f516cd36f/gr2.jpg gr2 gr2.jpg jpg 112274 343 632 IMAGE-DOWNSAMPLED 1-s2.0-S0038092X13004295-gr3.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0038092X13004295/gr3/DOWNSAMPLED/image/jpeg/22228677c1ef4ee2970b9cff198dae87/gr3.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0038092X13004295/gr3/DOWNSAMPLED/image/jpeg/22228677c1ef4ee2970b9cff198dae87/gr3.jpg gr3 gr3.jpg jpg 40467 260 313 IMAGE-DOWNSAMPLED 1-s2.0-S0038092X13004295-gr1_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0038092X13004295/gr1/HIGHRES/image/jpeg/a8407b3a0a3a9ba75275a2c3fed95845/gr1_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0038092X13004295/gr1/HIGHRES/image/jpeg/a8407b3a0a3a9ba75275a2c3fed95845/gr1_lrg.jpg gr1 gr1_lrg.jpg jpg 355337 2094 876 IMAGE-HIGH-RES 1-s2.0-S0038092X13004295-gr2_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0038092X13004295/gr2/HIGHRES/image/jpeg/7cf42705f9668edb493ac8d046f8e1a9/gr2_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0038092X13004295/gr2/HIGHRES/image/jpeg/7cf42705f9668edb493ac8d046f8e1a9/gr2_lrg.jpg gr2 gr2_lrg.jpg jpg 697561 1199 2207 IMAGE-HIGH-RES 1-s2.0-S0038092X13004295-gr3_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0038092X13004295/gr3/HIGHRES/image/jpeg/753e599dd6bbec9861a54aa896456379/gr3_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0038092X13004295/gr3/HIGHRES/image/jpeg/753e599dd6bbec9861a54aa896456379/gr3_lrg.jpg gr3 gr3_lrg.jpg jpg 183401 1144 1377 IMAGE-HIGH-RES 1-s2.0-S0038092X13004295-si1.gif https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0038092X13004295/STRIPIN/image/gif/f9dc25c0ef520face34ec3defd8b30da/si1.gif https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0038092X13004295/STRIPIN/image/gif/f9dc25c0ef520face34ec3defd8b30da/si1.gif si1 si1.gif gif 979 50 116 ALTIMG 1-s2.0-S0038092X13004295-si2.gif https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0038092X13004295/STRIPIN/image/gif/89ce62d499155883dc212ebf1acc4cb6/si2.gif https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0038092X13004295/STRIPIN/image/gif/89ce62d499155883dc212ebf1acc4cb6/si2.gif si2 si2.gif gif 688 37 119 ALTIMG 1-s2.0-S0038092X13004295-si3.gif https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0038092X13004295/STRIPIN/image/gif/fc270216d557ff1f3abaad743335ffc6/si3.gif https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0038092X13004295/STRIPIN/image/gif/fc270216d557ff1f3abaad743335ffc6/si3.gif si3 si3.gif gif 951 40 155 ALTIMG SE 3643 S0038-092X(13)00429-5 10.1016/j.solener.2013.10.017 Fig. 1 The schematic structures for (a) the full-textured (FT) solar cell; (b) the selective-textured A (ST-A) solar cell, the surface area where for electrode contact was protected from etching; and (c) the selective-textured B (ST-B) solar cell, the surface area where for electrode contact was protect from etching and heavily doped. Fig. 2 The cross-sectional and top-view SEM images for the silver–silicon electrode contact area of (a and c) the full-textured (FT) cell and (b and d) the selective-textured (ST) cell. And the optical images of (e) full-textured and (f) selective-textured silicon solar cells. Fig. 3 The J–V curves of the samples in different groups (FT, ST-A and ST-B) under the standard test condition (AM 1.5 irradiation, T =300K and P =100mW/cm2). Table 1 The electrical parameters of silicon nano-textured solar cells in different groups. Group Voc (mV) Jsc (mA/cm2) FF (%) Eff (%) Rs (Ω) FT (4 cells) 552.5±14 26.8±0.8 41.52±8.3 6.16±1.4 1.57±0.42 ST-A (4 cells) 553.8±7 27.7±1.1 58.95±6.8 9.06±1.2 0.62±0.23 ST-B (4 cells) 554.2±3 29.2±0.5 63.02±2.7 10.2±0.4 0.35±0.04 Enhanced electrode-contact property of silicon nano-textured solar cells via selective etching Bingfei Dou a Rui Jia a ⁎ Haofeng Li a Chen Chen a Zhi Jin a Xinyu Liu a Xiaoqian Xu b a Institute of Microelectronics, Chinese Academy of Sciences, Beijing 100029, China Institute of Microelectronics Chinese Academy of Sciences Beijing 100029 China b Ministry of Commerce People’s Republic of China, Beijing, China Ministry of Commerce People’s Republic of China Beijing China ⁎ Corresponding author. Tel.: +86 10 82995805. Communicated by: Associate Editor Igor Tyukhov The electrode contact property of silicon nano-textured solar cell was investigated. An industrial feasible technique was introduced to enhance the electrode contact. The electrical performance of nano-textured cells with this contact enhancement was measured and compared with the ones without. The series resistance was reduced significantly from 1.5Ω to 0.3Ω and the short-circuit current was increased from 27mAcm−2 to 29mAcm−2. The cell efficiency was improved from 6% to 10%. These data indicate that the contact enhancement is effective. Keywords Silicon solar cell Nanostructures Electrode-contact 1 Introduction Silicon (Si) – nanostructure (NS) has attracted intensive attentions in solar cell application due to their ultra-low reflectance and excellent enhancement in light trapping (Oelhafen and Schüler, 2005; Ben and Bessaïs, 2010; Wu et al., 2009; Hochbaum et al., 2005; Ben et al., 2012; Hamilton, 1995). Appling the nano-textures to the silicon solar cell can dramatically reduce the optical reflection and transmission losses (Tsakalakos et al., 2007; Peng et al., 2008; Lee et al., 2013; Yae et al., 2006). Therefore, the silicon nanostructures exhibit a promising prospect in improving the performance of silicon solar cell. Ag-catalyzed chemical wet etching technique has been reported so far to produce vertical-aligned NS array with average reflectance less than 3% (Nositschka et al., 2003; Hsu et al., 2012; Peng et al., 2005; Dou et al., 2013). This technique can fabricate NS array of large scale rapidly in room temperature and atmosphere. It is simple and low-cost, and promisingly suitable for industrial application. However, such nano-textured c-Si solar cell has not shown advantage in efficiency. One shortage that impacts the nano-textured cell’s performance was believed as the poor front electrode contact (Li et al., 2011; Garnett and Yang, 2008). Since the nano-textured surface is highly fluctuated and the space size is very small, the electrode can only be printed on the tips of NS array. The contact area shrinkage increases the contact resistance. There were several reports concerning the electrode contact enhancement for nano-textured solar cell (Kumar et al., 2011; Chen et al., 2011; Dou et al., 2012). The contact property was enhanced by different techniques: protected the contact area from etching (Kumar et al., 2011); heavy doping facilitated Ohmic-contact formation (Chen et al., 2011) or fulfilled the voids between electrode and nano-textured surface (Dou et al., 2012). After the enhancements, the cells performances were improved as expected. In this paper, a low-cost technique based on screen-printing and normal diffusion was demonstrated to enhance the electrode contact for nano-textured solar cell. The contact area was protected from etching and heavily doped. The series resistance (Rs ) of the cells was significantly reduced and short-circuit current (Jsc ) was improved. This technique is effective and also feasible in industrial fabrication. 2 Experimental details The 4in. p-type 〈100〉 CZ wafers with resistivity of 1–5Ω/cm and thickness of 280μm were used in this work. All the wafers were well cleaned and then divided into three groups. Full-textured (FT) group: nanostructures were fabricated via Ag catalyzed chemical etching (HF (5.0M), and AgNO3 (0.02M) at 25°C for 10min). The wafers were fully nano-textured. Selective-textured A (ST-A) group: firstly etching-resist was screen-printed to protect the electrode region, and then the nanostructures were fabricated via Ag catalyzed chemical etching. After etching, the etching resists were removed. In this way, the electrode region was protected from etching. Selective-textured B (ST-B) group: wafers were diffused using liquid POCl3 to form N+ region firstly. Then screen-printed etching resists was prepared to protect the electrode region, and nanostructures were fabricated via Ag catalyzed etching. After etching, the etching resists were removed. In this way, the electrode region remained flat and also was heavily doped. Then all the wafers were normally diffused to form p–n junctions. After the deposition of 80nm SiN x passivation layer via plasmon-enhanced chemical vapor deposition (PECVD), the samples were cut off into cells with an area of 20×20mm2. Then the back and front sides of each cell were screen printed with Al and Ag pastes to form Al-BSF and front electrode, in which front electrode Groups B and C were printed by align-screen-printing. The silver electrode was printed on the location reserved in advance. Finally, dried cells were co-fired in belt furnace for metallization. The schematic graphs of cells are depicted in Fig. 1 . For FT group cells (Fig. 1(a)), the surface was fully textured and the silver electrode was directly printed on the tips of silicon NS array. While for ST-A and -B group cells (Fig. 1(b) and (c)), the surface area for electrode was reserved as smooth and the silver paste contacted well. Especially, the electrode contact area of ST-B group cell (Fig. 1(c)) was heavily doped, which facilitated the Ohmic contact formation. The surface morphology of nano-textured solar cells was investigated via field-emission scanning electron microscopy (SEM) in a HITACHI S4800 device, as Fig. 2 shows. And then, in order to verify the quality of the silver–silicon contact, the electrical properties of the three groups’ cells were measured. 3 Results and discussion For the full-textured nanostructures solar cells, the screen-printed front silver electrode lay on nano-arrays, according to Fig. 2. The diameter of silver particles of silver paste is about 1–5μm, while the width between silicon nano-wires is about 50–200nm. Therefore, the screen-printed silver paste cannot be filled in the spaces. In this circumstance, only tips of nanowire contacts with the electrode and thus a lot of voids existed. Which means the contact area of silver electrode was significantly reduced. For the selective textured cells, the region for electrode was smooth. The silver electrode printed on the bulk silicon surface thus formed a better contact. Fig. 2(e) and (f) shows the optical images of full-textured and selective-textured NS solar cells. It can be seen that the electrode contact area of selective-textured cell is not etched, where polish silicon surface is reserved. More importantly, the other area is nano-textured and appeared as same black as the surface of full-textured one. This result indicates that the selective-textured cell improved the contact property and also maintained the ultra-low surface reflectance. The series resistances (Rs ) of the three groups were summarized in Table 1 . It clearly shows that the Rs of ST group is lower than FT group, and ST-B group exhibits the lowest Rs parameter. There are three causes that affect Rs in solar cell (Green, 1982): firstly, the movement of current through the emitter and base of the solar cell; secondly, the contact resistance between the metal electrode and the silicon; and thirdly the resistance of the top and rear metal electrodes. For the three groups here, the substrate and electrode material are all the same. Therefore the main difference is the silver–silicon contact property. For the FT group the silver paste was screen-printed on the nano arrays. But for ST-A group, the silver paste was printed on the bulk silicon surface. As a result, the Rs parameters distributed at range of 1.3–2.1Ω in FT group, which is obviously higher than 0.4–0.8Ω of ST-A group. The data indicate that silver–nano-Si contact is worse than silver–c-Si contact. For ST-B groups, the silver electrode was contacted with heavily doped emitter region. Then the Rs parameters were reduced to around 0.3Ω. This result is mainly attributed to better Ohmic contact, which formed by the heavily doped silicon with silver electrode. (1) R s ∝ exp V D N d 1 / 2 According to formula (1) Nelson, 2003, where VD is the contact voltage, Nd is the doping concentration on the side of the silicon. Its noted that Rs is proportional to (Nd )−1/2. As the doping concentration of silicon increased, the series resistance can be effectively decreased. Therefore, for ST-B cells, the heavily doped emitter region facilitated the Ohmic contact formation. And the series resistance was reduced consequently. The short-circuit current density (Jsc ) parameter of the three groups was also shown in Table 1. The Jsc distributed at range of 26.3–27.1mAcm−2 in FT group, 26.9–28.5mAcm−2 in ST-A group, and 28.8–29.7mAcm−2 in ST-B group. This increment of Jsc was also attributed to the enhanced electrode contact property. In c-Si solar cells, the short circuit current density can be expressed using the formula: (2) J SC = R SH R SH + R S J The main impact of series resistance is reducing the fill factor, and high values may also reduce the short-circuit current. The Jsc of cells was related to the Rs parameters. In this work, the decrease in Rs was attributed to the enhanced electrode contact property of the solar cell. Since the electrode contact determines the light induced carriers’ collection, better contact is beneficial to the cell’s current. For FT cells, the silver was contacted with nano silicon. The smaller contact area limited the carriers’ collection. Therefore the Jsc of FT cells is lower than that of ST cells. And for ST-B cells, the increased doping level of silicon emitter region narrowed the energy barrier at the silver–silicon interface. This increased the carriers tunneling transport probability, according to the Ohmic contact theory (Sze, 1981). Therefore, the front silver electrode collected more light-induced carriers through the tunneling mechanism, and the Jsc of ST-B cells increased consequently. Table 1 and Fig. 3 show the performance of the three groups of solar cells. For FT and ST-A groups, the selective nano-texturing enhanced the electrode contact and decreased the Rs , which improved the FF of cell significantly from 41% to 58%. As a result, the efficiency of cells was improved from 6% to 9% on average. It confirms that the silver electrode contacted poorly with nano-textured surface. For the ST-B group cell, the heavily doped emitter helps the silver electrode formed a better Ohmic contact with silicon. This better contact improved the Jsc and FF of the cell. Therefore, the cell efficiency was improved from 9% to 10.2% on average. For all three groups, the open-circuit voltage (Voc ) parameter varied little. The open-circuit voltage (Voc ) depends on the saturation current (Id ) of the solar cell according to the formula: (3) V oc = k B T q ln 1 + I sc I d The saturation current is influenced by the recombination both in bulk and on surfaces (Fang et al., 2008; Tiedje et al., 1984). If better passivation method can be applied on such nanostructure-textured solar cells, the open-circuit voltage (Voc ) parameter will be improved and better performance achieved consequently. 4 Conclusions In summary, silicon nano-textured surface contacts poorly with screen-printed electro To enhance the contact property of nano-textured solar cell, the surface was selectively textured by using screen-printed etching resist. Also a double diffusion technique was used to form heavily doped region on contact area of solar cell. By using these enhancements, the series resistance was reduced significantly and short-circuit current was increased correspondingly. As a result, the efficiency of nano-textured solar cell was improved from 6.1% to 10.2% on average. This technique is effective and at the same time feasible for industrial application. Acknowledgments This work was subsidized by Chinese Ministry of Science and Technology projects under Grant Nos. 2009CB939703 and 2012AA050304, by the Chinese NSF under Grant Nos. 11104319, 11274346, 51202285, 61234005 and 51172268, by Chinese Academy of Sciences Solar Energy Action Plan under Grant Nos. Y1YT064001, Y1YF034001, Y2YF014001 and by Beijing Science and Technology Project under Grant No. Y2BK024001. References Ben and Bessaïs, 2010 R.M. Ben B. Bessaïs Enhancement of photovoltaic properties of multicrystalline silicon solar cells by combination of buried metallic contacts and thin porous silicon Solar Energy 84 2010 486 491 Ben et al., 2012 R.M. Ben A. Hajjaji B. Bessais Improvement of multicrystalline silicon solar cell performance via chemical vapor etching method-based porous silicon nanostructures Solar Energy 86 2012 1411 1415 Chen et al., 2011 C. Chen R. Jia H. Li Y. Meng X. Liu T. Ye S. Kasai H. Tamotsu N. Wu S. Wang J. Chu Electrode-contact enhancement in silicon nanowire-array-textured solar cells Applied Physics Letters 98 2011 143108-1 143108-3 Dou et al., 2012 B. Dou R. Jia H. Li C. Chen W. Ding Y. Meng Z. Xing X. Liu T. Ye High performance radial p–n junction solar cell based on silicon nanopillar array with enhanced decoupling mechanism Applied Physics Letters 101 2012 183901-1 183901-4 Dou et al., 2013 B. Dou R. Jia H. Li C. Chen Y. Sun Y. Zhang W. Ding Y. Meng Z. Xing X. Liu T. Ye Fabrication of ultra-small texture arrays on multicrystalline silicon surface for solar cell application Solar Energy 91 2013 145 151 Fang et al., 2008 H. Fang X. Li S. Song Y. Xu J. Zhu Fabrication of slantingly-aligned silicon nanowire arrays for solar cell applications Nanotechnology 19 2008 255703-1 255703-6 Garnett and Yang, 2008 E. Garnett P. Yang Silicon nanowire radial p–n junction solar cells Journal of the American Chemical Society 130 2008 9224 9225 Green, 1982 M.A. Green Solar Cells: Operating Principles, Technology and System Applications 1982 Prentice-Hall, Inc. Englewood Cliffs, USA Hamilton, 1995 B. Hamilton Porous silicon Semiconductor Science and Technology 10 1995 1187 1207 Hochbaum et al., 2005 A.I. Hochbaum R. Fan R. He P. Yang Controlled growth of Si nanowire arrays for device integration Nano Letters 5 2005 457 460 Hsu et al., 2012 W.C. Hsu Y.S. Lu J.Y. Chyan J.A. Yeh High-efficiency 6″ multicrystalline black solar cells based on metal-nanoparticle-assisted chemical etching International Journal of Photoenergy 2012 2012 7 pages, Article ID 197514, http://dx.doi.org/10.1155/2012/197514 Kumar et al., 2011 D. Kumar S. Srivastava P.K. Singh M. Husain V. Kumar Fabrication of silicon nanowire arrays based solar cell with improved performance Solar Energy Materials & Solar Cells 1 2011 215 218 Lee et al., 2013 I. Lee U. Paik J. Park Solar cell implemented with silicon nanowires on pyramid-texture silicon surface Solar Energy 91 2013 256 262 Li et al., 2011 H. Li R. Jia C. Chen Z. Xing W. Ding Y. Meng D. Wu X. Liu T. Ye Influence of nanowires length on performance of crystalline silicon solar cell Applied Physics Letters 98 2011 151116-1 151116-3 Nelson, 2003 J. Nelson The Physics of Solar Cells 2003 Imperial College London, UK Nositschka et al., 2003 W.A. Nositschka C. Beneking O. Voigt H. Kurz Texturisation of multicrystalline silicon wafers for solar cells by reactive ion etching through colloidal masks Solar Energy Materials & Solar Cells 76 2003 155 166 Oelhafen and Schüler, 2005 P. Oelhafen A. Schüler Nanostructured materials for solar energy conversion Solar Energy 79 2005 110 121 Peng et al., 2005 K.Q. Peng Y. Xu Y. Wu Y. Yan S.T. Lee J. Zhu Aligned single-crystalline Si nanowire arrays for photovoltaic applications Small 1 2005 1062 1067 Peng et al., 2008 K.Q. Peng X. Wang S.T. Lee Silicon nanowire array photoelectrochemical solar cells Applied Physics Letters 92 2008 163103-1 163103-3 Sze, 1981 S.M. Sze Physics of Semiconductor Devices second ed. 1981 Wiley New York, USA Tiedje et al., 1984 T. Tiedje E. Yablonovitch G.D. Cody B.G. Brooks Limiting efficiency of silicon solar cells IEEE Transactions on Electron Devices 31 1984 711 716 Tsakalakos et al., 2007 L. Tsakalakos J. Balch J. Fronheiser M.Y. Shih S.F. LeBoeuf M. Pietrzykowski P.J. Codella B.A. Korevaar O.V. Sulima J. Rand A. Davuluru U. Rapol Strong broadband optical absorption in silicon nanowire films Journal of Nano Photonics 1 2007 013552-1 013552-10 Wu et al., 2009 Z. Wu J.B. Neaton C.G. Jeffrey Charge separation via strain in silicon nanowires Nano Letters 9 2009 2418 2422 Yae et al., 2006 S. Yae T. Kobayashi T. Kawagishi N. Fukumuro H. Matsuda Antireflective porous layer formation on multicrystalline silicon by metal particle enhanced HF etching Solar Energy 80 2006 701 706", "scopus-id": "84888420705", "coredata": {"eid": "1-s2.0-S0038092X13004295", "dc:description": "The electrode contact property of silicon nano-textured solar cell was investigated. An industrial feasible technique was introduced to enhance the electrode contact. The electrical performance of nano-textured cells with this contact enhancement was measured and compared with the ones without. The series resistance was reduced significantly from 1.5Ω to 0.3Ω and the short-circuit current was increased from 27mAcm−2 to 29mAcm−2. The cell efficiency was improved from 6% to 10%. These data indicate that the contact enhancement is effective.", "openArchiveArticle": "false", "prism:coverDate": "2014-01-31", "openaccessUserLicense": null, "prism:aggregationType": "Journal", "prism:url": "https://api.elsevier.com/content/article/pii/S0038092X13004295", "dc:creator": [{"@_fa": "true", "$": "Dou, Bingfei"}, {"@_fa": "true", "$": "Jia, Rui"}, {"@_fa": "true", "$": "Li, Haofeng"}, {"@_fa": "true", "$": "Chen, Chen"}, {"@_fa": "true", "$": "Jin, Zhi"}, {"@_fa": "true", "$": "Liu, Xinyu"}, {"@_fa": "true", "$": "Xu, Xiaoqian"}], "link": [{"@_fa": "true", "@rel": "self", "@href": "https://api.elsevier.com/content/article/pii/S0038092X13004295"}, {"@_fa": "true", "@rel": "scidir", "@href": "https://www.sciencedirect.com/science/article/pii/S0038092X13004295"}], "dc:format": "application/json", "openaccessType": null, "pii": "S0038-092X(13)00429-5", "prism:volume": "99", "prism:publisher": "Published by Elsevier Ltd.", "dc:title": "Enhanced electrode-contact property of silicon nano-textured solar cells via selective etching", "prism:copyright": "Copyright © 2013 Published by Elsevier Ltd.", "openaccess": "0", "prism:issn": "0038092X", "dcterms:subject": [{"@_fa": "true", "$": "Silicon solar cell"}, {"@_fa": "true", "$": "Nanostructures"}, {"@_fa": "true", "$": "Electrode-contact"}], "openaccessArticle": "false", "prism:publicationName": "Solar Energy", "openaccessSponsorType": null, "prism:pageRange": "95-99", "prism:endingPage": "99", "pubType": "fla", "prism:coverDisplayDate": "January 2014", "prism:doi": "10.1016/j.solener.2013.10.017", "prism:startingPage": "95", "dc:identifier": "doi:10.1016/j.solener.2013.10.017", "openaccessSponsorName": null}, "objects": {"object": [{"@category": "thumbnail", "@height": "163", "@width": "68", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0038092X13004295-gr1.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "14868", "@ref": "gr1", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "119", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0038092X13004295-gr2.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "28332", "@ref": "gr2", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "164", "@width": "197", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0038092X13004295-gr3.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "20177", "@ref": "gr3", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "743", "@width": "311", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0038092X13004295-gr1.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "98758", "@ref": "gr1", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "343", "@width": "632", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0038092X13004295-gr2.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "112274", "@ref": "gr2", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "260", "@width": "313", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0038092X13004295-gr3.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "40467", "@ref": "gr3", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "2094", "@width": "876", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0038092X13004295-gr1_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "355337", "@ref": "gr1", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "1199", "@width": "2207", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0038092X13004295-gr2_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "697561", "@ref": "gr2", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "1144", "@width": "1377", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0038092X13004295-gr3_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "183401", "@ref": "gr3", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "50", "@width": "116", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0038092X13004295-si1.gif?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "ALTIMG", "@size": "979", "@ref": "si1", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "37", "@width": "119", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0038092X13004295-si2.gif?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "ALTIMG", "@size": "688", "@ref": "si2", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "40", "@width": "155", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0038092X13004295-si3.gif?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "ALTIMG", "@size": "951", "@ref": "si3", "@mimetype": "image/gif"}]}, "link": {"@rel": "abstract", "@href": "https://api.elsevier.com/content/abstract/scopus_id/84888420705"}}