{"scopus-eid": "2-s2.0-84872824151", "originalText": "serial JL 271533 291210 291719 291720 291790 291893 291940 31 Applied Surface Science APPLIEDSURFACESCIENCE 2012-10-22 2012-10-22 2013-06-26T19:03:43 1-s2.0-S0169433212018065 S0169-4332(12)01806-5 S0169433212018065 10.1016/j.apsusc.2012.10.081 S300 S300.1 FULL-TEXT 1-s2.0-S0169433213X00029 2015-05-14T05:31:34.736618-04:00 0 0 20130201 2013 2012-10-22T00:00:00Z articleinfo crossmark dco dateupdated tomb dateloaded datesearch indexeddate volumelist yearnav articletitlenorm authfirstinitialnorm authfirstsurnamenorm cid cids contenttype copyright dateloadedtxt docsubtype doctype doi eid ewtransactionid hubeid issn issnnorm itemstage itemtransactionid itemweight openaccess openarchive pg pgfirst pglast pii piinorm pubdatestart pubdatetxt pubyr sectiontitle sortorder srctitle srctitlenorm srctype subheadings suppl volfirst volissue webpdf webpdfpagecount figure table body acknowledge affil articletitle auth authfirstini authfull authkeywords authlast primabst ref specialabst alllist content subj ssids 0169-4332 01694332 false 266 266 C Volume 266 2 1 4 1 4 20130201 1 February 2013 2013-02-01 2013 Regular papers article fla Copyright © 2012 Published by Elsevier B.V. CRYSTALLINESILICONSOLARCELLSMICRONANOTEXTURE DIMITROV D 1 Introduction 2 Experimental 3 Results and discussion 3.1 Surface structures 3.2 Surface reflectance and quantum efficiencies 3.3 I–V measurements on solar cells 3.4 Formation of inverted pyramids nanostructure on random upright pyramids texture 4 Conclusions Acknowledgements References HUANG 2011 285 308 Z XIU 2007 3388 3393 Y XIU 2008 10421 10426 Y STEPHENS 1977 19 29 R GITTLEMAN 1979 742 744 J LIU 2010 1719 1724 Y PROCEEDINGSELECTRONICCOMPONENTSTECHNOLOGYCONFERENCE MICRONANOSTRUCTURESIZEEFFECTSUPERHYDROPHOBICITYANTIREFLECTIONSINGLECRYSTALLINESISOLARCELLS SWIATEK 2003 291 296 Z XIAO 2010 472 475 J KIM 2009 2415 2417 B MARRERO 2009 2648 2650 N LEE 2007 3713 3716 S DIMITROV 2011 2926 2933 D XIU 2010 155705 Y TOOR 2011 103501 F DIMITROVX2013X1 DIMITROVX2013X1X4 DIMITROVX2013X1XD DIMITROVX2013X1X4XD item S0169-4332(12)01806-5 S0169433212018065 1-s2.0-S0169433212018065 10.1016/j.apsusc.2012.10.081 271533 2013-06-26T20:55:35.772643-04:00 2013-02-01 1-s2.0-S0169433212018065-main.pdf https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433212018065/MAIN/application/pdf/aef1f838467abf2b6794f92b67843215/main.pdf https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0169433212018065/MAIN/application/pdf/aef1f838467abf2b6794f92b67843215/main.pdf main.pdf pdf true 859269 MAIN 4 1-s2.0-S0169433212018065-main_1.png https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0169433212018065/PREVIEW/image/png/212545c7cfae819fb76802597ceffb0f/main_1.png https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433212018065/PREVIEW/image/png/212545c7cfae819fb76802597ceffb0f/main_1.png main_1.png png 58601 849 656 IMAGE-WEB-PDF 1 1-s2.0-S0169433212018065-gr7.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433212018065/gr7/DOWNSAMPLED/image/jpeg/ff1f205f9a272caf398f424fb2b77ad1/gr7.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0169433212018065/gr7/DOWNSAMPLED/image/jpeg/ff1f205f9a272caf398f424fb2b77ad1/gr7.jpg gr7 gr7.jpg jpg 54881 202 753 IMAGE-DOWNSAMPLED 1-s2.0-S0169433212018065-gr2.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433212018065/gr2/DOWNSAMPLED/image/jpeg/dfde30c46fed0bd9f2596d0f4478b3a3/gr2.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0169433212018065/gr2/DOWNSAMPLED/image/jpeg/dfde30c46fed0bd9f2596d0f4478b3a3/gr2.jpg gr2 gr2.jpg jpg 101239 488 641 IMAGE-DOWNSAMPLED 1-s2.0-S0169433212018065-gr6.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433212018065/gr6/DOWNSAMPLED/image/jpeg/ff5b3aa6788b4a5b82dc1ad2a012495e/gr6.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0169433212018065/gr6/DOWNSAMPLED/image/jpeg/ff5b3aa6788b4a5b82dc1ad2a012495e/gr6.jpg gr6 gr6.jpg jpg 19617 266 331 IMAGE-DOWNSAMPLED 1-s2.0-S0169433212018065-gr5.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433212018065/gr5/DOWNSAMPLED/image/jpeg/28f0a698bc4bd2df84509066f959d4f7/gr5.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0169433212018065/gr5/DOWNSAMPLED/image/jpeg/28f0a698bc4bd2df84509066f959d4f7/gr5.jpg gr5 gr5.jpg jpg 17163 266 347 IMAGE-DOWNSAMPLED 1-s2.0-S0169433212018065-gr4.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433212018065/gr4/DOWNSAMPLED/image/jpeg/651462323d860f858de28f0bdb4237fe/gr4.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0169433212018065/gr4/DOWNSAMPLED/image/jpeg/651462323d860f858de28f0bdb4237fe/gr4.jpg gr4 gr4.jpg jpg 19508 253 345 IMAGE-DOWNSAMPLED 1-s2.0-S0169433212018065-gr3.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433212018065/gr3/DOWNSAMPLED/image/jpeg/a3d4c2a8bdbd3034ae775748ae3da931/gr3.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0169433212018065/gr3/DOWNSAMPLED/image/jpeg/a3d4c2a8bdbd3034ae775748ae3da931/gr3.jpg gr3 gr3.jpg jpg 15518 253 345 IMAGE-DOWNSAMPLED 1-s2.0-S0169433212018065-gr1.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433212018065/gr1/DOWNSAMPLED/image/jpeg/0ed971fbe426795d82027fd557916deb/gr1.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0169433212018065/gr1/DOWNSAMPLED/image/jpeg/0ed971fbe426795d82027fd557916deb/gr1.jpg gr1 gr1.jpg jpg 23017 367 227 IMAGE-DOWNSAMPLED 1-s2.0-S0169433212018065-gr7.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433212018065/gr7/THUMBNAIL/image/gif/5742de069fd57a2a0195af26d7e98a9d/gr7.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0169433212018065/gr7/THUMBNAIL/image/gif/5742de069fd57a2a0195af26d7e98a9d/gr7.sml gr7 gr7.sml sml 6682 59 219 IMAGE-THUMBNAIL 1-s2.0-S0169433212018065-gr2.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433212018065/gr2/THUMBNAIL/image/gif/376e7686e4cff8fb3ab121054063e8e0/gr2.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0169433212018065/gr2/THUMBNAIL/image/gif/376e7686e4cff8fb3ab121054063e8e0/gr2.sml gr2 gr2.sml sml 11068 164 215 IMAGE-THUMBNAIL 1-s2.0-S0169433212018065-gr6.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433212018065/gr6/THUMBNAIL/image/gif/17557cd4bd840338fd360d2c71cf81d8/gr6.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0169433212018065/gr6/THUMBNAIL/image/gif/17557cd4bd840338fd360d2c71cf81d8/gr6.sml gr6 gr6.sml sml 5217 164 204 IMAGE-THUMBNAIL 1-s2.0-S0169433212018065-gr5.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433212018065/gr5/THUMBNAIL/image/gif/addf235a44d543aafaaaeed0929cbc24/gr5.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0169433212018065/gr5/THUMBNAIL/image/gif/addf235a44d543aafaaaeed0929cbc24/gr5.sml gr5 gr5.sml sml 4971 163 213 IMAGE-THUMBNAIL 1-s2.0-S0169433212018065-gr4.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433212018065/gr4/THUMBNAIL/image/gif/5609f0eff8830d9d82709c84318d8602/gr4.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0169433212018065/gr4/THUMBNAIL/image/gif/5609f0eff8830d9d82709c84318d8602/gr4.sml gr4 gr4.sml sml 5727 160 219 IMAGE-THUMBNAIL 1-s2.0-S0169433212018065-gr3.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433212018065/gr3/THUMBNAIL/image/gif/2395ca63a1ef87112b38f9473045a6e9/gr3.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0169433212018065/gr3/THUMBNAIL/image/gif/2395ca63a1ef87112b38f9473045a6e9/gr3.sml gr3 gr3.sml sml 4534 160 219 IMAGE-THUMBNAIL 1-s2.0-S0169433212018065-gr1.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433212018065/gr1/THUMBNAIL/image/gif/7d147e8a3c19e93ef34ac4c03a05444b/gr1.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0169433212018065/gr1/THUMBNAIL/image/gif/7d147e8a3c19e93ef34ac4c03a05444b/gr1.sml gr1 gr1.sml sml 5703 163 101 IMAGE-THUMBNAIL APSUSC 24462 S0169-4332(12)01806-5 10.1016/j.apsusc.2012.10.081 Fig. 1 Processing sequence for the preparation of crystalline silicon solar cells with micro/nano surface texturing. Fig. 2 (a and b) Plan-view SEM images with different magnification of Si pyramid surfaces covered with nano-texture, (c) nano-texture on pyramid surface (high magnification), (d) cross-sectional SEM image, of the multi-scale surface texture. The inset in (b) shows higher magnification (100,000×) image of the nano-texture (scale bar – 100nm). Fig. 3 Light reflection of silicon surfaces with pyramids texture and pyramids/nano two-scale texture. Fig. 4 Light reflection evolution after different stages of solar cell device preparation. Fig. 5 External quantum efficiency spectra of solar cells with random pyramids texture and pyramids/nanotexture. Fig. 6 Internal quantum efficiency and reflectance of solar cells with random pyramids texture and pyramids/nanotexture. Fig. 7 Plan-view SEM images of nanotexture on pyramids textured c-Si (a) and (b and c) inverted pyramids formation after KOH etch-back for different time. Etch-back time of (c) was 2 times longer than (b). Scale bars – 1μm. Table 1 I–V parameters of pyramids textured and two-scale textured c-Si cells. Cell type V oc (mV) J sc (mA/cm2) FF (%) η (%) Reference average 615 33.9 77.9 16.3 Reference best 615 33.9 79.9 16.7 Micro/nano texture average 622 35.6 77.0 17.1 Micro/nano texture best 623 35.5 79.3 17.5 Crystalline silicon solar cells with micro/nano texture Dimitre Z. Dimitrov a ⁎ Chen-Hsun Du a b a Green Energy & Environment Research Labs, Industrial Technology Research Institute (ITRI), Chutung, Hsinchu, Taiwan b National Tsing Hua University (NTHU), Institute of NanoEngineering and MicroSystems, Hsinchu, Taiwan ⁎ Corresponding author at: Green Energy & Environment Research Labs, Industrial Technology Research Institute (ITRI), 195 Sect. 4, Chung Hsing Rd., Bldg. 51, R.1144, Chutung, Hsinchu, Taiwan. Tel.: +886 3 5915987; fax: +886 3 5822157. Highlights ► Combined micro/nano scale texture was produced on crystalline silicon surface ► The micro/nano scale texture features antireflection properties ► Solar cells with this texture are shown improved blue-response and conversion efficiency. Crystalline silicon solar cells with two-scale texture consisting of random upright pyramids and surface nanotextured layer directly onto the pyramids are prepared and reflectance properties and I–V characteristics measured. Random pyramids texture is produced by etching in an alkaline solution. On top of the pyramids texture, a nanotexture is developed using an electroless oxidation/etching process. Solar cells with two-scale surface texturization are prepared following the standard screen-printing technology sequence. The micro/nano surface is found to lower considerably the light reflectance of silicon. The short wavelengths spectral response (blue response) improvement is observed in micro/nano textured solar cells compared to standard upright pyramids textured cells. An efficiency of 17.5% is measured for the best micro/nano textured c-Si solar cell. The efficiency improvement is found to be due to the gain in both J sc and V oc. Keywords Crystalline silicon solar cell Texturization Nano structure Antireflection 1 Introduction The silicon surfaces functionality increasing is of high importance for various applications. One particular approach for implementing multifunctionality is the formation of two-scale structured surfaces, as for instance micron-scale structured surfaces that also possess nanoscale roughness. These surfaces have superhydrophobic self-cleaning (after an additional surface fluorination), photoluminescence and antireflection properties. There are several methods for preparation of two scale micro/nano surface structures, the metal-assisted etching [1] being one of the simplest and effective. Superhydrophobic surface was obtained by two-scale roughness prepared by this simple silicon etching techniques as described in [2]. Micron-scaled pyramid structure was obtained by anisotropic KOH etching and nanostructure onto these pyramids by metal-assisted etching in HF/H2O2 aqueous solution. Furthermore [3] the potential application of these two-scale rough surfaces formed by the metal-assisted etching of micron-sizes pyramid texture in antireflection and light-trapping properties was highlighted. Silicon solar cells texturization is important for the reflection losses reduction, increased light absorption as well as for an overall conversion efficiency improvement. Moreover, surface texture with nano-dimensions [4,5] is proven to be effective for broadband reflection suppression. The nanotextures could be also incorporated on microtextured silicon surfaces (for example, pyramids etched mono crystalline silicon) to improve even further the solar cell devices functionality [6]. Indeed on the micro/nanostructured two scale surfaces a weighted light reflectance of 3.8% in the 300–1000nm wavelength was measured [3]. Electroless stain etching in HF/HNO3 [7] and HF/Fe(NO3)3 [8] solutions, as well as electrochemical etching [9,10] was further employed for formation of nanoporous layer on pyramids pre-textured wafers. The prepared solar cells using these methods as well as metal-assisted electroless etching however possess rather low conversion efficiency [11]. In this paper a relatively simple method for producing a hierarchical (micro/nano) structure on the crystalline silicon surface is presented. The preparation method is using only electroless wet chemistry processes at room temperature. Solar cells with this multi-scale surface structure incorporated were prepared, by using the standard screen-printing process, and their performance measured. 2 Experimental The p-type CZ c-Si (100) wafers with thickness of 180–240μm and resistivity 3–6Ωcm were fabricated to solar cells using the processing sequence shown in Fig. 1 . A texturization with micron-sized random pyramids was performed in KOH-IPA solution at a temperature 80°C for 45min. The textured wafers were cleaned in HCl:H2O2:H2O (HPM) mixture at 80°C for 10min and then wafer surfaces H-terminated in diluted HF. The nanotexture onto the random pyramids was formed by two-step process consisting of an electroless treatment in an acidic aqueous solution of Na2S2O8 and AgNO3 (pH<3) for 6min followed by an etching in an aqueous solution of HF and H2O2 for 2min. Both treatments were performed at room temperature on 125cm×125cm pseudo square wafers. The electroless solution preparation details are described in [12]. The average sheet resistance after the phosphorous oxychloride (POCl3) diffusion and phosphor-silicate glass (PSG) removal in diluted HF was measured to be approximately 80Ω/sq. After PECVD deposition of a SiNx passivation and anti-reflection layer on the front side of the wafers, silver pattern contact and aluminum back surface field were formed by using screen-printing and co-firing in a belt IR furnace. The total reflectance of the texturized wafers and the solar cells was measured with a Hitachi U-3010 spectrophotometer equipped with an integrating sphere, in the wavelength range 300–900nm. The wafers surface morphology was studied by using scanning electron microscopy (SEM) technique. For SEM (JEOL JSM-6500F) measurements square pieces of size 20mm×20mm were prepared using laser cutting. The finished solar cells performance was analyzed by reflectance, quantum efficiency and I–V measurements. The solar cells current-voltage (I–V) parameters assessment was performed at 25°C under AM 1.5G solar spectrum using a solar simulator Wacom WXS-220S-L2 with power density of 1000W/m2. 3 Results and discussion 3.1 Surface structures Micron-sized surface pyramids were formed by anisotropic etching of silicon wafers with (100) orientation in an aqueous KOH-IPA solution. The treatment in Na2S2O8 activated by AgNO3 electroless solution and following 2min etching in HF/H2O2/H2O resulted in production of a nanostructure directly onto the pyramids covered silicon surface. The hierarchical (nanotexture on microtexture) structure prepared in the above described techniques is shown in Fig. 2 as plan-view as well as cross-sectional SEM images. The pyramids surface is covered uniformly with fine nanoporous layer. The pores lateral dimensions are less than 100nm, with a dept less than 200nm. Surface micro/nano combined two-scale structures attracted increasing interest due to the various potential applications. On silicon these structures possess multi-functionality with super hydrophobic and antireflective properties suitable for improving the reliability and conversion efficiency of the solar cells. 3.2 Surface reflectance and quantum efficiencies The surface reflectance of silicon wafers with random upright pyramids texture and nano/micro textured as well as the reflectance evolution of solar cells textured with hierarchical texture (nanotexture on macro/pyramids texture) after the consecutive preparation steps according to the standard screen-printing preparation process for solar cells are shown in Figs. 3 and 4 respectively. Over the measured interval (300–900nm) of wavelengths the reflectance of two-scale pyramids/nanotexure surface is below 3% – significantly lower than the reflectance of the random pyramids textured surface. The reflectance of the two-scale textured solar cells is lower especially at shorter wavelengths. The suppressed reflectance implies that the absorption of the sunlight will be improved. The optimized reflectance of the cells with hierarchical texture combined with the self-cleaning capability single out this approach as very attractive for solar cells with enhanced functionality. The solar cell reflectance is changed a little during the high-temperature processing suggesting the nano/micro texture stability. Mechanical testing [13] also revealed good resistance of such kind of surfaces. Fig. 5 presents the measured external quantum efficiency (EQE) of solar cells with random pyramids texture and pyramids/nanotexture. The estimated internal quantum efficiency (IQE), and reflectance of solar cells with random pyramids texture and pyramids/nanotexture are compared in Fig. 6 . The IQE spectra show improved blue response (wavelength range 300–450nm) of the pyramids/nanotexture textured solar cell, suggesting that passivation properties are not disturbed by the presence of the nanostructured surface layer. 3.3 I–V measurements on solar cells The I–V parameters measured on solar cells with hierarchical texturing as well as cells with conventional random upright pyramids texture for comparison are presented in Table 1 . The conventional cells were prepared with a 55Ω/sq emitter, which is typical for solar cells with diffused junction. The open circuit voltage (V oc) and the short circuit current (J sc) are both improved in the solar cells with hierarchical surface texture. The nanoporous structure with relatively shallow pore depth and the emitter with reduced doping (80Ω/sq compared to 55Ω/sq) lead to improved blue-response and the gain in J sc and V oc in the two-scale textured cells. On the best cell an efficiency of 17.5% was measured proofing the feasibility of the two-scale structure approach for incorporation in high-efficiency crystalline silicon solar cells. The improvement of these parameters reflects also on the efficiency being with 0.8% in average higher for the nano/micro textured solar cells. These results are similar to the recently published [14] on small form factor cells prepared by using multi-scale texturing on FZ silicon. 3.4 Formation of inverted pyramids nanostructure on random upright pyramids texture Fig. 7 shows a plan view SEM images for samples with nanotexture on pyramids texture etched in HF/H2O2/H2O solution for prolonged time of 4min as well as the surface morphology evolution after nanoporous layer etch-back for 2 different times of 6min and 12min in diluted alkaline solution. The samples without etch-back possess round shaped pores onto the pyramids with pore diameter less than 200nm. The pore dimensions depend on the etching time in the HF/H2O2/H2O solution. After an etch-back in diluted KOH however the nanoporous surface layer dissolved and square base random inverted pyramids are formed. The size of these pyramids was below 500nm. With longer etch-back time the size of the inverted pyramids increase up to 1μm. Therefore, finally a complex structure consisting on random square based inverted nano pyramids onto the surface of random upright micro pyramids is formed. 4 Conclusions Nanostructured silicon surfaces onto random upright pyramids microtexture were prepared by electroless treatment in activated Na2S2O8 solution followed by etching in HF/H2O2/H2O. The silicon surfaces manufactured in this way showed low light reflection, an improved short wavelength spectral response and enhanced solar cells efficiency. The results confirm the feasibility of two-scale surface texture for further incorporation in high-efficiency crystalline silicon solar cells. Acknowledgements The authors would like to acknowledge the financial support from the Bureau of Energy of Ministry of Economics, Taiwan. References [1] Z. Huang N. Geyer P. Werner J. de Boor U. Gösele Metal-assisted chemical etching of silicon: a review Adv. Mater. 23 2011 285 308 [2] Y. Xiu L. Zhu D.W. Hess C.P. Wong Hierarchical silicon etched structures for controlled hydrophobicity/superhydrophobicity Nano Lett. 7 2007 3388 3393 [3] Y. Xiu S. Zhang V. Yelundur A. Rohatgi D.W. Hess C.P. Wong Superhydrophobic and low light reflectivity silicon surfaces fabricated by hierarchical etching Langmuir 24 2008 10421 10426 [4] R.B. Stephens G.D. Cody Optical reflectance and transmission of a textured surface Thin Solid Films 45 1977 19 29 [5] J.I. Gittleman E.K. Sichel H.W. Lehmann R. Widmer Textured silicon: a selective absorber for solar thermal conversion Appl. Phys. Lett. 35 1979 742 744 [6] Y. Liu Y. Xiu C.P. Wong Micro/nano structure size effect on superhydrophobicity and anti reflection of single crystalline Si solar cells Proceedings of Electronic Components and Technology Conference 2010 1719 1724 [7] Z. Swiatek E. Beltowska W. Maziarz F. Krok Characterization and properties of a modified Si solar cell emitter by a porous Si layer Mater. Sci. Eng. B 101 2003 291 296 [8] J. Xiao L. Wang X. Li X. Pi D. Yang Reflectivity of porous-pyramids structured silicon surface Appl. Surf. Sci. 257 2010 472 475 [9] B.S. Kim D.H. Lee S.H. Kim G.H. An K.J. Lee N.V. Myung Y.H. Choa Silicon solar cell with nanoporous structure formed on a textured surface J. Am. Ceram. Soc. 92 2009 2415 2417 [10] N. Marrero R. Guerrero-Lemus B. Gonzalez-Diaz D. Borchert Effect of porous silicon stain etched on large area alkaline textured crystalline silicon solar cell Thin Solid Films 517 2009 2648 2650 [11] S. Lee E. Lee Characterization of nanoporous silicon layer to reduce the optical losses of crystalline silicon solar cells J. Nanosci. Nanotechnol. 7 2007 3713 3716 [12] D.Z.C. Dimitrov C.-H. Lin C.-H. Du C.-W. Lan Nanotextured crystalline silicon solar cells Phys. Status Solidi A 208 2011 2926 2933 [13] Y. Xiu Y. Liu D.W. Hess C.P. Wong Mechanically robust superhydrophobicity on hierarchically structured Si surfaces Nanotechnology 21 2010 155705 [14] F. Toor H.M. Branz M.R. Page K.M. Jones H.-C. Yuan Multi-scale surface texture to improve blue response of nanoporous black silicon solar cells Appl. Phys. Lett. 99 2011 103501", "scopus-id": "84872824151", "coredata": {"eid": "1-s2.0-S0169433212018065", "dc:description": "Crystalline silicon solar cells with two-scale texture consisting of random upright pyramids and surface nanotextured layer directly onto the pyramids are prepared and reflectance properties and I–V characteristics measured. Random pyramids texture is produced by etching in an alkaline solution. On top of the pyramids texture, a nanotexture is developed using an electroless oxidation/etching process. Solar cells with two-scale surface texturization are prepared following the standard screen-printing technology sequence. The micro/nano surface is found to lower considerably the light reflectance of silicon. The short wavelengths spectral response (blue response) improvement is observed in micro/nano textured solar cells compared to standard upright pyramids textured cells. An efficiency of 17.5% is measured for the best micro/nano textured c-Si solar cell. The efficiency improvement is found to be due to the gain in both J sc and V oc.", "openArchiveArticle": "false", "prism:coverDate": "2013-02-01", "openaccessUserLicense": null, "prism:aggregationType": "Journal", "prism:url": "https://api.elsevier.com/content/article/pii/S0169433212018065", "dc:creator": [{"@_fa": "true", "$": "Dimitrov, Dimitre Z."}, {"@_fa": "true", "$": "Du, Chen-Hsun"}], "link": [{"@_fa": "true", "@rel": "self", "@href": "https://api.elsevier.com/content/article/pii/S0169433212018065"}, {"@_fa": "true", "@rel": "scidir", "@href": "https://www.sciencedirect.com/science/article/pii/S0169433212018065"}], "dc:format": "application/json", "openaccessType": null, "pii": "S0169-4332(12)01806-5", "prism:volume": "266", "prism:publisher": "Published by Elsevier B.V.", "dc:title": "Crystalline silicon solar cells with micro/nano texture", "prism:copyright": "Copyright © 2012 Published by Elsevier B.V.", "openaccess": "0", "prism:issn": "01694332", "dcterms:subject": [{"@_fa": "true", "$": "Crystalline silicon solar cell"}, {"@_fa": "true", "$": "Texturization"}, {"@_fa": "true", "$": "Nano structure"}, {"@_fa": "true", "$": "Antireflection"}], "openaccessArticle": "false", "prism:publicationName": "Applied Surface Science", "openaccessSponsorType": null, "prism:pageRange": "1-4", "prism:endingPage": "4", "pubType": "fla", "prism:coverDisplayDate": "1 February 2013", "prism:doi": "10.1016/j.apsusc.2012.10.081", "prism:startingPage": "1", "dc:identifier": "doi:10.1016/j.apsusc.2012.10.081", "openaccessSponsorName": null}, "objects": {"object": [{"@category": "standard", "@height": "202", "@width": "753", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433212018065-gr7.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "54881", "@ref": "gr7", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "488", "@width": "641", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433212018065-gr2.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "101239", "@ref": "gr2", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "266", "@width": "331", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433212018065-gr6.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "19617", "@ref": "gr6", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "266", "@width": "347", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433212018065-gr5.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "17163", "@ref": "gr5", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "253", "@width": "345", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433212018065-gr4.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "19508", "@ref": "gr4", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "253", "@width": "345", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433212018065-gr3.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "15518", "@ref": "gr3", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "367", "@width": "227", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433212018065-gr1.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "23017", "@ref": "gr1", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "59", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433212018065-gr7.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "6682", "@ref": "gr7", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "164", "@width": "215", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433212018065-gr2.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "11068", "@ref": "gr2", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "164", "@width": "204", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433212018065-gr6.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "5217", "@ref": "gr6", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "163", "@width": "213", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433212018065-gr5.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "4971", "@ref": "gr5", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "160", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433212018065-gr4.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "5727", "@ref": "gr4", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "160", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433212018065-gr3.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "4534", "@ref": "gr3", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "163", "@width": "101", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433212018065-gr1.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "5703", "@ref": "gr1", "@mimetype": "image/gif"}]}, "link": {"@rel": "abstract", "@href": "https://api.elsevier.com/content/abstract/scopus_id/84872824151"}}