{"scopus-eid": "2-s2.0-77957668348", "originalText": "serial JL 271495 291210 291731 291732 291746 291809 291864 291865 291892 291893 31 Solar Energy Materials and Solar Cells SOLARENERGYMATERIALSSOLARCELLS 2010-04-24 2010-04-24 2010-11-04T22:33:16 1-s2.0-S092702481000214X S0927-0248(10)00214-X S092702481000214X 10.1016/j.solmat.2010.04.024 S300 S300.1 FULL-TEXT 1-s2.0-S0927024810X00149 2015-05-15T03:20:14.04684-04:00 0 0 20110101 20110131 2011 2010-04-24T00:00:00Z articleinfo crossmark dco dateupdated tomb dateloaded datesearch indexeddate issuelist volumelist yearnav articletitlenorm authfirstinitialnorm authfirstsurnamenorm cid cids confeditor contenttype copyright dateloadedtxt docsubtype doctype doi eid ewtransactionid hubeid issfirst issn issnnorm itemstage itemtransactionid itemweight openaccess openarchive pg pgfirst pglast pii piinorm pubdateend pubdatestart pubdatetxt pubyr sectiontitle sortorder srctitle srctitlenorm srctype subheadings vol volfirst volissue webpdf webpdfpagecount figure table body acknowledge affil articletitle auth authfirstini authfull authkeywords authlast primabst ref alllist content subj ssids 0927-0248 09270248 95 95 1 1 Volume 95, Issue 1 55 215 218 215 218 201101 January 2011 2011-01-01 2011-01-31 2011 19th International Photovoltaic Science and Engineering Conference and Exhibition (PVSEC-19) Jeju, Korea, 9-13 November 2009 Kwanghee Lee Byung Tae Ahn Chang-Sik Son Amorphous and Nano/Microcrystalline Silicon Based Solar Cells and Related Materials article fla Copyright © 2010 Elsevier B.V. All rights reserved. FABRICATIONSILICONNANOWIREARRAYSBASEDSOLARCELLIMPROVEDPERFORMANCE KUMAR D 1 Introduction 2 Experimental details 3 Results and discussion 4 Conclusion Acknowledgement References DUAN 2003 241 245 S JUANG 2005 142 147 Y PENG 2002 1164 1167 K PENG 2006 7942 7947 K PENG 2005 1062 1067 K FANG 2008 1 6 H WOLF 1963 455 479 M SINGH 2003 21 31 P KUMARX2011X215 KUMARX2011X215X218 KUMARX2011X215XD KUMARX2011X215X218XD item S0927-0248(10)00214-X S092702481000214X 1-s2.0-S092702481000214X 10.1016/j.solmat.2010.04.024 271495 2010-11-16T12:53:49.643808-05:00 2011-01-01 2011-01-31 1-s2.0-S092702481000214X-main.pdf https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S092702481000214X/MAIN/application/pdf/bc56de3dbf55c48758dd369a29995616/main.pdf https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S092702481000214X/MAIN/application/pdf/bc56de3dbf55c48758dd369a29995616/main.pdf main.pdf pdf true 599751 MAIN 4 1-s2.0-S092702481000214X-main_1.png https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S092702481000214X/PREVIEW/image/png/8e8251cf8cccfcd112ad5f9ba7b39aea/main_1.png https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S092702481000214X/PREVIEW/image/png/8e8251cf8cccfcd112ad5f9ba7b39aea/main_1.png main_1.png png 58503 849 656 IMAGE-WEB-PDF 1 1-s2.0-S092702481000214X-gr1.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S092702481000214X/gr1/DOWNSAMPLED/image/jpeg/0b36e464ccc7a0a3c31650db0cce13dc/gr1.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S092702481000214X/gr1/DOWNSAMPLED/image/jpeg/0b36e464ccc7a0a3c31650db0cce13dc/gr1.jpg gr1 gr1.jpg jpg 36320 511 386 IMAGE-DOWNSAMPLED 1-s2.0-S092702481000214X-gr1.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S092702481000214X/gr1/THUMBNAIL/image/gif/8c824cc3dcc2de9572d967093b5874a7/gr1.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S092702481000214X/gr1/THUMBNAIL/image/gif/8c824cc3dcc2de9572d967093b5874a7/gr1.sml gr1 gr1.sml sml 8501 163 123 IMAGE-THUMBNAIL 1-s2.0-S092702481000214X-gr2.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S092702481000214X/gr2/DOWNSAMPLED/image/jpeg/9c1bbdff3df7ad2ee4ecc20d43b78ab8/gr2.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S092702481000214X/gr2/DOWNSAMPLED/image/jpeg/9c1bbdff3df7ad2ee4ecc20d43b78ab8/gr2.jpg gr2 gr2.jpg jpg 26273 321 384 IMAGE-DOWNSAMPLED 1-s2.0-S092702481000214X-gr2.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S092702481000214X/gr2/THUMBNAIL/image/gif/2d07867289a7148a9856d71ee864e59a/gr2.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S092702481000214X/gr2/THUMBNAIL/image/gif/2d07867289a7148a9856d71ee864e59a/gr2.sml gr2 gr2.sml sml 3937 164 196 IMAGE-THUMBNAIL 1-s2.0-S092702481000214X-gr3.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S092702481000214X/gr3/DOWNSAMPLED/image/jpeg/4d0091da6c024d50d007dd69b85ab317/gr3.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S092702481000214X/gr3/DOWNSAMPLED/image/jpeg/4d0091da6c024d50d007dd69b85ab317/gr3.jpg gr3 gr3.jpg jpg 72905 568 385 IMAGE-DOWNSAMPLED 1-s2.0-S092702481000214X-gr3.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S092702481000214X/gr3/THUMBNAIL/image/gif/15513fb7a7af16fe292ff53981a5aa23/gr3.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S092702481000214X/gr3/THUMBNAIL/image/gif/15513fb7a7af16fe292ff53981a5aa23/gr3.sml gr3 gr3.sml sml 5679 164 111 IMAGE-THUMBNAIL 1-s2.0-S092702481000214X-gr4.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S092702481000214X/gr4/DOWNSAMPLED/image/jpeg/e4aae2ad2af86291b5ace657999a3d95/gr4.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S092702481000214X/gr4/DOWNSAMPLED/image/jpeg/e4aae2ad2af86291b5ace657999a3d95/gr4.jpg gr4 gr4.jpg jpg 63832 589 385 IMAGE-DOWNSAMPLED 1-s2.0-S092702481000214X-gr4.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S092702481000214X/gr4/THUMBNAIL/image/gif/c6ab873cb92812e48906e8d705839e63/gr4.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S092702481000214X/gr4/THUMBNAIL/image/gif/c6ab873cb92812e48906e8d705839e63/gr4.sml gr4 gr4.sml sml 4166 164 107 IMAGE-THUMBNAIL SOLMAT 5146 S0927-0248(10)00214-X 10.1016/j.solmat.2010.04.024 Elsevier B.V. Fig. 1 Cross-sectional SEM images of SiNW arrays of length (a) ∼4μm and (b) SiNW arrays grown selectively on the active device area (grey regions). Fig. 2 Reflectivity of polished (CMP) silicon and ∼4μm long SiNWs arrays surfaces. Fig. 3 SEM images of metal contacts (Ti/Ag) on SiNW arrays based solar cells showing (a) planar top view of electrodes directly made on SiNWs and the inset shows the corresponding cross-section view and (b) top view of metal electrodes made over planar surface where SiNWs are grown selectively in the active device area and the inset shows corresponding cross-section view. Fig. 4 (a) Illuminated current–voltage plot of control cell and selectively grown SiNW arrays based silicon solar cells (of wire length ∼4μm, Cell C), (b) IQE and reflectivity plots for control and different SiNW arrays based cells. Table 1 Solar cell parameters i.e. short circuit current density (J sc), open circuit voltage (V oc), curve factor (CF), efficiency (η), series (R s), shunt (R sh) resistances and bulk diffusion length (L b) of (i) control cell, Cell A, (ii) SiNWs on entire front surface, Cell B and (iii) SiNWs on the active device area, Cell C. Cell detail J sc (mA/cm2) V oc (mV) CF η(%) R s (Ω) R sh(kΩ) Diffusion length (μm) Cell A 29.3 588 0.73 12.64 0.512 4.8 128 Cell B 28 531 0.36 5.3 1.6 0.454 152 Cell C 37 544 0.68 13.7 0.85 2.2 194 Fabrication of silicon nanowire arrays based solar cell with improved performance Dinesh Kumar a Sanjay K. Srivastava a ⁎ P.K. Singh a M. Husain b Vikram Kumar a c a National Physical Laboratory, Council of Scientific & Industrial Research (CSIR), Dr. K.S. Krishnan Marg, New Delhi 110012, India b Department of Physics, Jamia Millia Islamia, New Delhi 110025, India c Department of Physics, Indian Institute of Technology Delhi, New Delhi 110016, India ⁎ Corresponding author. Tel.: +911145608617; fax: +911145609310. We report fabrication of solar cell (n+–p–p+ structure) on black silicon substrates consisting of silicon nanowire (SiNW) arrays prepared by Ag induced wet chemical etching process in aqueous HF–AgNO3 solution. SiNW arrays surface has low reflectivity (<5%) in the entire spectral range (400–1100nm) of interest for solar cells. The solar cells were fabricated by conventional cell fabrication protocol. Performance of three types of cells, namely cell with SiNW over the entire front surface, cell with SiNW only in the active device area and control cell (on planar surface), has been compared. It was found that cell based on selectively grown shorter length SiNW arrays has the best cell performance. Keywords Silicon nanowires Solar cells Antireflection property Wet etching 1 Introduction Recently, silicon nanowires (SiNWs) are becoming more attractive due to their unique electrical and optical properties compared to bulk silicon, which makes them a potential candidate for photovoltaic applications [1–3]. Recently several methods have been reported for the synthesis of silicon nanowires. Among these, synthesis of SiNWs by silver (Ag) induced chemical etching of silicon is simple, economical and can easily be introduced in the standard cell fabrication process [3,4]. The SiNW arrays thus fabricated has excellent antireflection (AR) property and solar cell on such arrays has already been reported [3–7]. Despite excellent AR property, the efficiency of these cells was much lower than the conventional silicon solar cells [5]. The major problem was to make metal electrodes directly over the SiNW arrays, which were not compact and ohmic in nature. Fang et al. [6] have tried to overcome this problem by fabricating cells on slantingly aligned SiNW arrays on (111) p-type Si substrate but highly compact contacts could not be made. Recently we have reported a simple method to prepare silicon nanowire (SiNW) arrays on (100) p-silicon, which have excellent light trapping properties [7,8]. Further, we have developed fabrication process for n+–p–p+ solar cell on such SiNW arrays substrates where the problem of metal contacts has been overcome by growing SiNW arrays selectively in the active area (i.e. emitter exposed to light) of solar cell while keeping metal grid pattern on flat surface by protecting it with a suitable silicon etchant resist layer [9]. In this paper, we report new developments in the fabrication process to improve the SiNW arrays based cell’s efficiency. The performance of three cells, (i) a control cell without antireflection coating, Cell A, (ii) with SiNW all over the entire front surface, Cell B and (iii) with SiNWs only in the active area of device, Cell C, is compared. It has been found that cells having SiNWs selectively on the active device area have low contact resistance compared to the cell with SiNWs all over the entire front surface. The former has also the best cell performance. 2 Experimental details Growth of SiNW arrays was carried out on a p-type (1–5Ωcm, B-doped), chemically–mechanically polished (CMP) with (100) orientation and CZ silicon wafers of 5cm diameter in aqueous 5M HF solution containing 0.02M AgNO3 using the electroless etching method at room temperature. Initial thickness of the silicon wafers was 300±10μm. The etching was carried out in a simple Teflon vessel. Before etching, silicon wafers were sequentially cleaned with acetone and de-ionized with water piranha solution (H2SO4:H2O2=3:1 by volume, for 60min).The wafers were then rinsed thoroughly with de-ionized water followed by 5% HF solution to remove the native oxide. The cleaned silicon wafers were then immersed in the etching solution for 15min to grow SiNWs. All other parameters such as solution concentration, volume, temperature, etc. were kept constant. Detail description of the growth process and structure of the SiNWs has been presented elsewhere [8]. The samples obtained after etching were found to be wrapped with thick Ag layer, which consisted of high density of tree-like dendritic structures [8]. To remove Ag layer completely, the as-prepared samples were treated in a conventional Ag etchant solution (NH3OH:H2O2::3:1, for 2min at room temperature). Finally, the samples were rinsed with de-ionized water, blown dry in air and subjected to further investigations. Morphology of the samples was examined by scanning electron microscope (SEM) (Model LEO 440 VP) and reflectivity measurements were carried out by spectrophotometer (Model Shimadzu-UV 3101PC) in 300–1100nm wavelength range. Two sets of SiNW arrays samples were prepared for cell fabrication: (i) with entire area SiNW arrays of length∼4μm (Cell B) and (ii) selectively grown SiNW arrays of length∼4μm on active device area (on the front) by protecting the regions where front electrodes are to be made by an etch resistant layer (Cell C). The n+–p–p+ structure based solar cells were fabricated by conventional cell fabrication protocol [9]. After RCA cleaning, the wafers were subjected to phosphorus diffusion using solid dopant disc source at 900°C followed by Al layer deposition on the rear surface by thermal evaporation and alloying in N2 ambient at 750°C to form back surface field (BSF). The front metal contacts were made by Ti/Ag deposition through metal masks followed by contact sintering in forming gas. Finally, 2×2cm2 solar cells were diced from the wafer for characterization. A control solar cell (Cell A) having CMP silicon surface was also processed in the same batch to compare the relative performance of the SiNW based solar cells. The emitter’s sheet resistance measured on the control cell was ∼20Ω/sq. The shunt resistance of the cells is calculated from the slope of the I–V curves near short circuit conditions while series resistance is calculated by plotting the I–V curves at two different intensities of illumination [10]. The diffusion length of the minority carriers in the bulk region is determined from the spectral response curves of the cells at long wavelengths [11]. 3 Results and discussion Fig. 1 (a) shows the cross-sectional SEM image of vertically aligned SiNW arrays of length ∼4μm prepared for 15min. The cross-sectional SEM image of selectively grown SiNW arrays sample is also shown in Fig. 1 (b) where planar (on right hand side) and SiNWs (wide grey region) areas can be seen. The formation of SiNW arrays occurs due to the selective anisotropic etching of silicon substrate in aqueous HF solution induced by the Ag nanoparticles, the details of which can be seen elsewhere [8]. The diameter of SiNWs, which are vertically aligned was found in the range of 40–200nm. SiNWs of desired length could be made by controlling the etching time [8]. The sample surface appeared black after removal of Ag layer and was completely free from any metal impurities after RCA cleaning. Fig. 2 shows the spectral reflectivity of SiNW arrays of lengths ∼4μm (obtained by 15min etching) along with a polished silicon wafer. Remarkable decrease in reflectivity (∼2% in 300–600nm range) is observed in SiNW arrays samples compared to the polished silicon surface. However, at higher wavelengths reflectivity in case of SiNW arrays is slightly higher but average value of reflectivity is <5% for the entire spectral range (300–1000nm). The low reflectivity from SiNW arrays surface has been attributed to the structural morphology of SiNW arrays, which closely resembles with sub-wavelength-structured (SWS) surfaces. In addition, because of the unique morphology, there is porosity variation from top to bottom in the arrays, which results in refractive index gradient with depth and, therefore, SiNW arrays effectively act as a multi-layer anti-reflection surface [7]. Fig. 3(a) and (b) show the SEM images of surface morphology of the front metal (Ti/Ag) electrodes on the SiNW arrays and on planar surface, respectively along with their cross-sectional view in their respective insets. These images clearly indicate that the Ti/Ag contacts (made on the planar surface of the cell) in the case of selectively grown SiNW arrays samples are continuous, compact and well adhered to the cell surface whereas the contacts made directly on SiNWs consist of granular patterns, which are discontinuous and also not compact. Thus, earlier approach of making front contacts directly on SiNW arrays had problems of high contact resistance and low shunt values. On the other hand, good contacts could be made if the SiNWs are grown selectively on active device area and should have same electrical properties. Fig. 4 (a) shows the illuminated I–V characteristics of the control cell and SiNW arrays based cell measured under AM 1.5G (100mW/cm2 at 25°C). The solar cell parameters such as short circuit current density (J sc), open circuit voltage (V oc), curve factor (CF), efficiency (η), series (R s), shunt (R sh) resistances and bulk diffusion length for all cells are summarized in Table 1. In terms of efficiency, the maximum and minimum values are observed in Cells C and B, respectively. The efficiency and J sc of Cell C is enhanced by∼1% and ∼26%, respectively as compared to the control cell whereas V oc is∼8% lower. It is clear from Table 1 that the cell on selectively grown SiNW substrates has good CF as well as series and shunt resistance values, which are close to that of the control cell. It indicates that good quality electrical contacts could be realized through selective SiNW arrays approach. The poor performance of the cell B, which had SiNWs over the entire front surface, could be attributed to the poor electrical contacts and localized shunting (very low R sh) due to metal deposition on the SiNWs surface, a fact also reflected in their values. The localized shunting may occur due to breaking of SiNWs during metal deposition. The best efficiency of the SiNW arrays based cell is still not as high as expected from the excellent anti-reflective property of the SiNW arrays surface and improved electrical contacts. The decrease in V oc is rather surprising and is indeed the primary reason of only marginal improvement in cell efficiency. Enhanced recombination losses due to large surface area of the SiNWs may have important role in SiNWs based silicon solar cells. Intrinsic quantum efficiency (IQE) of the control and SiNW arrays based cells are shown in Fig. 4 (b) along with the reflectivity of the surfaces after cell processing (but before making contacts), which remains around ∼5% in 400–1000nm wavelength range. However, there is a significant reduction in IQE at shorter wavelength in all the SiNW arrays based cells. It shows that improvement in processing is required particularly for the emitter quality, enhancement in V oc and incorporation of surface passivation. The IQE of SiNWs based cells is improved at long wavelength region, which suggests that the SiNWs based cell has good absorption properties at long wavelengths, which is also reflected in diffusion length values estimated from long wavelength data. Besides this, several other issues like whether the p–n junction is also formed coaxially in SiNWs or the SiNWs get converted fully into n-type after diffusion and the contribution of large surface area towards increased surface recombination losses are to be resolved. Our future investigations will focus on the optimization of several process parameters related with SiNW arrays morphology, diffusion, surface recombination losses associated with enhanced surface area, etc. which may result in improved cell performance. 4 Conclusion In conclusion, we have demonstrated fabrication of SiNW arrays based silicon solar cells prepared with highly improved antireflection property. The synthesis of SiNWs by a simple wet chemical etching method can easily be integrated in silicon solar cell fabrication technology. A new approach to make front electrodes on SiNW arrays based solar cells through selective SiNW arrays growth has been developed to improve the cell performances. An enhancement of 25–30% in short circuit current density has been realized. However, this increase in J sc could not be reflected in the efficiency of the cells. This is due to the reduction in V oc and metal contact parameters. To improve this, attempts are being made to passivate the surface. The process needs further optimization of various parameters related with SiNW formation, diffusion, etc. that may result in further improvement in cell performance. Acknowledgement The present work is sponsored by the Council of Scientific & Industrial Research (CSIR), India under network project SIP-017. One of the authors, Dinesh Kumar, is grateful to University Grant Commission (UGC), India for providing financial support in the form of research fellowship. References [1] S.F. Duan Y. Huang R. Agarwal C.M. Lieber Single-nanowire electrically driven lasers Nature 421 2003 241 245 [2] Y. Juang X.F. Duan C.M. Lieber Nanowires for integrated multicolor nanophotonics Small 1 2005 142 147 [3] K.Q. Peng Y.J. Yan S.P. Gao J. Zhu Synthesis of large-area silicon nanowire arrays via self-assembly nano-electrochemistry Adv. Matter 14 2002 1164 1167 [4] K. Peng H. Fang J. Hu Y. Wu J. Zhu Y. Yan S.T. Lee Metal-particle-induced, highly localized site-specific etching of Si and formation of single-crystalline Si nanowires in aqueous fluoride solution Chem. Eur. J. 12 2006 7942 7947 [5] K.Q. Peng Y. Xu Y. Yu Y.J. You S.T. Lee J. Zhu Aligned single-crystalline Si nanowire arrays for photovoltaic application Small 1 2005 1062 1067 [6] H. Fang L. Xudong S. Shuang X. Ying Z. Jing Fabrication of slantingly-aligned silicon nanowire arrays for solar cell applications Nanotechnology 19 2008 1 6 255703 [7] S.K. Srivastava, D. Kumar, P.K. Singh, M. Kar, M. Hussain, V. Kumar, Excellent antireflection properties of vertical silicon nanowire arrays, Sol. Energy Mater. Sol. Cells, 2010, in press, doi:10.1016/j.solmat.2010.02.033. [8] D. Kumar, S.K. Srivastava, P.K. Singh, K.N. Sood, V.N. Singh, N. Dilawar, M. Husain, Room temperature growth of wafer-scale silicon nanowire arrays and their Raman characteristics, J. Nanopart. Res., 2010, in press, doi:10.1007/s11051-009-9795-7. [9] S.K. Srivastava, D. Kumar, P.K. Singh, V. Kumar, Silicon nanowire arrays based “black silicon” solar cells, in : Proceedings of the 34 IEEE Photovoltaic Specialists Conference, Philadelphia, PA, United States, 2009, pp. 1851–1856. [10] M. Wolf H. Rauschenbach Series resistance effects on solar cell measurements Adv. Energy Convers. 3 1963 455 479 [11] P.K. Singh Ravi Kumar P.N. Vinod B.C. Chakravarty S.N. Singh Effect of spatial variation of incident radiation on spectral response of a large area silicon solar cell and the cell parameters obtained from it Sol. Energy Mater. Sol. Cells 80 2003 21 31", "scopus-id": "77957668348", "coredata": {"eid": "1-s2.0-S092702481000214X", "dc:description": "We report fabrication of solar cell (n+–p–p+ structure) on black silicon substrates consisting of silicon nanowire (SiNW) arrays prepared by Ag induced wet chemical etching process in aqueous HF–AgNO3 solution. SiNW arrays surface has low reflectivity (<5%) in the entire spectral range (400–1100nm) of interest for solar cells. The solar cells were fabricated by conventional cell fabrication protocol. Performance of three types of cells, namely cell with SiNW over the entire front surface, cell with SiNW only in the active device area and control cell (on planar surface), has been compared. It was found that cell based on selectively grown shorter length SiNW arrays has the best cell performance.", "openArchiveArticle": "false", "prism:coverDate": "2011-01-31", "openaccessUserLicense": null, "prism:aggregationType": "Journal", "prism:url": "https://api.elsevier.com/content/article/pii/S092702481000214X", "dc:creator": [{"@_fa": "true", "$": "Kumar, Dinesh"}, {"@_fa": "true", "$": "Srivastava, Sanjay K."}, {"@_fa": "true", "$": "Singh, P.K."}, {"@_fa": "true", "$": "Husain, M."}, {"@_fa": "true", "$": "Kumar, Vikram"}], "link": [{"@_fa": "true", "@rel": "self", "@href": "https://api.elsevier.com/content/article/pii/S092702481000214X"}, {"@_fa": "true", "@rel": "scidir", "@href": "https://www.sciencedirect.com/science/article/pii/S092702481000214X"}], "dc:format": "application/json", "openaccessType": null, "pii": "S0927-0248(10)00214-X", "prism:volume": "95", "prism:publisher": "Elsevier B.V.", "dc:title": "Fabrication of silicon nanowire arrays based solar cell with improved performance", "prism:copyright": "Copyright © 2010 Elsevier B.V. All rights reserved.", "prism:issueName": "19th International Photovoltaic Science and Engineering Conference and Exhibition (PVSEC-19) Jeju, Korea, 9-13 November 2009", "openaccess": "0", "prism:issn": "09270248", "prism:issueIdentifier": "1", "dcterms:subject": [{"@_fa": "true", "$": "Silicon nanowires"}, {"@_fa": "true", "$": "Solar cells"}, {"@_fa": "true", "$": "Antireflection property"}, {"@_fa": "true", "$": "Wet etching"}], "openaccessArticle": "false", "prism:publicationName": "Solar Energy Materials and Solar Cells", "prism:number": "1", "openaccessSponsorType": null, "prism:pageRange": "215-218", "prism:endingPage": "218", "pubType": "fla", "prism:coverDisplayDate": "January 2011", "prism:doi": "10.1016/j.solmat.2010.04.024", "prism:startingPage": "215", "dc:identifier": "doi:10.1016/j.solmat.2010.04.024", "openaccessSponsorName": null}, "objects": {"object": [{"@category": "standard", "@height": "511", "@width": "386", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S092702481000214X-gr1.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "36320", "@ref": "gr1", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "163", "@width": "123", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S092702481000214X-gr1.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "8501", "@ref": "gr1", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "321", "@width": "384", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S092702481000214X-gr2.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "26273", "@ref": "gr2", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "164", "@width": "196", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S092702481000214X-gr2.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "3937", "@ref": "gr2", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "568", "@width": "385", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S092702481000214X-gr3.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "72905", "@ref": "gr3", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "164", "@width": "111", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S092702481000214X-gr3.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "5679", "@ref": "gr3", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "589", "@width": "385", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S092702481000214X-gr4.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "63832", "@ref": "gr4", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "164", "@width": "107", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S092702481000214X-gr4.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "4166", "@ref": "gr4", "@mimetype": "image/gif"}]}, "link": {"@rel": "abstract", "@href": "https://api.elsevier.com/content/abstract/scopus_id/77957668348"}}