{"scopus-eid": "2-s2.0-67349229272", "originalText": "serial JL 271378 291210 291719 291777 291892 31 Materials Science and Engineering: B MATERIALSSCIENCEENGINEERINGB 2008-11-14 2008-11-14 2010-04-18T15:14:22 1-s2.0-S0921510708004868 S0921-5107(08)00486-8 S0921510708004868 10.1016/j.mseb.2008.10.019 S300 S300.1 FULL-TEXT 1-s2.0-S0921510709X00048 2015-05-15T02:56:37.776287-04:00 0 0 20090315 2009 2008-11-14T00:00:00Z articleinfo crossmark dco dateupdated tomb dateloaded datesearch indexeddate volumelist yearnav articletitlenorm authfirstinitialnorm authfirstsurnamenorm cid cids confeditor contenttype copyright dateloadedtxt docsubtype doctype doi eid ewtransactionid hubeid issn issnnorm itemstage itemtransactionid itemweight openaccess openarchive pg pgfirst pglast pii piinorm pubdatestart pubdatetxt pubyr sectiontitle sortorder srctitle srctitlenorm srctype subheadings suppl vol volfirst volissue webpdf webpdfpagecount figure body affil articletitle auth authfirstini authfull authkeywords authlast primabst ref alllist content subj ssids 0921-5107 09215107 159 160 159 160 C Volumes 159–160 80 333 337 333 337 20090315 15 March 2009 2009-03-15 2009 EMRS 2008 Spring Conference Symposium K: Advanced Silicon Materials Research for Electronic and Photovoltaic Applications S. Pizzini University of Milano-Bicocca, Milano, Italy G. Kissinger IHP, Frankfurt-Oder, Germany. H.Tu GRINM, Bejing, China H.Yamada-Kaneta University of Niigata, Japan Solar Cell technology issues article fla Copyright © 2008 Elsevier B.V. All rights reserved. BLACKSURFACESTRUCTURESFORCRYSTALLINESILICONSOLARCELLS YOO J 1 Introduction 2 Experimental 3 Results and discussion 4 Conclusion References FAHRENBRUCH 1983 A FUNDAMENTALSOLARCELLS PATH 1994 P PROCEEDINGS24THIEEEPHOTOVOLTAICSPECIALISTCONFERENCE ZHAO 1998 1991 J BILYALOV 1999 2035 2040 R INOMATA 1997 237 Y JANSEN 1995 115 120 H WELLS 1997 397 T KUMARAVELU 2002 258 260 G PROCEEDINGS29THIEEEPHOTOVOLTAICSPECIALISTSCONFERENCE HSIAO 1998 63 R SCHNELL 2000 367 370 M PROCEEDINGS28THIEEEPHOTOVOLTAICSPECIALISTSCONFERENCE YOOX2009X333 YOOX2009X333X337 YOOX2009X333XJ YOOX2009X333X337XJ item S0921-5107(08)00486-8 S0921510708004868 1-s2.0-S0921510708004868 10.1016/j.mseb.2008.10.019 271378 2010-09-21T20:08:02.748217-04:00 2009-03-15 1-s2.0-S0921510708004868-main.pdf https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0921510708004868/MAIN/application/pdf/ba4aae71f5c798269de9034088ffe4b9/main.pdf https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0921510708004868/MAIN/application/pdf/ba4aae71f5c798269de9034088ffe4b9/main.pdf main.pdf pdf true 1006813 MAIN 5 1-s2.0-S0921510708004868-main_1.png https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0921510708004868/PREVIEW/image/png/a5626edcc56084e6b6ca174d261717fa/main_1.png https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0921510708004868/PREVIEW/image/png/a5626edcc56084e6b6ca174d261717fa/main_1.png main_1.png png 61334 849 656 IMAGE-WEB-PDF 1 1-s2.0-S0921510708004868-gr2.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0921510708004868/gr2/DOWNSAMPLED/image/jpeg/047caa8c2d91d4cc418896e58a3f5226/gr2.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0921510708004868/gr2/DOWNSAMPLED/image/jpeg/047caa8c2d91d4cc418896e58a3f5226/gr2.jpg gr2 gr2.jpg jpg 208123 570 788 IMAGE-DOWNSAMPLED 1-s2.0-S0921510708004868-gr2.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0921510708004868/gr2/THUMBNAIL/image/gif/39d369c1c055e8b5f5bfde7eb715ee3e/gr2.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0921510708004868/gr2/THUMBNAIL/image/gif/39d369c1c055e8b5f5bfde7eb715ee3e/gr2.sml gr2 gr2.sml sml 14837 159 219 IMAGE-THUMBNAIL 1-s2.0-S0921510708004868-gr4.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0921510708004868/gr4/DOWNSAMPLED/image/jpeg/2b9b40486a83beee41dfaab8d8eaf062/gr4.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0921510708004868/gr4/DOWNSAMPLED/image/jpeg/2b9b40486a83beee41dfaab8d8eaf062/gr4.jpg gr4 gr4.jpg jpg 110442 572 394 IMAGE-DOWNSAMPLED 1-s2.0-S0921510708004868-gr4.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0921510708004868/gr4/THUMBNAIL/image/gif/b3a577cad87df7a11973b955fdfc5f2f/gr4.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0921510708004868/gr4/THUMBNAIL/image/gif/b3a577cad87df7a11973b955fdfc5f2f/gr4.sml gr4 gr4.sml sml 8338 164 113 IMAGE-THUMBNAIL 1-s2.0-S0921510708004868-gr1.gif https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0921510708004868/gr1/DOWNSAMPLED/image/gif/cb38e9798c784d83fea279e99397f649/gr1.gif https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0921510708004868/gr1/DOWNSAMPLED/image/gif/cb38e9798c784d83fea279e99397f649/gr1.gif gr1 gr1.gif gif 6714 248 365 IMAGE-DOWNSAMPLED 1-s2.0-S0921510708004868-gr1.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0921510708004868/gr1/THUMBNAIL/image/gif/9ab963435f04f367b070b1ffd5a35c85/gr1.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0921510708004868/gr1/THUMBNAIL/image/gif/9ab963435f04f367b070b1ffd5a35c85/gr1.sml gr1 gr1.sml sml 3407 149 219 IMAGE-THUMBNAIL 1-s2.0-S0921510708004868-gr3.gif https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0921510708004868/gr3/DOWNSAMPLED/image/gif/568bb9775478c67273cba18db8d8d0f9/gr3.gif https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0921510708004868/gr3/DOWNSAMPLED/image/gif/568bb9775478c67273cba18db8d8d0f9/gr3.gif gr3 gr3.gif gif 6817 255 364 IMAGE-DOWNSAMPLED 1-s2.0-S0921510708004868-gr3.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0921510708004868/gr3/THUMBNAIL/image/gif/5a8c3a07d548dbde6c6ea0baab29a0ee/gr3.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0921510708004868/gr3/THUMBNAIL/image/gif/5a8c3a07d548dbde6c6ea0baab29a0ee/gr3.sml gr3 gr3.sml sml 3449 154 219 IMAGE-THUMBNAIL 1-s2.0-S0921510708004868-gr5.gif https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0921510708004868/gr5/DOWNSAMPLED/image/gif/1eac62c57785ac5eb1457dfd35798661/gr5.gif https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0921510708004868/gr5/DOWNSAMPLED/image/gif/1eac62c57785ac5eb1457dfd35798661/gr5.gif gr5 gr5.gif gif 8483 274 371 IMAGE-DOWNSAMPLED 1-s2.0-S0921510708004868-gr5.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0921510708004868/gr5/THUMBNAIL/image/gif/f9e2ee738d2d6858acbec995a95ccff5/gr5.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0921510708004868/gr5/THUMBNAIL/image/gif/f9e2ee738d2d6858acbec995a95ccff5/gr5.sml gr5 gr5.sml sml 4333 162 219 IMAGE-THUMBNAIL 1-s2.0-S0921510708004868-gr6.gif https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0921510708004868/gr6/DOWNSAMPLED/image/gif/56f96726175f8aab30c67c734038fba1/gr6.gif https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0921510708004868/gr6/DOWNSAMPLED/image/gif/56f96726175f8aab30c67c734038fba1/gr6.gif gr6 gr6.gif gif 6638 269 368 IMAGE-DOWNSAMPLED 1-s2.0-S0921510708004868-gr6.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0921510708004868/gr6/THUMBNAIL/image/gif/cbba13ffe5da2ea6f686ebef4c8e8ad2/gr6.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0921510708004868/gr6/THUMBNAIL/image/gif/cbba13ffe5da2ea6f686ebef4c8e8ad2/gr6.sml gr6 gr6.sml sml 3312 160 219 IMAGE-THUMBNAIL 1-s2.0-S0921510708004868-gr7.gif https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0921510708004868/gr7/DOWNSAMPLED/image/gif/fab031d911afecd5f1eaffc7e575df30/gr7.gif https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0921510708004868/gr7/DOWNSAMPLED/image/gif/fab031d911afecd5f1eaffc7e575df30/gr7.gif gr7 gr7.gif gif 10787 547 356 IMAGE-DOWNSAMPLED 1-s2.0-S0921510708004868-gr7.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0921510708004868/gr7/THUMBNAIL/image/gif/6621d763f3906779da5250f632e951b5/gr7.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0921510708004868/gr7/THUMBNAIL/image/gif/6621d763f3906779da5250f632e951b5/gr7.sml gr7 gr7.sml sml 2084 163 106 IMAGE-THUMBNAIL MSB 11837 S0921-5107(08)00486-8 10.1016/j.mseb.2008.10.019 Elsevier B.V. Fig. 1 Average reflectance and etch rate of silicon as a function of the gas ratio. Fig. 2 SEM image for a SF6/O2 gas ratio of (a) 0.5, (b) 1.5, (c) 2.8, and (d) 4.3. Fig. 3 Average reflectance and thickness of etched silicon as a function of the etching time. Fig. 4 SEM image of a silicon surface at a SF6/O2 gas ratio of 2.8 processed for (a) 5min and (b) 15min. Fig. 5 Comparison of the external quantum efficiency of solar cells fabricated by samples with No DRE and 60s DRE time after 10min of RIE texturing. Fig. 6 Interface trap density (D it) for samples between 600°C and 800°C annealing with respect to the DRE time. Fig. 7 Electrical performance parameters of solar cells with respect to the DRE time. Black surface structures for crystalline silicon solar cells Jinsu Yoo a Gwonjong Yu a Junsin Yi b ⁎ a Photovoltaic Research Center, Korea Institute of Energy Research, 102 Gajeong-ro, Yuseong-gu, Daejeon 305-343, South Korea b School of Information and Communication Engineering, Sungkyunkwan University, Suwon-City 440-746, South Korea ⁎ Corresponding author. Tel.: +82 31 290 7139; fax: +82 31 290 7159. Front surface texturing processed by wet or dry etching improves efficiencies of solar cells, due to reduced reflection and light trapping with antireflection coatings. Random reactive ion etching (RIE) techniques are very effective for application with low-cost, large area crystalline silicon solar cells. In this paper, we studied a SF6/O2 RIE process without mask texturing of silicon. By this process, pyramids of needle-like structure (with diameters ranging from 50nm to 70nm) were formatted by local and regenerating oxide masking and inhomogeneous etching. After the RIE process, we also investigated damage removal etching (DRE) as a function of the etching time to determine which produced the highest cell performance for screen-printed cell fabrication sequences. Crystalline silicon solar cells fabricated in a conventional industrial production line applying optimized film deposition and annealing conditions on a large area substrate (125mm×125mm) had conversion efficiencies as high as 15.1%. Keywords Light trapping Reactive ion etching Solar cell Damage removal etching 1 Introduction The performance of a solar cell is a critical function of its internal quantum efficiency (IQE), which determines the relative percentage of photo-generated electron–hole pairs (EHPs) lost to recombination after considering reflection losses [1]. Therefore, the texturing of front surfaces on crystalline silicon solar cells is mostly performed for improvement of the cell efficiency, by means of its antireflection properties and light trapping. Also, it was historically obtained by creating randomly distributed pyramids using anisotropic etchants, but this has an application to single crystalline silicon due to its crystallographic orientation. Recently, various forms of texturing were tried on a crystalline silicon surface including laser-structuring [2], mechanical diamond saw cutting [3], photo-lithographically defined etching [4], porous-Si etching [5,6], and mask-less reactive ion etching (RIE) which results in so-called “Black silicon” [7]. The surface structure of black silicon for application with solar cells fabrication is formed by varying the SF6/O2 flow rate. RIE using SF6/O2 plasma can provide high rates of isotropic etching. It is possible to vary the etch directionality between isotropic and anisotropic, while Cl2 yields lower etching rates but provides much better profile control. Black silicon texturing is based on local and regenerating oxide masking. In the first stage, the silicon surface is covered with native oxide. This layer serves as the masking layer. It is not removed homogeneously, but is perforated first. Unmasked spots are etched and random pyramids with needle-like structure are formed on the silicon surface [8]. In SF6/O2 plasma etching, SF6 gas was used to intentionally form F* radicals to etch the silicon by producing volatile SiF4. Also, oxygen produces O* radicals for passivation of the silicon sidewall surface with Si x O y F z which helps to control etch profiles [9]. After RIE process, chemical wet damage removal etching (DRE) is necessary for improving the lifetime of silicon materials. A high minority carrier lifetime is an indication of low defect concentration and is essential for obtaining high collection efficiency. Also, the effective carrier lifetime (τ eff) depends on the bulk minority charge carrier lifetime (τ bulk) and the surface recombination velocity (S eff). In this work, we performed RIE using SF6/O2 for the formation of black silicon, which improves the antireflection and light trapping properties of crystalline silicon solar cells with minimal surface damage. 2 Experimental For the solar cells fabrication, a p-type solar grade Cz–Si wafer of size 125mm×125mm (pseudo square) was used. The RIE system using silicon surface texturing is based on a combination of chemical activity of reactive species generated in the plasma with physical effects caused by ion bombardment. The silicon wafer to be etched was positioned on a water cooled (≤20°C) power electrode of a parallel plate reactor that was powered by a 13.56MHz RF generator. Therefore, negative DC bias is generated in the sample placed on the electrode by applying RF power and exposing the wafer to bombardment with positive ions (with energies below 700V) during RIE. The reaction gases consisted of a mixture of SF6 and O2, which were introduced into the process chamber. SF6, though chemically stable, can be induced to dissociate in a gas discharge and the generated fluorine ions are useful for etching purposes. For silicon surface texturing, the gas ratio (SF6/O2) was 0.5–4.3, the working pressure range was 143–302mT and the etching time was 5–20min with 100W RF power. Also, the electrode gap was controlled at 5–7cm to ensure uniformity of the textured silicon surface. After the RIE process, we performed DRE to determine which produced the highest cell performance for screen-printed metal cell fabrication. Samples were treated by dipping them in a mixed acid chemical for 10–60s at room temperature. The textured surface was analyzed using scanning electron microscope (SEM). The silicon surface reflection was examined by a UV–VIS spectrophotometer (SCINCOS–2100) using an integrating sphere in the range of 220–850nm. High-frequency C–V (capacitance–voltage) measurements were performed using a HP4912 impedance analyzer. Silicon wafers were doped with an n-type impurity in an open tube furnace using conventional POCl3 diffusion source at 860°C with a 20min pre-deposition followed by a 40min drive-in. Phosphosilicate glass (PSG) was removed using a 5% HF solution. Edge isolation was performed with a mixture solution of HF, HNO3 and CH3COOH in suitable proportions. A SiN x :H film of thickness 730±10Å and refractive index 2.24 was deposited by the plasma enhanced chemical vapor deposition (PECVD) technique. The screen printing metallization technique was used for high throughput metal contact formation using aluminum (Al) paste and silver (Ag) paste on the back surface and front surface, respectively. These metal pastes were dried at 150°C for 5min. The optimized temperature profile for co-firing the solar cell was 500–700–800–920°C for the set temperature of the four defined zones of the belt furnace used in this study, at a belt speed of 137in./min. The illuminated current–voltage characteristics and performance parameters of the solar cells fabricated by the SiN x :H film with optimized properties were determined under a one sun global solar spectrum of air mass (AM) 1.5 at 25°C. 3 Results and discussion In terms of the variation of silicon etch rate as a function of working pressure, it was found that etch rate rapidly increases from 144nm/min to 742nm/min in the range of 143–302mT. The average reflectance in the range λ =300–850nm increases from 8.4% to 36.3%. The plasma density generally increases with respect to increasing working pressure for a fixed gas ratio and decreases with the mean free pass of radicals. Therefore, SF6 and O2 gases generate more F* and O* radicals, which are involved in silicon etching and silicon sidewall passivation. Thus, increased O2 at higher chamber pressures results in O* radicals which passivate the silicon sidewall surface with Si x O y F z . This helps to control etch profiles. The large quantity of SF6 produces F* radicals for chemical etching of silicon by generating volatile SiF4 [10]. As shown in Fig. 1 , a silicon surface, which is used for RIE texturing as the function of gas ratio (SF6/O2), has an etch rate from 47nm/min to 456nm/min. The reflectance of textured silicon with respect to the gas ratio equals 40.45%, 17.61%, 10.29%, and 30% for a sample with a gas ratio of 0.5, 1.5, 2.8, and 4.3, respectively. As F* radicals produced by SF6, which are used for chemical etching of silicon by forming volatile SiF4, show an insufficient reaction at a SF6/O2 gas ratio of 0.5, the etch rate is very low and reflectance is very high similar to the surface of bare silicon as shown in Fig. 2(a). However, the pyramids with crater-like structure with same pattern of 0.2–0.6μm are formed on the silicon surface at a SF6/O2 gas ratio of 1.5 (Fig. 2(b)). Fig. 2(c) shows the pyramids with needle-like structure which results in so-called “black silicon”. Therefore, the low reflectance of a black silicon surface using mask-less RIE etching is due to dense pyramid, which improves light trapping. Under the plasma condition shown in Fig. 2(d), pyramids with needle-like structure are distributed over a wide area. A high SF6/O2 gas ratio is necessary for increasing the etch rate, but the sidewall passivation of O* radicals is reduced by means of a decrease in O2. Based on these results, we can determine that the SF6/O2 gas ratio of 2.8 is suitable for the formation of a black silicon surface with a dense and uniform surface structure. Fig. 3 shows the reflectance and thickness of etched silicon as a function of etching time. The etch rate is very low due to the initial native oxide layer. But, after an etching time of 2min 30s, the thickness of etched silicon increases rapidly from 0.2μm to 9.8μm and the reflectance decreases from 33% to 6% by varying the etching time. The initial silicon surface is generally covered with thin native oxide. This layer, which performs the masking, is not eliminated homogeneously [11]. Thus, unmasked areas are etched and pyramids with needle-like structure, which depend on the degree of isotropy of the etching process, are formed as shown in Fig. 4 . In Fig. 4(a), high density pyramids with needle-like structure of size 50–70nm are obtained. Pyramids which are vertically formed by sidewall passivation of the Si x O y F z layer and etching have greater variation in depth and size as shown in Fig. 4(b). To verify that the lifetime of silicon material is improved by the DRE process with respect to the decrease of surface recombination, this process was performed with a mixed acid chemical (HF, HNO3, CH3COOH) for RIE textured samples over 10min. The reflectance of the black silicon surface increases from 10.29% to 11.77% with respect to the DRE time. Fig. 5 shows the external quantum efficiency (EQE) of solar cells fabricated by samples with No DRE and 60s DRE time, after 10min RIE texturing. At all range of wavelength, EQE of sample which is treated with 60s DRE time is higher than that of the sample processed with No DRE. This process improves the loss of surface recombination at short wavelengths and light absorption at long wavelengths. Therefore, in contrast to the increase in the reflectance of the black silicon surface, it is very important for the DRE process to improve EQE properties indicating successful light trapping. SiN x :H films which are deposited with a refractive index of 2.24 at 450°C with gas ratio (R=NH3/SiH4 +NH3) of 0.57 served as an antireflection and passivating layer in solar cells. After SiN x :H films were deposited on RIE textured samples for 10min, MIS capacitance structures formed and annealed between 600°C and 800°C for application with the firing process of screen-printed metal cell fabrication sequences. Interface trap density (D it) was calculated from C–V data. A graph of D it with respect to DRE time is shown in Fig. 6 . In both annealing samples, D it of the sample improves by increasing the DRE time. Compared with the annealed sample at 600°C, D it of it at 800°C is from 8.3×1011 cm−2 eV−1 to 1.86×1011 cm−2 eV−1 as a function of the DRE time. Also, the higher the surface damage caused by the RIE process, the greater the improvement in D it at annealing temperature of 800°C. Thus, the DRE process and SiN x :H passivation at high temperature for silicon surface damage by the RIE process are effective for improving D it properties, due to the low recombination rate at the interface. Electrical performance parameters of solar cells with respect to the DRE time are shown in Fig. 7 . As the DRE process with RIE for 10min is performed over increasing time, the current density increases from 30.3mA/cm2 to 32.52mA/cm2 with reformation of shunt resistance. Open circuit voltage (Voc) increases from 596mV to 611mV. The fill factor is improved by about 2% (75–77%) by damage removal on the black silicon surface as a result of the decrease in series resistance. Compared with the sample of No DRE, the conversion efficiency of 15.1% is obtained for black silicon solar cells under the condition of a 60s DRE time. These results are comparable to a 16.2% conversion efficiency of cells fabricated with a silicon wafer using SDR and NaOH texture. 4 Conclusion A comprehensive study on plasma texturing, which is substituted for wet-chemical treatment prior to diffusion, was performed to optimize conditions for black silicon solar cells application. The pyramids of needle-like structure of about 50–70nm size were inhomogeneously generated by an initial native oxide and SF6/O2 plasma and treated by maintaining a working pressure of 182mT and SF6/O2 gas ratio of 2.8 for improvement of light trapping. After the RIE process, we performed DRE to determine which produced the highest cells performance for screen-printed solar cells fabrication. By this process, it shows the best values of conversion efficiency (Eff), fill factor (FF), current density (Jsc) and open circuit voltage of the cell as 15.1%, 77, 32.52mA/cm2, and 611mV, respectively. Further improvement in black silicon solar cell performance is expected using suitable optimization of the parameters of cell fabrication. References [1] A.L. Fahrenbruch R.H. Bube Fundamental of Solar Cells 1983 Academic Press [2] S. Narayanan, Ph.D. Dissertation, University of New South Wales, Sydney, Australia, May, 1989. [3] P. Path G. Wileke E. Bucher J. Szlufcic R.M. Murti K. De Clercq J. Nijs R. Mertens Proceedings of the 24th IEEE Photovoltaic Specialist Conference 1994 1347 pp [4] J. Zhao A. Wang M.A. Green F. Ferrazza Appl. Phys. Lett. 73 1998 1991 [5] R.R. Bilyalov L. Stalmans L. Schirone IEEE Trans. Electron Device 49 1999 2035 2040 [6] Y. Inomata K. Fukui K. Shirasawa Sol. Energy Mater. Sol. Cells 48 1997 237 [7] H. Jansen M.D. Boer R. Legtenberg J. Micromech. Microeng. 5 1995 115 120 [8] T. Wells M.M. El-Gomati J. Wood J. Vac. Sci. Technol. B15 1997 397 [9] G. Kumaravelu M.M. Alkaisi A. Biattar Proceedings of the 29th IEEE Photovoltaic Specialists Conference 2002 258 260 [10] R. Hsiao J. Carr Mater. Sci. Eng. B 52 1998 63 [11] M. Schnell R. Ludemann S. Schaefer Proceedings of the 28th IEEE Photovoltaic Specialists Conference 2000 367 370", "scopus-id": "67349229272", "coredata": {"eid": "1-s2.0-S0921510708004868", "dc:description": "Front surface texturing processed by wet or dry etching improves efficiencies of solar cells, due to reduced reflection and light trapping with antireflection coatings. Random reactive ion etching (RIE) techniques are very effective for application with low-cost, large area crystalline silicon solar cells. In this paper, we studied a SF6/O2 RIE process without mask texturing of silicon. By this process, pyramids of needle-like structure (with diameters ranging from 50nm to 70nm) were formatted by local and regenerating oxide masking and inhomogeneous etching. After the RIE process, we also investigated damage removal etching (DRE) as a function of the etching time to determine which produced the highest cell performance for screen-printed cell fabrication sequences. Crystalline silicon solar cells fabricated in a conventional industrial production line applying optimized film deposition and annealing conditions on a large area substrate (125mm×125mm) had conversion efficiencies as high as 15.1%.", "openArchiveArticle": "false", "prism:coverDate": "2009-03-15", "openaccessUserLicense": null, "prism:aggregationType": "Journal", "prism:url": "https://api.elsevier.com/content/article/pii/S0921510708004868", "dc:creator": [{"@_fa": "true", "$": "Yoo, Jinsu"}, {"@_fa": "true", "$": "Yu, Gwonjong"}, {"@_fa": "true", "$": "Yi, Junsin"}], "link": [{"@_fa": "true", "@rel": "self", "@href": "https://api.elsevier.com/content/article/pii/S0921510708004868"}, {"@_fa": "true", "@rel": "scidir", "@href": "https://www.sciencedirect.com/science/article/pii/S0921510708004868"}], "dc:format": "application/json", "openaccessType": null, "pii": "S0921-5107(08)00486-8", "prism:volume": "159", "prism:publisher": "Elsevier B.V.", "dc:title": "Black surface structures for crystalline silicon solar cells", "prism:copyright": "Copyright © 2008 Elsevier B.V. All rights reserved.", "prism:issueName": "EMRS 2008 Spring Conference Symposium K: Advanced Silicon Materials Research for Electronic and Photovoltaic Applications", "openaccess": "0", "prism:issn": "09215107", "dcterms:subject": [{"@_fa": "true", "$": "Light trapping"}, {"@_fa": "true", "$": "Reactive ion etching"}, {"@_fa": "true", "$": "Solar cell"}, {"@_fa": "true", "$": "Damage removal etching"}], "openaccessArticle": "false", "prism:publicationName": "Materials Science and Engineering: B", "openaccessSponsorType": null, "prism:pageRange": "333-337", "prism:endingPage": "337", "pubType": "fla", "prism:coverDisplayDate": "15 March 2009", "prism:doi": "10.1016/j.mseb.2008.10.019", "prism:startingPage": "333", "dc:identifier": "doi:10.1016/j.mseb.2008.10.019", "openaccessSponsorName": null}, "objects": {"object": [{"@category": "standard", "@height": "570", "@width": "788", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0921510708004868-gr2.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "208123", "@ref": "gr2", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "159", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0921510708004868-gr2.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "14837", "@ref": "gr2", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "572", "@width": "394", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0921510708004868-gr4.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "110442", "@ref": "gr4", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "164", "@width": "113", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0921510708004868-gr4.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "8338", "@ref": "gr4", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "248", "@width": "365", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0921510708004868-gr1.gif?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "6714", "@ref": "gr1", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "149", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0921510708004868-gr1.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "3407", "@ref": "gr1", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "255", "@width": "364", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0921510708004868-gr3.gif?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "6817", "@ref": "gr3", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "154", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0921510708004868-gr3.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "3449", "@ref": "gr3", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "274", "@width": "371", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0921510708004868-gr5.gif?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "8483", "@ref": "gr5", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "162", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0921510708004868-gr5.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "4333", "@ref": "gr5", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "269", "@width": "368", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0921510708004868-gr6.gif?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "6638", "@ref": "gr6", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "160", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0921510708004868-gr6.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "3312", "@ref": "gr6", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "547", "@width": "356", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0921510708004868-gr7.gif?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "10787", "@ref": "gr7", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "163", "@width": "106", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0921510708004868-gr7.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "2084", "@ref": "gr7", "@mimetype": "image/gif"}]}, "link": {"@rel": "abstract", "@href": "https://api.elsevier.com/content/abstract/scopus_id/67349229272"}}