{"scopus-eid": "2-s2.0-85092721008", "originalText": "serial JL 273239 291210 291690 291821 291827 291884 31 Optik OPTIK 2020-10-14 2020-10-14 2020-10-15 2020-10-15 2021-04-23T08:43:10 1-s2.0-S0030402620316065 S0030-4026(20)31606-5 S0030402620316065 10.1016/j.ijleo.2020.165781 S300 S300.1 FULL-TEXT 1-s2.0-S0030402620X00234 2021-04-23T11:20:23.655626Z 0 0 20210101 20210131 2021 2020-10-14T02:25:22.656629Z articleinfo articlenumber articletitlenorm authfirstinitialnorm authfirstsurnamenorm cid cids contenttype copyright crossmark dateloaded dateloadedtxt datesearch datesort dateupdated dco docsubtype doctype doi eid ewtransactionid hubeid indexeddate issn issnnorm itemstage itemtransactionid itemweight openaccess openarchive pg pgfirst pii piinorm pubdateend pubdatestart pubdatetxt pubyr sectiontitle sortorder srctitle srctitlenorm srctype ssids alllist content subj subheadings suppl tomb volfirst volissue volumelist webpdf webpdfpagecount yearnav figure table body mmlmath acknowledge affil articletitle auth authfirstini authfull authkeywords authlast grantnumber grantsponsor primabst pubtype ref 0030-4026 00304026 true 225 225 C Volume 225 3 165781 165781 165781 202101 January 2021 2021-01-01 2021-01-31 2021 Original research articles article fla © 2020 Elsevier GmbH. All rights reserved. OPTIMIZATIONETCHINGTIMEFORENHANCEDBROADBANDABSORPTIONINFLEXIBLEBLACKSILICONSTAINLESSSTEELFOIL OMAR H 1 Introduction 2 Materials and methods 3 Result and discussion 4 Conclusion Acknowledgement References ABDULKADIR 2020 1 8 A SIVARAMAKRISHNANRADHAKRISHNAN 2019 H ANDREANI 2018 125 148 L 2019 ITRPVINTERNATIONALTECHNOLOGYROADMAPFORPHOTOVOLTAICITRPV2018RESULTS AURANG 2017 405205 P HWANG 2018 641 647 I DA 2018 4875 4890 Y NOOR 2019 586 592 N OTTO 2015 147 164 M LIN 2015 128 132 C WANG 2013 4393 4398 S LIU 2014 3223 3263 X ABOUDALACHIHEB 2012 455 M NASSIOPOULOU 2011 597 A SCHUSTER 2017 C WEISSE 2012 3339 3343 J PAKHURUDDIN 2017 477 484 M WANG 2014 1397 1404 L KERN 1990 1887 1892 W LU 2013 9862 9870 Y THIYAGU 2012 1 6 S PAKHURUDDIN 2016 852 859 M PAYNE 2018 D UNDERSTANDINGOPTICSINDUSTRIALBLACKSILICON1999 ABDULKADIR 2019 74 80 A VINZONS 2017 385 L ZWINKELS 1994 7933 7944 J ATWATER 2010 1 11 H CHATTOPADHYAY 2010 1 35 S TEMPLE 2009 1978 1985 T LI 2016 232 240 S SMITH 2013 139 147 Z UM 2020 5395 5420 H OMARX2021X165781 OMARX2021X165781XH 2022-10-15T00:00:00.000Z 2022-10-15T00:00:00.000Z http://creativecommons.org/licenses/by-nc-nd/4.0/ © 2020 Elsevier GmbH. All rights reserved. 2020-10-12T01:22:52.967Z http://vtw.elsevier.com/data/voc/AddOnTypes/50.7/eoas Universiti Sains Malaysia http://data.elsevier.com/vocabulary/SciValFunders/501100004595 http://sws.geonames.org/1733045 item S0030-4026(20)31606-5 S0030402620316065 1-s2.0-S0030402620316065 10.1016/j.ijleo.2020.165781 273239 2021-04-23T11:20:23.655626Z 2021-01-01 2021-01-31 1-s2.0-S0030402620316065-main.pdf https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0030402620316065/MAIN/application/pdf/f81ed288cde3f75baa5623fc882f0649/main.pdf main.pdf pdf true 3985544 MAIN 7 1-s2.0-S0030402620316065-main_1.png https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0030402620316065/PREVIEW/image/png/d9602e316815d6e6d84b01d58b608fb4/main_1.png main_1.png png 50553 849 656 IMAGE-WEB-PDF 1 1-s2.0-S0030402620316065-gr2.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0030402620316065/gr2/DOWNSAMPLED/image/jpeg/df1bf0a847abf05314d54501c0ab9c2a/gr2.jpg gr2 gr2.jpg jpg 108580 284 602 IMAGE-DOWNSAMPLED 1-s2.0-S0030402620316065-gr3.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0030402620316065/gr3/DOWNSAMPLED/image/jpeg/2bb929ee97aaa2a73701e0a222d9faa1/gr3.jpg gr3 gr3.jpg jpg 21848 147 602 IMAGE-DOWNSAMPLED 1-s2.0-S0030402620316065-gr1.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0030402620316065/gr1/DOWNSAMPLED/image/jpeg/9f9fa2e77f054819242ce916b4d57c03/gr1.jpg gr1 gr1.jpg jpg 65977 471 602 IMAGE-DOWNSAMPLED 1-s2.0-S0030402620316065-gr6.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0030402620316065/gr6/DOWNSAMPLED/image/jpeg/f0959f52acdf7f96c1e45771e193ad77/gr6.jpg gr6 gr6.jpg jpg 20936 236 301 IMAGE-DOWNSAMPLED 1-s2.0-S0030402620316065-gr4.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0030402620316065/gr4/DOWNSAMPLED/image/jpeg/7668f96cc508dbc1df41a129540cbf75/gr4.jpg gr4 gr4.jpg jpg 35044 280 602 IMAGE-DOWNSAMPLED 1-s2.0-S0030402620316065-gr5.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0030402620316065/gr5/DOWNSAMPLED/image/jpeg/f5e49aac63297017cc6a4f3173983078/gr5.jpg gr5 gr5.jpg jpg 40901 252 602 IMAGE-DOWNSAMPLED 1-s2.0-S0030402620316065-gr2.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0030402620316065/gr2/THUMBNAIL/image/gif/9da945f2617e281104490fe93f9e2be2/gr2.sml gr2 gr2.sml sml 18387 103 219 IMAGE-THUMBNAIL 1-s2.0-S0030402620316065-gr3.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0030402620316065/gr3/THUMBNAIL/image/gif/02f2b823cfa791e81ddcac1c8585df82/gr3.sml gr3 gr3.sml sml 6491 54 219 IMAGE-THUMBNAIL 1-s2.0-S0030402620316065-gr1.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0030402620316065/gr1/THUMBNAIL/image/gif/d7eeb90d755b91e0df93ae7a593bd158/gr1.sml gr1 gr1.sml sml 14411 164 209 IMAGE-THUMBNAIL 1-s2.0-S0030402620316065-gr6.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0030402620316065/gr6/THUMBNAIL/image/gif/e9bf2a51c77e7ed2f31f55d49b45f1c4/gr6.sml gr6 gr6.sml sml 8217 164 209 IMAGE-THUMBNAIL 1-s2.0-S0030402620316065-gr4.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0030402620316065/gr4/THUMBNAIL/image/gif/d5797c3539460db8de2f49e445f57a19/gr4.sml gr4 gr4.sml sml 7366 102 219 IMAGE-THUMBNAIL 1-s2.0-S0030402620316065-gr5.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0030402620316065/gr5/THUMBNAIL/image/gif/4a53a05309fcaca999f745cf83452372/gr5.sml gr5 gr5.sml sml 6963 92 219 IMAGE-THUMBNAIL 1-s2.0-S0030402620316065-gr2_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0030402620316065/gr2/HIGHRES/image/jpeg/4e83c512ebe6c337fef00b5b274b4acb/gr2_lrg.jpg gr2 gr2_lrg.jpg jpg 1308083 1256 2667 IMAGE-HIGH-RES 1-s2.0-S0030402620316065-gr3_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0030402620316065/gr3/HIGHRES/image/jpeg/660ec15e87c6b929af60a484e0da8b0f/gr3_lrg.jpg gr3 gr3_lrg.jpg jpg 416476 652 2667 IMAGE-HIGH-RES 1-s2.0-S0030402620316065-gr1_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0030402620316065/gr1/HIGHRES/image/jpeg/60b083d113c281d4469eeaa24ad2762c/gr1_lrg.jpg gr1 gr1_lrg.jpg jpg 663656 2087 2667 IMAGE-HIGH-RES 1-s2.0-S0030402620316065-gr6_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0030402620316065/gr6/HIGHRES/image/jpeg/b910765fcb90cbf0811a27b41679ae86/gr6_lrg.jpg gr6 gr6_lrg.jpg jpg 175856 1046 1333 IMAGE-HIGH-RES 1-s2.0-S0030402620316065-gr4_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0030402620316065/gr4/HIGHRES/image/jpeg/b45df2e8c716a0d1ea19cfa0250952d8/gr4_lrg.jpg gr4 gr4_lrg.jpg jpg 331582 1239 2667 IMAGE-HIGH-RES 1-s2.0-S0030402620316065-gr5_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0030402620316065/gr5/HIGHRES/image/jpeg/6441083b8c73dbdd18cb0ae433351e7b/gr5_lrg.jpg gr5 gr5_lrg.jpg jpg 398614 1117 2667 IMAGE-HIGH-RES 1-s2.0-S0030402620316065-si1.svg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0030402620316065/STRIPIN/image/svg+xml/97ec3f646fdc46ca02f4ff9721ea913e/si1.svg si1 si1.svg svg 47572 ALTIMG 1-s2.0-S0030402620316065-si2.svg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0030402620316065/STRIPIN/image/svg+xml/49a779c2cd1ae23462871c855b755f7e/si2.svg si2 si2.svg svg 35015 ALTIMG 1-s2.0-S0030402620316065-am.pdf https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/egi:106TLW668QZ/MAIN/application/pdf/2ac10dc3f6bd8e560099ecd143578e08/am.pdf am am.pdf pdf false 6877829 AAM-PDF IJLEO 165781 165781 S0030-4026(20)31606-5 10.1016/j.ijleo.2020.165781 Elsevier GmbH Fig. 1 AFM images of flexible b-Si surface formed by varying etching times (10-25 min) during MACE process. Fig. 1 Fig. 2 (a-d) top and (e-h) oblique (at 30° tilt angle) view FESEM images of flexible b-Si surface formed by varying etching times (10-25 min) during MACE process. The scale bar indicates 1 μm. Fig. 2 Fig. 3 Cross-sectional FESEM images of flexible b-Si surface formed by varying etching times (10-25 min) during MACE process; (a) 10 min, (b) 15 min, (c) is 20 min (d) 25 min. The scale bar indicates 1 μm. Fig. 3 Fig. 4 (a) AFM image of SS foil surface (b) Diffused, specular and total reflection of SS foil within 800-1100 nm wavelength region. Fig. 4 Fig. 5 (a) Total reflection (b) absorption profiles of flexible b-Si surface formed by varying etching times (10-25 min) during MACE process. Planar c-Si reference on SS foil is included for comparison. Fig. 5 Fig. 6 Average length and diameter of b-Si NWs and corresponding AWR as a function of varying etching duration. Note that the AWR for c-Si reference is 47.6 %. Fig. 6 Table 1 Potential Jsc(max) and Jsc(max) enhancement of flexible b-Si on SS foil formed by varying etching times (10-25 min) during MACE process. Potential Jsc(max) of planar c-Si on SS foil is used as a reference. Table 1 Etching time (min) Potential Jsc(max) (mA/cm2) Jsc(max) enhancement (mA/cm2) Jsc(max) enhancement (%) c-Si reference 24.2 – – 10 min 35.6 11.4 47.1 15 min 37.6 13.4 55.4 20 min 39.3 15.1 62.4 25 min 38.8 14.6 60.3 Original research article Optimization of etching time for enhanced broadband absorption in flexible black silicon on stainless steel foil Halo Dalshad Omar a b Md. Roslan Hashim a Mohd Zamir Pakhuruddin a * a Nano-Optoelectronics Research and Technology Laboratory, School of Physics, Universiti Sains Malaysia, 11800 Minden, Penang, Malaysia Nano-Optoelectronics Research and Technology Laboratory School of Physics Universiti Sains Malaysia Minden Penang 11800 Malaysia Nano-Optoelectronics Research and Technology Laboratory, School of Physics, Universiti Sains Malaysia, 11800 Minden, Penang, Malaysia. b Department of Physics, Faculty of Science and Health, Koya University, Koya KOY45, Kurdistan Region, F.R. Iraq Department of Physics Faculty of Science and Health Koya University Koya KOY45 Kurdistan Region F.R. Iraq Department of Physics, Faculty of Science and Health, Koya University, Koya KOY45, Kurdistan Region - F.R. Iraq. ⁎ Corresponding author. This paper presents optimization of etching time in metal-assisted chemical etching (MACE) process for enhanced broadband absorption in flexible black silicon (b-Si) on stainless steel (SS) foil. Flexible monocrystalline silicon (mono c-Si) wafers with 65 μm thickness are used in this work. For the optimization of etching time, one-step MACE process is utilized with 10−25 min etching to fabricate the b-Si absorber. The SS foil beneath the b-Si also acts as a back reflector (BR) which ensures zero transmission loss in the long wavelength region (above 800 nm). After 20 min etching, b-Si with average nanowires (NWs) length of 982 nm is formed. This condition exhibits the lowest average weighted reflection (AWR) and the highest broadband light absorption in the b-Si within 300−1100 nm wavelength region, owing to refractive index grading effect at the air/b-Si interface. This corresponds to the maximum potential short-circuit density (Jsc(max)) of 39.3 mA/cm2, or 62.4 % enhancement when compared to the planar c-Si reference. The findings demonstrate the potential of flexible b-Si on SS foil to deliver high photocurrent in the future solar cells. Keywords Flexible Black silicon MACE Stainless steel Absorption 1 Introduction Crystalline silicon (c-Si) is the most commonly used semiconductor material to fabricate solar cells. Today, c-Si solar cell represents more than 90 % of photovoltaic (PV) market. This is due to its reducing technology cost, increasing solar cell efficiency and technology maturity [1,2]. For solar cell manufacturing, c-Si wafers with 180 μm thickness are commonly used [3]. To date, the technology cost for c-Si solar cell has dropped to below $0.30/Wattp [4]. To further reduce the technology cost, many strategies have been outlined in International Technology Roadmap for Photovoltaic (ITRPV) in 2019 [4]. One strategy includes reducing the thickness of the c-Si absorber to below 100 μm, where the c-Si wafer will also be flexible [5,6]. However, reducing the thickness of the c-Si compromises its light absorption capability, knowing the low absorption coefficient of the c-Si [6]. Furthermore, planar c-Si exhibits a high broadband reflection of about 40 % over 300−1100 nm wavelength region, which is crucial for PV conversion process. The high broadband reflection results in high optical loss hence low photocurrent in the solar cells [7]. To overcome the poor absorption issue in the flexible c-Si, black silicon (b-Si) could be a promising solution. B-Si involves modifying the planar surface of the c-Si wafer into a surface with dense nanowires (NWs). The NWs reduce broadband reflection from the c-Si wafer, leading to superior light absorption within the 300−1100 nm wavelength region [8,9]. This is achieved by refractive index grading mechanism at the air/b-Si interface [8]. To produce flexible c-Si, the c-Si wafer can be thinned down to the required thickness by etching in concentrated alkaline solution such as potassium hydroxide (KOH) or sodium hydroxide (NaOH) [10,11]. Then, many techniques are available to fabricate b-Si on the flexible c-Si wafer such as reactive ion etching (RIE), femtosecond pulsed-laser treatment and metal-assisted chemical etching (MACE). Among these techniques, MACE offers a simple process setup, involves low cost and good process repeatability [12]. In one-step MACE process, silver nanoparticles (Ag NPs) deposition and wet etching take place at the same time in aqueous solution of silver nitrate (AgNO3) and hydrogen fluoride (HF). During this process, galvanic displacement follows two simultaneous processes during reduction and oxidation reactions. Ag injects holes into the valence band of the c-Si since Ag is more electronegative than c-Si and causes anodic oxidation of the c-Si via the injected holes. The oxidized c-Si (in the form of SiO2) is then eliminated by HF. As a result, NWs are formed on the front c-Si substrate [13,14]. In the MACE process, etching time needs to be optimized to maximize broadband light absorption in the flexible b-Si absorber [8]. It is important to note that the flexible b-Si at thickness below 100 μm is fragile and easily broken [2,15]. To solve this problem, a mechanically strong supporting substrate such as stainless steel (SS) foil is required to hold the flexible b-Si absorber [2,16]. Besides, the SS can also be used as a back reflector (BR) due to its highly reflective property. With the BR, long wavelength light (particularly above 800 nm) which is not absorbed in the flexible b-Si wafer during the “first-pass” is reflected back into the b-Si for potential absorption [17]. Without the BR, the long wavelength light represents a huge transmission loss to the flexible b-Si absorber [2,6,18]. To date, to our best knowledge, there is no reported work in the literature which involves usage of SS foil as a BR for flexible b-Si absorber for application in solar cells. This paper presents usage of SS foil as a supporting substrate and a BR to the flexible b-Si absorber. In this work, wet etching time (in MACE process) is optimized to enhance broadband light absorption in the flexible b-Si absorber on the SS foil. Firstly, c-Si wafers are thinned down to 65 μm in concentrated KOH solution, followed by fabrication of flexible b-Si absorber using one-step MACE process in aqueous solution of AgNO3 and HF with various etching times (10−25 min). After the fabrication, the flexible b-Si from the various etching times is transferred onto SS foil. Surface morphologies and optical properties of the flexible b-Si on SS foil are then investigated. The relationship between average length and diameter of NWs of the b-Si and corresponding average weighted reflection (AWR) are analyzed. From absorption profile, potential Jsc(max) is calculated to relatively estimate light-coupling performance of the flexible b-Si wafers on the SS foil. 2 Materials and methods In this work, p-type (100) mono c-Si with resistivity of 1–10 Ω.cm and thickness of 280 μm are used as the starting wafers. To fabricate flexible c-Si wafers with 65 μm thickness, the wafers are etched in KOH solution with concentration of 50 wt.% at 90 °C. Note that the etching rate of the c-Si wafers is about 80 μm/h. Once the flexible wafers are obtained, the wafers are cleaned by Radio Corporation of America (RCA) technique to eliminate oxide layer, organic and metallic contaminations [1,19]. To fabricate b-Si on the flexible wafers, one-step MACE process is adopted. The wafers are etched in aqueous solution containing 7 ml of AgNO3, 9 ml of HF and 34 ml of DI H2O at room temperature under different durations; 10 min, 15 min, 20 min and 25 min [20]. After the MACE process, Ag NPs on the surface of the b-Si are eliminated using concentrated nitric acid (HNO3, concentration 60 %) for 5 min at room temperature. Then, both the flexible b-Si and c-Si reference (with 65 μm thickness) are attached to SS foil (about 180 μm thickness) using a bonding glue. After being attached to the SS foil, surface morphological properties of the flexible b-Si wafers are characterized by Atomic Force Microscopy (AFM; Bruker Dimension Edge) and Field Emission Scanning Electron Microscopy (FESEM; FEI Nova Nano SEM 450). For AFM characterization, 10 μm × 10 μm field size and resolution of 512 pixels are used to scan the surface and determine root mean square (RMS) surface roughness of the b-Si surface. Besides, surface morphological properties of SS foil are also studied using AFM. For FESEM characterization, top (plane) view, oblique (at 30° tilt angle) and cross-sectional views of the b-Si are inspected. FESEM images are then analyzed by ImageJ software. Reflection (R) and transmission (T) profiles of the b-Si and planar c-Si wafers (reference) on SS foil are measured by UV–vis-NIR spectrophotometer (Agilent; Cary 5000) which is equipped with an integrating sphere. From the reflection profile, average weighted reflection (AWR) is calculated for 300−1100 nm spectral region using Eq. (1) [7]. In this equation, R(λ) denotes the reflection and S(λ) denotes the AM1.5 G solar spectrum. (1) A W R ( λ ) = ∫ λ = 300 n m λ = 1100 n m R λ S λ d λ ∫ λ = 300 n m λ = 1100 n m S λ d λ From the reflection result, absorption (A) is calculated from A=(100-R-T)% [21]. Transmission (T) is zero since SS foil is an opaque substrate. Note that reflection of SS foil is also measured using UV–vis-NIR spectrophotometer. From the absorption results of the flexible b-Si and planar c-Si (reference) on the SS foil, light-coupling performance of both absorber materials is assessed using potential Jsc(max). Potential Jsc(max) is calculated by using Eq. (2) for wavelength region of 300−1100 nm [22]. In this equation, q is the electron charge, EQE is the external quantum efficiency and S(λ) is the standard photon density of sunlight for AM1.5 G spectrum. In this equation, unity carrier collection is assumed (i.e. internal quantum efficiency, IQE = 1, where EQE = IQE × A). Then, potential Jsc(max) enhancement (%) is calculated by normalizing the improved Jsc(max) of the flexible b-Si wafer on SS foil over the potential Jsc(max) of the planar c-Si reference. (2) J s c ( m a x ) = q ∫ λ = 300 n m λ = 1100 n m E Q E λ . S λ d λ 3 Result and discussion Fig. 1 depicts AFM images of flexible b-Si formed by varying etching times (10−25 min) during the one-step MACE process. From the images, it is evident that all the etching times produce random b-Si NWs on the surface. The scans illustrate RMS roughness results of 72 nm, 38 nm, 26 nm and 48 nm for 10 min, 15 min, 20 min and 25 min etching time respectively. The RMS roughness of the b-Si surface does not show any specific trend with increased etching duration. It is acknowledged that RMS roughness is not the best way to characterize the surface morphological properties of the b-Si since the surface is covered by long vertical NWs which may not be characterized accurately through the AFM measurement [23]. Therefore, in order to further understand the surface morphological properties of the b-Si surfaces, FESEM characterization is carried out. Fig. 2 shows (a–d) top and (e–h) oblique (30° tilt angle) FESEM images of flexible b-Si surface formed by varying etching times (10−25 min) during MACE process. With 10 min etching, the b-Si NWs just started to form as can be seen from the top view and oblique FESEM images. ImageJ software shows that the NWs have an average diameter of 44 nm. With 15 min etching, denser NWs are obtained on the surface of the b-Si. The average diameter of the NWs increases to 61 nm. After extending the etching to 20 min, denser and longer NWs can be observed from the surface. The average diameter of the NWs increases to 97 nm. This is achieved since more c-Si is vertically etched from the surface during the MACE process [20]. With longer etching time (25 min), the density of the NWs seems to be comparable to the sample with 20 min etching, but with relatively narrower and shorter NWs as evident from the oblique FESEM images. ImageJ calculation exhibits average diameter of the NWs to be 87 nm, which is lower than the average diameter of the NWs for the 20 min etching. This is believed to be due over-etching effect during the MACE process. In order to gain better understanding of the NWs formation, cross-sectional FESEM is performed and the images are shown in Fig. 3 (a–d). With 10 min etching in the MACE process, NWs exhibit average length of 341 nm. After etching for 15 min, the NWs length increase to 535 nm as more c-Si is vertically etched from the top surface. When extending the etching to 20 min, the NWs length increase further to 982 nm. This confirms the observation from the previous oblique FESEM image. When the etching is prolonged to beyond 20 min, the length of the NWs reduces to 661 nm due to the over-etching effect of the NWs on the surface of the wafer [20,24,25]. Fig. 4 (a) illustrates AFM image of SS foil surface. The scan shows that the SS foil surface has a smooth surface, with RMS roughness of 4 nm. Fig. 4(b) shows diffused reflection, specular reflection and total reflection (diffused + specular) profiles of SS foil within 800−1100 nm region. The measurement is carried out within this region as the SS foil is attached beneath the flexible b-Si as a BR. Therefore, the SS foil interacts with long wavelength light (above 800 nm) that reaches the rear side of the b-Si absorber [2,6,18]. From the reflection profiles, the SS foil exhibits specular reflection of about 50 % throughout the spectral region. This is higher than diffuse reflection which demonstrates around 30 % within the region. The combination of both specular and diffuse reflections leads to total reflection of 80–85 % in this region. The high value of the total reflection is important for the SS foil to be a good BR at the rear side of the flexible b-Si. The high reflection of the SS foil enables the long wavelength light to be reflected back into the b-Si for potential absorption [18,26]. The higher value of the specular reflection is due to the smooth surface of the SS foil as evident from the AFM result. As a result, most of the light incident on the surface of the SS foil is reflected at angle equals to the angle of incidence [26]. Only about 30 % of the incident light is scattered on the surface, due to the lower value of the diffuse reflection [26]. Fig. 5 depicts reflection and absorption profiles of flexible b-Si surface formed by varying etching times (10−25 min) during MACE process. Planar c-Si reference on SS foil is included for comparison. The measurement is carried within 300−1100 nm wavelength region. Note that a small step change in the profiles at wavelength of 800 nm can be observed. This is due to change over of light source during the measurement [1]. Planar c-Si reference exhibits reflection of around 37 % at wavelength of 600 nm and AWR of 47.6 %. This is attributed to an abrupt change of refractive index (n) when the incident light travels from air (n = 1) into c-Si (n = 3.8) which leads to the high Fresnel reflection at the air/c-Si interface [27–29]. Besides, it is also evident that the SS foil BR beneath the flexible b-Si exhibits high total reflection (95 %) at wavelength of 1100 nm. The high long wavelength reflection can also be observed for all the flexible b-Si wafers. The planar c-Si reference demonstrates absorption of 63 % at wavelength of 600 nm. After the MACE process, all the flexible b-Si samples show lower broadband reflection when compared to the planar c-Si reference. This is due to the presence of the NWs on the surface which improves light-coupling into the b-Si absorber. With 10 min etching, the reflection of the NWs array reduces to 13.3 % at wavelength of 600 nm with AWR of 19 % for the wavelength region of 300−1100 nm [30,31]. After 15 min of etching, the broadband reflection reduces 9.7 % at 600 nm with AWR of 14 % due to the presence of the denser and longer NWs on the wafer surface. This leads to absorption of about 90.3 % in the visible region. When extending the etching to 20 min, the broadband reflection reduces further. The reflection reduces to 5.6 % at wavelength of 600 nm with AWR of 10.4 %, which represents the lowest broadband reflection achieved in this work. As a result, the broadband absorption increases significantly, with absorption of about 95 % at 600 nm. This is contributed by the denser and longer NWs on the surface after the MACE process. Longer etching (25 min) leads to slightly higher broadband reflection when compared to the 20 min etching. The reflection is 6.3 % at 600 nm with AWR of 11.5 %, owing to the over-etching effect previously shown in the FESEM images. This reduces the absorption to only about 93.7 % at wavelength of 600 nm. The average length and diameter of b-Si NWs and corresponding AWR as a function of varying etching duration is summarized by Fig. 6 . Note that the AWR for c-Si reference is 47.6 % within the 300−1100 nm wavelength region. The figure shows that as the etching time increases, the NWs length and diameter increase until 20 min. Beyond 20 min, the NWs are over-etched as previously shown in the cross-sectional FESEM image. This leads to reduced length and diameter of the NWs. The AWR illustrates the opposite trend. The AWR reduces with the increased etching time until 10.4 %, when the b-Si is etched for 20 min (with NWs length of 982 nm and diameter of 97 nm). The results show a strong dependence of the AWR with the NWs length, which proves the effect of refractive index grading at the air/b-Si interface. Even though the lowest AWR (i.e. highest broadband absorption) can be achieved with the longest NWs, it is not necessarily good for electrical performance of the b-Si solar cell. This is because longer NWs possess higher surface area which is prone to higher surface recombination of carriers. Therefore, a high-quality surface passivation is required to passivate the NWs to ensure the high broadband absorption translates into superior electrical performance of the solar cell [32]. Table 1 illustrates the resulting potential Jsc(max) and Jsc(max) enhancement of flexible b-Si on SS foil formed by varying etching times (10−25 min) during MACE process, which is calculated using Eq. (2) for the 300−1100 nm wavelength region. The planar c-Si on SS foil is used as a reference. The planar c-Si reference has potential Jsc(max) of 24.2 mA/cm2. After 10 min of etching process, the potential Jsc(max) increases by 11.4 mA/cm2 to 35.6 mA/cm2 (or 47.1 % enhancement compared to the c-Si reference). The enhancement is contributed by the presence of the NWs on the b-Si surface which improves the broadband light-coupling (hence broadband light absorption) into the b-Si absorber. With 15 min etching process, the Jsc(max) increases to 37.6 mA/cm2 (55.4 % enhancement). Etching for 20 min exhibits the highest absorption enhancement in the flexible b-Si which leads to the highest potential Jsc(max) of 39.3 mA/cm2 (62.4 % enhancement). In other work which utilizes the same potential Jsc(max) calculation and assumption, potential Jsc(max) of 39.2 mA/cm2 has been obtained by b-Si absorber fabricated using one-step MACE process. However, the b-Si fabricated uses wafer thickness of 250 μm (without rear SS foil), which is almost 4 times thicker when compared to the absorber thickness used in our work [24]. This proves the potential of the flexible b-Si combined with the rear SS foil to enhance the broadband light absorption. With 25 min etching, the Jsc(max) drops to 38.8 mA/cm2 (60.3 % enhancement) due to the over-etching effect which leads to reduced NWs length on the b-Si surface. 4 Conclusion This paper presents usage of SS foil as a supporting substrate and a BR to the flexible b-Si absorber. In this work, wet etching time in MACE process has been optimized to enhance broadband light absorption in flexible b-Si absorber on SS foil. The c-Si wafers are thinned down to 65 μm in concentrated KOH solution. The b-Si surface is fabricated on the flexible c-Si wafer using one-step MACE process in aqueous solution of AgNO3 and HF with various etching times (10−25 min). After the MACE process, the b-Si from various etching times is transferred onto SS foil, followed by surface morphological and optical characterizations. With 10 min etching, NWs exhibit average length of 341 nm. With 15 min etching, the NWs length increase to 535 nm since more c-Si is etched from the top surface. When the etching is extended to 20 min, the NWs length increase further to 982 nm. Beyond 20 min, the length of the NWs reduces to 661 nm due to the over-etching effect of the NWs on the wafer surface. Planar c-Si reference exhibits reflection of 37 % at wavelength of 600 nm with AWR of 47.6 %. High reflection at wavelength of 1100 nm is evident from the reflection results, owing to the reflection from the SS foil which is attached on the rear side of the b-Si and planar c-Si reference absorbers. After the MACE process, all the b-Si wafers demonstrate lower broadband reflection and higher broadband absorption when compared to the planar c-Si reference. This is contributed by the refractive index grading effect at the air/b-Si interface due to the presence of the dense NWs on the surface. Etching for 10 min leads to reduced broadband reflection to 13.3 % at wavelength of 600 nm with AWR of about 19 % within the 300−1100 nm wavelength region. With 15 min etching, the AWR reduces to 14 % due to the denser NWs on the surface. Extending the etching to 20 min results in reduced broadband reflection to 5.6 % at wavelength of 600 nm with AWR of 10.4 %. This condition represents the highest broadband absorption achieved in this work. This leads to the highest potential Jsc(max) 39.3 mA/cm2 or (62.4 % enhancement) obtained in this work, owing to the efficient light-coupling by the dense NWs on the b-Si surface. Longer etching (25 min) leads to increased reflection to 6.3 % at 600 nm with AWR of 11.5 %, due to the over-etching of the NWs. This reduces the broadband absorption to only about 93.7 % at 600 nm wavelength. The findings from this work demonstrate the potential of the flexible b-Si on SS foil to deliver high photocurrent in the future solar cells. Declaration of Competing Interest The authors reported no declarations of interest. Acknowledgement Authors would like to acknowledge Universiti Sains Malaysia (USM), Penang, for funding this research through Short-Term Grant 304/PFIZIK/6315063. The first author would like to acknowledge, Department of Physics, Faculty of Science and Health, Koya University. References [1] A. Abdulkadir A.A. Aziz M.Z. Pakhuruddin Impact of micro-texturization on hybrid micro/nano-textured surface for enhanced broadband light absorption in crystalline silicon for application in photovoltaics Mater. Sci. Semicond. Process. 105 2020 1 8 A. Abdulkadir, A.A. Aziz, M.Z. Pakhuruddin, Impact of micro-texturization on hybrid micro/nano-textured surface for enhanced broadband light absorption in crystalline silicon for application in photovoltaics, Materials Science in Semiconductor Processing, 105 (2020) 1-8. [2] H. Sivaramakrishnan Radhakrishnan J. Cho T. Bearda J. Röth V. Depauw K. Van Nieuwenhuysen I. Gordon J. Szlufcik J. Poortmans Freestanding and supported processing of sub-70 μm kerfless epitaxial Si and thinned Cz/FZ Si foils into solar cells: an overview of recent progress and challenges Sol. Energy Mater. Sol. Cells 203 2019 H. Sivaramakrishnan Radhakrishnan, J. Cho, T. Bearda, J. Röth, V. Depauw, K. Van Nieuwenhuysen, I. Gordon, J. Szlufcik, J. Poortmans, Freestanding and supported processing of sub-70 μm kerfless epitaxial Si and thinned Cz/FZ Si foils into solar cells: An overview of recent progress and challenges, Solar Energy Materials and Solar Cells, 203 (2019). [3] L.C. Andreani A. Bozzola P. Kowalczewski M. Liscidini L. Redorici Silicon solar cells: toward the efficiency limits Adv. Phys. X 4 2018 125 148 L.C. Andreani, A. Bozzola, P. Kowalczewski, M. Liscidini, L. Redorici, Silicon solar cells: toward the efficiency limits, Advances in Physics: X, 4 (2018) 125-148. [4] ITRPV International Technology Roadmap for Photovoltaic (ITRPV): 2018 Results 10th edition 2019 ITRPV International Technology Roadmap for Photovoltaic (ITRPV): 2018 Results 10th edition, 10th ed. (2019). [5] P. Aurang R. Turan H.E. Unalan Nanowire decorated, ultra-thin, single crystalline silicon for photovoltaic devices Nanotechnology 28 2017 405205 P. Aurang, R. Turan, H.E. Unalan, Nanowire decorated, ultra-thin, single crystalline silicon for photovoltaic devices, Nanotechnology, 28 (2017) 405205. [6] I. Hwang H.-D. Um B.-S. Kim M. Wober K. Seo Flexible crystalline silicon radial junction photovoltaics with vertically aligned tapered microwires Energy Environ. Sci. 11 2018 641 647 I. Hwang, H.-D. Um, B.-S. Kim, M. Wober, K. Seo, Flexible crystalline silicon radial junction photovoltaics with vertically aligned tapered microwires, Energy & Environmental Science, 11 (2018) 641-647. [7] Y. Da X. Liu Y. Xuan Q. Li Photon management effects of hybrid nanostructures/microstructures for organic-silicon heterojunction solar cells Int. J. Energy Res. 42 2018 4875 4890 Y. Da, X. Liu, Y. Xuan, Q. Li, Photon management effects of hybrid nanostructures/microstructures for organic-silicon heterojunction solar cells, International Journal of Energy Research, 42 (2018) 4875-4890. [8] N.A.M. Noor S.K. Mohamad S.S. Hamil M. Devarajan M.Z. Pakhuruddin Effects of etching time towards broadband absorption enhancement in black silicon fabricated by silver-assisted chemical etching Optik 176 2019 586 592 N.A.M. Noor, S.K. Mohamad, S.S. Hamil, M. Devarajan, M.Z. Pakhuruddin, Effects of etching time towards broadband absorption enhancement in black silicon fabricated by silver-assisted chemical etching, Optik, 176 (2019) 586-592. [9] M. Otto M. Algasinger H. Branz B. Gesemann T. Gimpel K. Füchsel T. Käsebier S. Kontermann S. Koynov X. Li V. Naumann J. Oh A.N. Sprafke J. Ziegler M. Zilk R.B. Wehrspohn Black silicon photovoltaics Adv. Opt. Mater. 3 2015 147 164 M. Otto, M. Algasinger, H. Branz, B. Gesemann, T. Gimpel, K. Füchsel, T. Käsebier, S. Kontermann, S. Koynov, X. Li, V. Naumann, J. Oh, A.N. Sprafke, J. Ziegler, M. Zilk, R.B. Wehrspohn, Black Silicon Photovoltaics, Advanced Optical Materials, 3 (2015) 147-164. [10] C.-C. Lin Y.-J. Chuang W.-H. Sun C. Cheng Y.-T. Chen Z.-L. Chen C.-H. Chien F.-H. Ko Ultrathin single-crystalline silicon solar cells for mechanically flexible and optimal surface morphology designs Microelectron. Eng. 145 2015 128 132 C.-C. Lin, Y.-J. Chuang, W.-H. Sun, C. Cheng, Y.-T. Chen, Z.-L. Chen, C.-H. Chien, F.-H. Ko, Ultrathin single-crystalline silicon solar cells for mechanically flexible and optimal surface morphology designs, Microelectronic Engineering, 145 (2015) 128-132. [11] S. Wang B.D. Weil Y. Li K.X. Wang E. Garnett S. Fan Y. Cui Large-area free-standing ultrathin single-crystal silicon as processable materials Nano Lett. 13 2013 4393 4398 S. Wang, B.D. Weil, Y. Li, K.X. Wang, E. Garnett, S. Fan, Y. Cui, Large-area free-standing ultrathin single-crystal silicon as processable materials, Nano Lett, 13 (2013) 4393-4398. [12] X. Liu P.R. Coxon M. Peters B. Hoex J.M. Cole D.J. Fray Black silicon: fabrication methods, properties and solar energy applications Energy Environ. Sci. 7 2014 3223 3263 X. Liu, P.R. Coxon, M. Peters, B. Hoex, J.M. Cole, D.J. Fray, Black silicon: fabrication methods, properties and solar energy applications, Energy Environ. Sci., 7 (2014) 3223-3263. [13] M. Abouda-Lachiheb N. Nafie M. Bouaicha The dual role of silver during silicon etching in HF solution Nanoscale Res. Lett. 7 2012 455 M. Abouda-Lachiheb, N. Nafie, M. Bouaicha, The dual role of silver during silicon etching in HF solution, Nanoscale Research Letters, 7 (2012) 455. [14] A.G. Nassiopoulou V. Gianneta C. Katsogridakis Si nanowires by a single-step metal-assisted chemical etching process on lithographically defined areas: formation kinetics Nanoscale Res. Lett. 6 2011 597 A.G. Nassiopoulou, V. Gianneta, C. Katsogridakis, Si nanowires by a single-step metal-assisted chemical etching process on lithographically defined areas: formation kinetics, Nanoscale Research Letters, 6 (2011) 597. [15] C.S. Schuster B.R. Smith B.J. Sanderson J.T. Mullins J. Atkins P. Joshi L. McNamara T.F. Krauss D.G. Jenkins Flexible silicon-based alpha-particle detector Appl. Phys. Lett. 111 2017 C.S. Schuster, B.R. Smith, B.J. Sanderson, J.T. Mullins, J. Atkins, P. Joshi, L. McNamara, T.F. Krauss, D.G. Jenkins, Flexible silicon-based alpha-particle detector, Applied Physics Letters, 111 (2017). [16] J.M. Weisse C.H. Lee D.R. Kim X. Zheng Fabrication of flexible and vertical silicon nanowire electronics Nano Lett. 12 2012 3339 3343 J.M. Weisse, C.H. Lee, D.R. Kim, X. Zheng, Fabrication of flexible and vertical silicon nanowire electronics, Nano Lett, 12 (2012) 3339-3343. [17] M.Z. Pakhuruddin J. Huang J. Dore S. Varlamov Enhanced light-trapping in laser-crystallised silicon thin-film solar cells on glass by optimised back surface reflectors Sol. Energy 150 2017 477 484 M.Z. Pakhuruddin, J. Huang, J. Dore, S. Varlamov, Enhanced light-trapping in laser-crystallised silicon thin-film solar cells on glass by optimised back surface reflectors, Solar Energy, 150 (2017) 477-484. [18] L. Wang A. Lochtefeld J. Han A.P. Gerger M. Carroll J. Ji A. Lennon H. Li R. Opila A. Barnett Development of a 16.8% efficient 18-μm silicon solar cell on steel Ieee J. Photovolt. 4 2014 1397 1404 L. Wang, A. Lochtefeld, J. Han, A.P. Gerger, M. Carroll, J. Ji, A. Lennon, H. Li, R. Opila, A. Barnett, Development of a 16.8% Efficient 18-μm Silicon Solar Cell on Steel, IEEE Journal of Photovoltaics, 4 (2014) 1397-1404. [19] W. Kern The evolution of silicon wafer cleaning technology, the electrochemical society Inc. 137 1990 1887 1892 W. Kern, The Evolution of Silicon Wafer Cleaning Technology, The Electrochemical Society, Inc., 137 (1990) 1887-1892. [20] Y.-T. Lu A.R. Barron Nanopore-type black silicon anti-reflection layers fabricated by a one-step silver-assisted chemical etching J. Chem. Soc. Faraday Trans. 15 2013 9862 9870 Y.-T. Lu, A.R. Barron, Nanopore-type black silicon anti-reflection layers fabricated by a one-step silver-assisted chemical etching, Physical Chemistry Chemical Physics, 15 (2013) 9862-9870. [21] S. Thiyagu B. Parvathy Devi Z. Pei Y.-H. Chen J.-C. Liu Ultra-low reflectance, high absorption microcrystalline silicon nanostalagmite Nanoscale Res. Lett. 7 2012 1 6 S. Thiyagu, B. Parvathy Devi, Z. Pei, Y.-H. Chen, J.-C. Liu, Ultra-low reflectance, high absorption microcrystalline silicon nanostalagmite, Nanoscale Research Letters, 7 (2012) 1-6. [22] M.Z. Pakhuruddin J. Huang J. Dore S. Varlamov Enhanced absorption in laser-crystallized silicon thin films on textured glass IEEE J. Photovolt. 6 2016 852 859 M.Z. Pakhuruddin, J. Huang, J. Dore, S. Varlamov, Enhanced Absorption in Laser-Crystallized Silicon Thin Films on Textured Glass, IEEE Journal of Photovoltaics, 6 (2016) 852-859. [23] D. Payne T.H. Fung M.U. Khan J. Cruz-Campa K. McIntosh M. Abbott Understanding the Optics of Industrial Black Silicon, 1999 2018 050007 D. Payne, T.H. Fung, M.U. Khan, J. Cruz-Campa, K. McIntosh, M. Abbott, Understanding the optics of industrial black silicon, 1999 (2018) 050007. [24] A. Abdulkadir A.A. Aziz M.Z. Pakhuruddin Optimization of etching time for broadband absorption enhancement in black silicon fabricated by one-step electroless silver-assisted wet chemical etching Optik 187 2019 74 80 A. Abdulkadir, A.A. Aziz, M.Z. Pakhuruddin, Optimization of etching time for broadband absorption enhancement in black silicon fabricated by one-step electroless silver-assisted wet chemical etching, Optik, 187 (2019) 74-80. [25] L.U. Vinzons L. Shu S. Yip C.-Y. Wong L.L.H. Chan J.C. Ho Unraveling the morphological evolution and etching kinetics of porous silicon nanowires during metal-assisted chemical etching Nanoscale Res. Lett. 12 2017 385 L.U. Vinzons, L. Shu, S. Yip, C.-Y. Wong, L.L.H. Chan, J.C. Ho, Unraveling the Morphological Evolution and Etching Kinetics of Porous Silicon Nanowires During Metal-Assisted Chemical Etching, Nanoscale Research Letters, 12 (2017) 385. [26] J.C. Zwinkels M. Noël C.X. Dodd Procedures and standards for accurate spectrophotometric measurements of specular reflectance Appl. Opt. 33 1994 7933 7944 J.C. Zwinkels, M. Noël, C.X. Dodd, Procedures and standards for accurate spectrophotometric measurements of specular reflectance, Applied Optics, 33 (1994) 7933-7944. [27] H.A. Atwater A. Polman Plasmonics for improved photovoltaic devices Nat. Mater. 9 2010 1 11 H.A. Atwater, A. Polman, Plasmonics for improved photovoltaic devices, Nat Mater, 9 (2010) 1-11. [28] S. Chattopadhyay Y.F. Huang Y.J. Jen A. Ganguly K.H. Chen L.C. Chen Anti-reflecting and photonic nanostructures Mater. Sci. Eng. R Rep. 69 2010 1 35 S. Chattopadhyay, Y.F. Huang, Y.J. Jen, A. Ganguly, K.H. Chen, L.C. Chen, Anti-reflecting and photonic nanostructures, Materials Science and Engineering: R: Reports, 69 (2010) 1-35. [29] T.L. Temple G.D.K. Mahanama H.S. Reehal D.M. Bagnall Influence of localized surface plasmon excitation in silver nanoparticles on the performance of silicon solar cells Sol. Energy Mater. Sol. Cells 93 2009 1978 1985 T.L. Temple, G.D.K. Mahanama, H.S. Reehal, D.M. Bagnall, Influence of localized surface plasmon excitation in silver nanoparticles on the performance of silicon solar cells, Solar Energy Materials & Solar Cells, 93 (2009) 1978–1985. [30] S. Li W. Ma X. Chen K. Xie Y. Li X. He X. Yang Y. Lei Structure and antireflection properties of SiNWs arrays form mc-Si wafer through Ag-catalyzed chemical etching Appl. Surf. Sci. 369 2016 232 240 S. Li, W. Ma, X. Chen, K. Xie, Y. Li, X. He, X. Yang, Y. Lei, Structure and antireflection properties of SiNWs arrays form mc-Si wafer through Ag-catalyzed chemical etching, Applied Surface Science, 369 (2016) 232-240. [31] Z.R. Smith R.L. Smith S.D. Collins Mechanism of nanowire formation in metal assisted chemical etching Electrochim. Acta 92 2013 139 147 Z.R. Smith, R.L. Smith, S.D. Collins, Mechanism of nanowire formation in metal assisted chemical etching, Electrochimica Acta, 92 (2013) 139-147. [32] H.-D. Um K. Lee I. Hwang J. Park D. Choi N. Kim H. Kim K. Seo Progress on silicon microwire solar cells J. Mater. Chem. A 8 2020 5395 5420 H.-D. Um, K. Lee, I. Hwang, J. Park, D. Choi, N. Kim, H. Kim, K. Seo, Progress on Silicon Microwire Solar Cells, Journal of Materials Chemistry A, 8 (2020) 5395-5420.", "scopus-id": "85092721008", "coredata": {"eid": "1-s2.0-S0030402620316065", "dc:description": "This paper presents optimization of etching time in metal-assisted chemical etching (MACE) process for enhanced broadband absorption in flexible black silicon (b-Si) on stainless steel (SS) foil. Flexible monocrystalline silicon (mono c-Si) wafers with 65 μm thickness are used in this work. For the optimization of etching time, one-step MACE process is utilized with 10−25 min etching to fabricate the b-Si absorber. The SS foil beneath the b-Si also acts as a back reflector (BR) which ensures zero transmission loss in the long wavelength region (above 800 nm). After 20 min etching, b-Si with average nanowires (NWs) length of 982 nm is formed. This condition exhibits the lowest average weighted reflection (AWR) and the highest broadband light absorption in the b-Si within 300−1100 nm wavelength region, owing to refractive index grading effect at the air/b-Si interface. This corresponds to the maximum potential short-circuit density (Jsc(max)) of 39.3 mA/cm2, or 62.4 % enhancement when compared to the planar c-Si reference. The findings demonstrate the potential of flexible b-Si on SS foil to deliver high photocurrent in the future solar cells.", "openArchiveArticle": "false", "prism:coverDate": "2021-01-31", "openaccessUserLicense": null, "prism:aggregationType": "Journal", "prism:url": "https://api.elsevier.com/content/article/pii/S0030402620316065", "dc:creator": [{"@_fa": "true", "$": "Omar, Halo Dalshad"}, {"@_fa": "true", "$": "Hashim, Md. Roslan"}, {"@_fa": "true", "$": "Pakhuruddin, Mohd Zamir"}], "link": [{"@_fa": "true", "@rel": "self", "@href": "https://api.elsevier.com/content/article/pii/S0030402620316065"}, {"@_fa": "true", "@rel": "scidir", "@href": "https://www.sciencedirect.com/science/article/pii/S0030402620316065"}], "dc:format": "application/json", "openaccessType": null, "pii": "S0030-4026(20)31606-5", "prism:volume": "225", "articleNumber": "165781", "prism:publisher": "Elsevier GmbH.", "dc:title": "Optimization of etching time for enhanced broadband absorption in flexible black silicon on stainless steel foil", "prism:copyright": "© 2020 Elsevier GmbH. All rights reserved.", "openaccess": "0", "prism:issn": "00304026", "dcterms:subject": [{"@_fa": "true", "$": "Flexible"}, {"@_fa": "true", "$": "Black silicon"}, {"@_fa": "true", "$": "MACE"}, {"@_fa": "true", "$": "Stainless steel"}, {"@_fa": "true", "$": "Absorption"}], "openaccessArticle": "false", "prism:publicationName": "Optik", "openaccessSponsorType": null, "prism:pageRange": "165781", "pubType": "fla", "prism:coverDisplayDate": "January 2021", "prism:doi": "10.1016/j.ijleo.2020.165781", "prism:startingPage": "165781", "dc:identifier": "doi:10.1016/j.ijleo.2020.165781", "openaccessSponsorName": null}, "objects": {"object": [{"@category": "standard", "@height": "284", "@width": "602", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0030402620316065-gr2.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "108580", "@ref": "gr2", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "147", "@width": "602", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0030402620316065-gr3.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "21848", "@ref": "gr3", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "471", "@width": "602", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0030402620316065-gr1.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "65977", "@ref": "gr1", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "236", "@width": "301", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0030402620316065-gr6.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "20936", "@ref": "gr6", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "280", "@width": "602", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0030402620316065-gr4.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "35044", "@ref": "gr4", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "252", "@width": "602", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0030402620316065-gr5.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "40901", "@ref": "gr5", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "103", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0030402620316065-gr2.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "18387", "@ref": "gr2", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "54", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0030402620316065-gr3.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "6491", "@ref": "gr3", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "164", "@width": "209", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0030402620316065-gr1.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "14411", "@ref": "gr1", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "164", "@width": "209", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0030402620316065-gr6.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "8217", "@ref": "gr6", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "102", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0030402620316065-gr4.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "7366", "@ref": "gr4", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "92", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0030402620316065-gr5.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "6963", "@ref": "gr5", "@mimetype": "image/gif"}, {"@category": "high", "@height": "1256", "@width": "2667", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0030402620316065-gr2_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "1308083", "@ref": "gr2", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "652", "@width": "2667", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0030402620316065-gr3_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "416476", "@ref": "gr3", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "2087", "@width": "2667", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0030402620316065-gr1_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "663656", "@ref": "gr1", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "1046", "@width": "1333", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0030402620316065-gr6_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "175856", "@ref": "gr6", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "1239", "@width": "2667", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0030402620316065-gr4_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "331582", "@ref": "gr4", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "1117", "@width": "2667", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0030402620316065-gr5_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "398614", "@ref": "gr5", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0030402620316065-si1.svg?httpAccept=%2A%2F%2A", "@multimediatype": "Scalable Vector Graphics file", "@type": "ALTIMG", "@size": "47572", "@ref": "si1", "@mimetype": "image/svg+xml"}, {"@category": "thumbnail", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0030402620316065-si2.svg?httpAccept=%2A%2F%2A", "@multimediatype": "Scalable Vector Graphics file", "@type": "ALTIMG", "@size": "35015", "@ref": "si2", "@mimetype": "image/svg+xml"}, {"@category": "standard", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0030402620316065-am.pdf?httpAccept=%2A%2F%2A", "@multimediatype": "Acrobat PDF file", "@type": "AAM-PDF", "@size": "6877829", "@ref": "am", "@mimetype": "application/pdf"}]}, "link": {"@rel": "abstract", "@href": "https://api.elsevier.com/content/abstract/scopus_id/85092721008"}}