{"scopus-eid": "2-s2.0-84870054862", "originalText": "serial JL 271906 291210 291719 291777 291778 291788 291892 31 Scripta Materialia SCRIPTAMATERIALIA 2012-10-23 2012-10-23 2012-11-22T19:25:59 1-s2.0-S1359646212006525 S1359-6462(12)00652-5 S1359646212006525 10.1016/j.scriptamat.2012.10.023 S300 S300.1 FULL-TEXT 1-s2.0-S1359646212X00228 2015-05-15T05:45:45.908031-04:00 0 0 20130201 20130228 2013 2012-10-23T00:00:00Z articleinfo crossmark dco dateupdated tomb dateloaded datesearch indexeddate issuelist volumelist yearnav articletitlenorm authfirstinitialnorm authfirstsurnamenorm cid cids contenttype copyright dateloadedtxt docsubtype doctype doi eid ewtransactionid hubeid issfirst issn issnnorm itemstage itemtransactionid itemweight openaccess openarchive pg pgfirst pglast pii piinorm pubdateend pubdatestart pubdatetxt pubyr sortorder srctitle srctitlenorm srctype subheadings volfirst volissue webpdf webpdfpagecount figure table body mmlmath acknowledge affil articletitle auth authfirstini authfull authkeywords authlast primabst ref alllist content subj ssids 1359-6462 13596462 false 68 68 3 4 3 4 Volume 68, Issues 3–4 10 199 202 199 202 201302 February 2013 2013-02-01 2013-02-28 2013 article fla Copyright © 2012 Acta Materialia Inc. Published by Elsevier Ltd. on behalf of Acta Materialia Inc. All rights reserved. BLACKSILICONEMITTERDIMINISHESLATERALELECTRICFIELDENHANCESBLUERESPONSEASOLARCELLBYOPTIMIZINGDEPLETIONREGIONUNIFORMITY SHEN Z References SRIVASTAVA 2012 33 S YUAN 2009 123501 H TOOR 2011 103501 F YOO 2009 333 J YOO 2006 3085 J HSU 2012 197514 W LIU 2012 1392 Y TORRES 2010 621 R VOROBYEV 2011 7291 A NISHIOKA 2009 9504 K KOYNOV 2007 R53 S BRANZ 2009 231121 H MA 2006 171907 L DEKKERS 2000 311 H XIA 2011 1574 Y OTTO 2010 5035 M YANG 2008 106 W SPROUL 1994 2851 A SHENX2013X199 SHENX2013X199X202 SHENX2013X199XZ SHENX2013X199X202XZ item S1359-6462(12)00652-5 S1359646212006525 1-s2.0-S1359646212006525 10.1016/j.scriptamat.2012.10.023 271906 2012-11-22T16:12:54.042245-05:00 2013-02-01 2013-02-28 1-s2.0-S1359646212006525-main.pdf https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S1359646212006525/MAIN/application/pdf/574701a3f8c8c2bddb21feaece10cbe4/main.pdf https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1359646212006525/MAIN/application/pdf/574701a3f8c8c2bddb21feaece10cbe4/main.pdf main.pdf pdf true 676492 MAIN 4 1-s2.0-S1359646212006525-main_1.png https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S1359646212006525/PREVIEW/image/png/67b52c2056749f8f8dfe1d15a9455545/main_1.png https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1359646212006525/PREVIEW/image/png/67b52c2056749f8f8dfe1d15a9455545/main_1.png main_1.png png 78220 849 656 IMAGE-WEB-PDF 1 1-s2.0-S1359646212006525-si2.gif https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S1359646212006525/STRIPIN/image/gif/4dd5b34fe085bb738557b88d7bd890fd/si2.gif https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1359646212006525/STRIPIN/image/gif/4dd5b34fe085bb738557b88d7bd890fd/si2.gif si2 si2.gif gif 557 19 106 ALTIMG 1-s2.0-S1359646212006525-si1.gif https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S1359646212006525/STRIPIN/image/gif/44dd22899dc56494f109159b4e03389e/si1.gif https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1359646212006525/STRIPIN/image/gif/44dd22899dc56494f109159b4e03389e/si1.gif si1 si1.gif gif 938 15 217 ALTIMG 1-s2.0-S1359646212006525-gr2.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S1359646212006525/gr2/DOWNSAMPLED/image/jpeg/e1e6efd3c6636793bb2c300022246920/gr2.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1359646212006525/gr2/DOWNSAMPLED/image/jpeg/e1e6efd3c6636793bb2c300022246920/gr2.jpg gr2 gr2.jpg jpg 50590 290 364 IMAGE-DOWNSAMPLED 1-s2.0-S1359646212006525-gr2.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S1359646212006525/gr2/THUMBNAIL/image/gif/4534b5b76437d56ecc08e8098a2a70fd/gr2.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1359646212006525/gr2/THUMBNAIL/image/gif/4534b5b76437d56ecc08e8098a2a70fd/gr2.sml gr2 gr2.sml sml 18839 164 206 IMAGE-THUMBNAIL 1-s2.0-S1359646212006525-gr2_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S1359646212006525/gr2/HIGHRES/image/jpeg/a14aa6a78828941743712d3909d0d188/gr2_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1359646212006525/gr2/HIGHRES/image/jpeg/a14aa6a78828941743712d3909d0d188/gr2_lrg.jpg gr2 gr2_lrg.jpg jpg 397575 1284 1614 IMAGE-HIGH-RES 1-s2.0-S1359646212006525-gr3.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S1359646212006525/gr3/DOWNSAMPLED/image/jpeg/61c838f77a83248ed1a215d93b951409/gr3.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1359646212006525/gr3/DOWNSAMPLED/image/jpeg/61c838f77a83248ed1a215d93b951409/gr3.jpg gr3 gr3.jpg jpg 30507 381 339 IMAGE-DOWNSAMPLED 1-s2.0-S1359646212006525-gr3.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S1359646212006525/gr3/THUMBNAIL/image/gif/7c0b6a5981e8714a49177b8b8c18fe0f/gr3.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1359646212006525/gr3/THUMBNAIL/image/gif/7c0b6a5981e8714a49177b8b8c18fe0f/gr3.sml gr3 gr3.sml sml 3688 164 146 IMAGE-THUMBNAIL 1-s2.0-S1359646212006525-gr3_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S1359646212006525/gr3/HIGHRES/image/jpeg/d72bfc14b3833735f9411e7adc558f54/gr3_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1359646212006525/gr3/HIGHRES/image/jpeg/d72bfc14b3833735f9411e7adc558f54/gr3_lrg.jpg gr3 gr3_lrg.jpg jpg 165962 1692 1504 IMAGE-HIGH-RES 1-s2.0-S1359646212006525-gr4.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S1359646212006525/gr4/DOWNSAMPLED/image/jpeg/13618935672d6c97ca59ec0855126bef/gr4.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1359646212006525/gr4/DOWNSAMPLED/image/jpeg/13618935672d6c97ca59ec0855126bef/gr4.jpg gr4 gr4.jpg jpg 75023 592 366 IMAGE-DOWNSAMPLED 1-s2.0-S1359646212006525-gr4.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S1359646212006525/gr4/THUMBNAIL/image/gif/53c36bc4c7df94d596d58ae0d500bc89/gr4.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1359646212006525/gr4/THUMBNAIL/image/gif/53c36bc4c7df94d596d58ae0d500bc89/gr4.sml gr4 gr4.sml sml 4852 163 101 IMAGE-THUMBNAIL 1-s2.0-S1359646212006525-gr4_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S1359646212006525/gr4/HIGHRES/image/jpeg/3d4a44eb0e83f61e5eadb07f48775e1d/gr4_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1359646212006525/gr4/HIGHRES/image/jpeg/3d4a44eb0e83f61e5eadb07f48775e1d/gr4_lrg.jpg gr4 gr4_lrg.jpg jpg 475216 2619 1620 IMAGE-HIGH-RES 1-s2.0-S1359646212006525-gr1.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S1359646212006525/gr1/DOWNSAMPLED/image/jpeg/12ef3892b2922077d56144b23c45f0dd/gr1.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1359646212006525/gr1/DOWNSAMPLED/image/jpeg/12ef3892b2922077d56144b23c45f0dd/gr1.jpg gr1 gr1.jpg jpg 34839 371 340 IMAGE-DOWNSAMPLED 1-s2.0-S1359646212006525-gr1.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S1359646212006525/gr1/THUMBNAIL/image/gif/aefe0a8e9f0ba2e6a8652e9085a44a39/gr1.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1359646212006525/gr1/THUMBNAIL/image/gif/aefe0a8e9f0ba2e6a8652e9085a44a39/gr1.sml gr1 gr1.sml sml 6355 164 150 IMAGE-THUMBNAIL 1-s2.0-S1359646212006525-gr1_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S1359646212006525/gr1/HIGHRES/image/jpeg/219862a68918f8ee1743c020b11c9746/gr1_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1359646212006525/gr1/HIGHRES/image/jpeg/219862a68918f8ee1743c020b11c9746/gr1_lrg.jpg gr1 gr1_lrg.jpg jpg 208677 1646 1507 IMAGE-HIGH-RES SMM 9640 S1359-6462(12)00652-5 10.1016/j.scriptamat.2012.10.023 Acta Materialia Inc. Figure 1 Schematic illustration of the fabrication process of a black silicon solar cell and a BSOE solar cell. Figure 2 SEM pictures of (a) black silicon and (b) BSOE. The inset image is a top view of the black silicon and BSOE, which illustrates that the morphology is porous. EBIC pictures of cross-sectional views of (c) a black silicon solar cell and (d) a BSOE solar cell. Figure 3 Schematic band diagram of (a) a uniform PN junction and (b) non-uniform PN junction (in three dimensions) under illumination. Due to the non-uniformity of depletion, the built-in electric field E⊥1 and E⊥2 are different, which introduces a lateral electric field E//. Figure 4 (a) Reflectance of black silicon and BSOE after phosphorous doping. Black silicon and BSOE exhibit stronger light trapping than the reference silicon. (b) Reflectance of black silicon and BSOE after SiN x passivation. The effect of antireflection is enhanced the SiN x coating and surface textured structures. (c) Internal quantum efficiency spectra of a black silicon solar cell and a BSOE solar cell. Table 1 Comparison of the electrical parameters of the black silicon solar cells and BSOE solar cells from the illuminated current–voltage characteristics. Cell parameters Black silicon solar cells BSOE solar cells V oc (mV) 600 607 J sc (mAcm−2) 33.2 34.5 R s (mΩ) 3.26 3.01 R sh (Ω) 64.8 423.0 FF (%) 77.87 78.06 E ff (%) 15.5 16.3 J rev (mAcm−2) 2.8 0.26 Black silicon on emitter diminishes the lateral electric field and enhances the blue response of a solar cell by optimizing depletion region uniformity Zenan Shen Bangwu Liu ⁎ Yang Xia Jie Liu Jinhu Liu Sihua Zhong Chaobo Li Key Laboratory of Microelectronics Devices and Integrated Technology, Institute of Microelectronics, Chinese Academy of Sciences, Beijing, China ⁎ Corresponding author. Tel.: +86 10 82995758; fax: +86 10 82995652. A black silicon on emitter (BSOE) solar cell, with a uniform depletion region, was investigated by its internal quantum efficiency (IQE) and by scanning electron microscopy using an electron beam-induced current. We establish a three-dimensional energy band diagram of a non-uniform depletion region to illustrate the shunt effect by introducing a lateral electric field into the black silicon solar cell. The IQE spectral response at 450nm is enhanced by ∼31%. The conversion efficiency is improved by 0.8% abs compared with a black silicon solar cell. Keywords Solar cells Texture Optical reflectivity Electrical properties Size effect Black silicon with a density-degraded surface layer has the potential for a groundbreaking application in solar cells. Such density-degraded Si layers suppress surface reflection and could replace conventional antireflection interference layers. The most important reason for this is that the structure of the black silicon is either on the nanoscale or smaller than the wavelength of the incident light, resulting in low reflectivity [1]. A black silicon nanostructure with a depth of 100–500nm and a diameter of 50–100nm has the best cell performance as a compromise between low surface recombination and light trapping [2–7]. Various methods to fabricate black silicon have been investigated, including laser texturing [8,9], Au/Ag nanoparticle catalysis etching [2,3,10–12], electrochemical etching [13], reactive ion etching [4,14] and plasma immersion ion implantation (PIII) [15]. Recently, crystalline solar cells with a black silicon surface structure have been demonstrated to have a conversion efficiency in the range of 10.2–17.1% [2–7]. These conversion efficiencies, however, are no higher than the current state-of-the-art. One of the most important reasons is that electrical transport is strongly influenced by the surface recombination and complex field distribution inside the nanostructure [16]. The surface recombination introduced by the surface state can be reduced when the surface is passivated by an SiO2, SiN x or Al2O3 layer. Another reason is that an emitter doped by diffusion with an optimized junction depth of 300–500nm is comparable to the size of black silicon (100–500nm). The morphology of the black silicon could affect the doping uniformity of the emitter, and could introduce a lateral electrical field inside the nanostructures. According to the previous work, the size effect of black silicon and the uniformity of the PN junction of black silicon have not been investigated yet. In this paper, we analyze the PN junction of black silicon using an electron beam-induced current (EBIC) and establish schematic band diagrams of the uniform/non-uniform PN junctions under illumination. In order to diminish the lateral electrical field of the non-uniform depletion region of black silicon and reduce the shunt effect, we propose a method called black silicon on emitter (BSOE) to optimize the depletion region and improve the uniformity of the black silicon solar cell. The BSOE solar cell also exhibits a better blue response and higher short-circuit current density. The original material used in this study was commercially available boron-doped p-type mc-Si, with a thickness of 200±20μm, an average resistivity of 1∼3Ωcm and a surface area of 156×156mm2. Figure 1 shows the schematic illustration of the fabrication process of black silicon solar cell and BSOE solar cell. First, the saw damage on the substrate was removed by acid solution mixed with HNO3, HF, CH3COOH and H2O. The substrate was sent to dope phosphorous heavily by POCl3 homogeneous diffusion. The depth of the emitter was 400–700nm and the sheet resistance was 12Ω/□. The emitter was then textured slightly by PIII using a reactive gas mixture of SF6 and O2. The black silicon structures were formed on the surface and the sheet resistance was controlled at 50Ω/□. To finish the BSOE solar cell fabrication, the BSOE underwent edge etching, SiN x deposition, screen print and co-firing. Compared to the BSOE solar cell, the normal black silicon solar cell first underwent PIII treatment and was then submitted to phosphorous doping to the PN junction. The emitter depth was around 300–500nm and the surface sheet resistance was 50Ω/□. Subsequently, the process was the same as that of the BSOE solar cell. The morphology of the black silicon and the BSOE was investigated by scanning electron microscopy (SEM) in Figure 2 (a) and (b). The black silicon surface exhibits a porous-like structure in the top view. The sectional view of the BSOE indicates that the depth of the porous-like structure is around 110–200nm, which is less than that of the black silicon. There are two reasons for this: (i) the width of the emitter is about 400–700nm, which limits the surface PIII treatment on the emitter and (ii) the surface sheet resistance should be controlled at 50±3Ω/□ for the solar cell after PIII treatment. The uniformity of the PN junction depletion region of the black silicon and the BSOE were measured by EBIC. Figure 2(c) and (d) illustrates EBIC pictures of a cross-sectional view of the black silicon and BSOE solar cells. Figure 2(c) indicates that the depletion region of the PN junction is non-uniform. It is affected by the morphology of black silicon. The width of the depletion region varies from 670nm (peak) to 860nm (valley). During the phosphorous diffusion process, the tip of the black silicon is heavily doped by phosphorous from both sides of the wall, while the valley of the black silicon is doped by phosphorous only from the surface. Figure 2(d) shows that the PN junction depletion region of the BSOE is more uniform. The width of the depletion region is related to the doping content of the N-type region (emitter) and the P-type region (base). In this study, the width of depletion depends on the doping content of the emitter because the base is the same. The built-in potential (ϕ i ) of the PN junction is related to the difference between the N-region Fermi energy level (E Fn ) and the P-region Fermi energy level (E Fp ). The uniformity of the PN junction depletion region affects both the built-in potential and the built-in electronic field. To illustrate the effects of the non-uniformity depletion region of a solar cell, we establish a schematic band diagram of (a) a uniform PN junction and (b) a non-uniform PN junction under illumination in Figure 3 . The doping of the conventional solar cell with phosphorus by thermal diffusion is relative uniform. The presence of hundred-nanometer structures means that the black silicon could absorb much more incident light, but it make the doping of phosphorus non-uniform. Figure 3(a) shows the energy band of uniform depletion under illumination. The electrons translocate from the P region to the N + region. However, in Figure 3(b) the electrons are not only affected by the vertical electric field from the P region to the N + region, but are also influenced by the lateral electric field E//, from the strong electric field E⊥1 to the weak electric field E⊥2. Due to the introduction of E//, the shunt effect reduces shunt resistance and increases reverse current density. The reflectance of black silicon and BSOE was measured by an ultraviolet–visible–near-infrared spectrophotometer (Cary-5000) equipped with an integrating sphere detector. Figure 4 (a) shows the reflectance of BSOE and black silicon after phosphorous doping. When the wavelength of the incident light is shorter than 1100nm, the reflectance of the BSOE is greater than that of the black silicon because the less textured structure of the BSOE allows less light to be trapped. When the incident photon energy is below 1.12eV (the silicon band gap), the reflectance of the BSOE is lower (3–8% absolute) than that of the black silicon. The emitter is heavily doped by phosphorous, which introduces impurity absorption during the fabrication of the BSOE solar cell. Figure 4(b) shows the reflectance of black silicon and BSOE after the SiN x has been passivated by plasma-enhanced chemical vapor deposition. Above the band gap, the reference silicon surface coated with an SiN x layer suppresses reflection efficiently only in a narrow wavelength range, while the antireflection of black silicon and BSOE is enhanced by the SiN x coating and the surface textured structures. Figure 4(c) shows the internal quantum efficiency (IQE) spectra of the black silicon solar cell and the BSOE solar cell. It indicates that the BSOE solar cell exhibits a better blue response but a worse infrared response. The total IQE is the sum of contributions of the separate parts [17]: (1) IQE tatal = IQE e + IQE scr + IQE b where IQE e , IQE scr and IQE b denote the contributions of the emitter, the space charge region (scr) and the base to IQE total , respectively. Figure 4(c) indicates that the BSOE solar cell has a high IQE total for photons with higher energy (λ <0.6μm). At wavelengths from 300 to 450nm, the BSOE solar cell has a higher emitter IQE e because of the low surface recombination. In order to assess the surface recombination, the surface recombination velocity (S eff,) is calculated by measuring the effective minority lifetime of the (τ eff,) on the black silicon and on the BSOE (without phosphorus doping) using the microwave-based photoconductance decay (μ − PCD). The average τ eff, of the black silicon and the BSOE is 1.23 and 1.42μs respectively. The average S eff, is calculated using the following expression [18]: (2) S eff , = W / 2 τ eff , where W is the wafer thickness. The calculated values of S eff, are 8130cms−1 (black silicon) and 7042cms−1 (BSOE). The greater surface recombination of black silicon may be attributed to enlarged effective surface areas (A eff ). The A eff of black silicon and BSOE are 1.83 and 1.35 times that of plain silicon, as measured by atomic force microscopy. At wavelengths from 450 to 600nm, the IQE scr affects the total IQE total . The BSOE solar cell, with more uniform depletion of the PN junction, reduces the lateral field E//. Therefore, the shunt effect weakens and the IQE total increases. For the photons with lower energy (λ >0.7μm), the IQE total of the BSOE solar cell is lower than that of the black silicon solar cell. This is attributed to poorer back surface field passivation: the BSOE solar cell is heavily doped by phosphorous at the back side, resulting in bad Al back field passivation. The electrical parameters of the BSOE solar cells and black silicon solar cells are listed in Table 1 . The conversion efficiency of the BSOE solar cell is improved by 0.8% abs compared to the black silicon solar cell. The short-circuit current density of the BSOE solar cell increases to 34.5mAcm−2. The open circuit voltage (V oc ) of the BSOE solar cell improves by 7mV compared to the black silicon solar cell. These could be attributed to the great increase in IQE at the blue response, which is related to the lower surface recombination and a more uniform PN junction depletion region. The shunt resistance of the BSOE solar cell is much higher than that of the black silicon solar cell due to the uniform depletion region, which reduces the shunt effect from E//. It can also be improved by a lower reverse current density. The reverse current density of the BSOE solar cell is an order of magnitude less than that of the black silicon solar cell. In conclusion, we have designed a BSOE solar cell to form a uniform PN junction space depletion region that significantly increases the blue response. The IQE spectral response at 450nm is improved from 64.9% to 84.9%. The conversion efficiency is improved by 0.8% abs compared to a black silicon solar cell, from 15.8% to 16.3%. The uniform depletion region diminishes the lateral electric field, and the V oc and J sc are greatly improved. The reverse current density is reduced by an order of magnitude. This work was supported by the National Natural Science Foundation of China (Grant No. 61106060), the Knowledge Innovation Program of the Chinese Academy of Sciences (Grant No. Y2YF028001) and the National High-tech R& D Program of China (Grant No. 2012AA052401). References [1] S.K. Srivastava D. Kumar Vandana M. Sharma R. Kumar P.K. Singh Sol. Energy Mater. Sol. Cells 100 2012 33 [2] H.C. Yuan V.E. Yost M.R. Page P. Stradins D.L. Meier H.M. Branz Appl. Phys. Lett. 95 2009 123501 [3] F. Toor H.M. Branz M.R. Page K.M. Jones H.C. Yuan Appl. Phys. Lett. 99 2011 103501 [4] J. Yoo G. Yu J. Yi Mater. Sci. Eng. B 159 2009 333 [5] J.S. Yoo I.O. Parm U. Gangopadhyay Kyunghae Kim S.K. Dhungel D. Mangalaraj J. Yi Sol. Energy Mater. Sol. Cells 90 2006 3085 [6] W.C. Hsu Y.S. Lu J.Y. Chyan J.A. Yeh Int. J. Photoenergy 2012 2012 197514 [7] Y.P. Liu T. Lai H.L. Li Y. Wang Z.X. Mei H.L. Liang Z.L. Li F.M. Zhang W.J. Wang A.Y. Kuznetsov X.L. Du Small 8 2012 1392 [8] R. Torres V. Vervisch M. Halbwax P. Sarnet T. Delaporte M. Sentis J. Ferreira D. Barakel S. Bastide F. Torregrosa H. Etienne L. Roux J. Optoelectron. Adv. M 12 2010 621 [9] A.Y. Vorobyev C.L. Guo Appl. Surf. Sci. 257 2011 7291 [10] K. Nishioka T. Sueto N. Saito Appl. Surf. Sci. 255 2009 9504 [11] S. Koynov M.S. Brandt M. Stutzmann Phys. Status. Solidi R 1 2007 R53 [12] H.M. Branz V.E. Yost S. Ward K.M. Jones B. To P. Stradins Appl. Phys. Lett. 94 2009 231121 [13] L.L. Ma Y.C. Zhou N. Jiang X. Lu J. Shao W. Lu J. Ge X.M. Ding X.Y. Hou Appl. Phys. Lett. 88 2006 171907 [14] H. Dekkers F. Duerinckx J. Szlufcik J. Nijs Opto-Electron. Rev. 8 2000 311 [15] Y. Xia B.W. Liu J. Liu Z.N. Shen C.B. Li Sol. Energy 85 2011 1574 [16] M. Otto M. Kroll T. Kasebier S.M. Lee M. Putkonen R. Salzer P.T. Miclea R.B. Wehrspohn Adv. Mater. 22 2010 5035 [17] W.J. Yang Z.Q. Ma X. Tang C.B. Feng W.G. Zhao P.P. Shi Sol. Energy 82 2008 106 [18] A.B. Sproul J. Appl. Phys. 76 1994 2851", "scopus-id": "84870054862", "coredata": {"eid": "1-s2.0-S1359646212006525", "dc:description": "A black silicon on emitter (BSOE) solar cell, with a uniform depletion region, was investigated by its internal quantum efficiency (IQE) and by scanning electron microscopy using an electron beam-induced current. We establish a three-dimensional energy band diagram of a non-uniform depletion region to illustrate the shunt effect by introducing a lateral electric field into the black silicon solar cell. The IQE spectral response at 450nm is enhanced by ∼31%. The conversion efficiency is improved by 0.8% abs compared with a black silicon solar cell.", "openArchiveArticle": "false", "prism:coverDate": "2013-02-28", "openaccessUserLicense": null, "prism:aggregationType": "Journal", "prism:url": "https://api.elsevier.com/content/article/pii/S1359646212006525", "dc:creator": [{"@_fa": "true", "$": "Shen, Zenan"}, {"@_fa": "true", "$": "Liu, Bangwu"}, {"@_fa": "true", "$": "Xia, Yang"}, {"@_fa": "true", "$": "Liu, Jie"}, {"@_fa": "true", "$": "Liu, Jinhu"}, {"@_fa": "true", "$": "Zhong, Sihua"}, {"@_fa": "true", "$": "Li, Chaobo"}], "link": [{"@_fa": "true", "@rel": "self", "@href": "https://api.elsevier.com/content/article/pii/S1359646212006525"}, {"@_fa": "true", "@rel": "scidir", "@href": "https://www.sciencedirect.com/science/article/pii/S1359646212006525"}], "dc:format": "application/json", "openaccessType": null, "pii": "S1359-6462(12)00652-5", "prism:volume": "68", "prism:publisher": "Acta Materialia Inc. Published by Elsevier Ltd. on behalf of Acta Materialia Inc.", "dc:title": "Black silicon on emitter diminishes the lateral electric field and enhances the blue response of a solar cell by optimizing depletion region uniformity", "prism:copyright": "Copyright © 2012 Acta Materialia Inc. Published by Elsevier Ltd. on behalf of Acta Materialia Inc. All rights reserved.", "openaccess": "0", "prism:issn": "13596462", "prism:issueIdentifier": "3-4", "dcterms:subject": [{"@_fa": "true", "$": "Solar cells"}, {"@_fa": "true", "$": "Texture"}, {"@_fa": "true", "$": "Optical reflectivity"}, {"@_fa": "true", "$": "Electrical properties"}, {"@_fa": "true", "$": "Size effect"}], "openaccessArticle": "false", "prism:publicationName": "Scripta Materialia", "prism:number": "3-4", "openaccessSponsorType": null, "prism:pageRange": "199-202", "prism:endingPage": "202", "pubType": "fla", "prism:coverDisplayDate": "February 2013", "prism:doi": "10.1016/j.scriptamat.2012.10.023", "prism:startingPage": "199", "dc:identifier": "doi:10.1016/j.scriptamat.2012.10.023", "openaccessSponsorName": null}, "objects": {"object": [{"@category": "thumbnail", "@height": "19", "@width": "106", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1359646212006525-si2.gif?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "ALTIMG", "@size": "557", "@ref": "si2", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "15", "@width": "217", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1359646212006525-si1.gif?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "ALTIMG", "@size": "938", "@ref": "si1", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "290", "@width": "364", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1359646212006525-gr2.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "50590", "@ref": "gr2", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "164", "@width": "206", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1359646212006525-gr2.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "18839", "@ref": "gr2", "@mimetype": "image/gif"}, {"@category": "high", "@height": "1284", "@width": "1614", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1359646212006525-gr2_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "397575", "@ref": "gr2", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "381", "@width": "339", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1359646212006525-gr3.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "30507", "@ref": "gr3", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "164", "@width": "146", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1359646212006525-gr3.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "3688", "@ref": "gr3", "@mimetype": "image/gif"}, {"@category": "high", "@height": "1692", "@width": "1504", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1359646212006525-gr3_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "165962", "@ref": "gr3", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "592", "@width": "366", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1359646212006525-gr4.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "75023", "@ref": "gr4", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "163", "@width": "101", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1359646212006525-gr4.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "4852", "@ref": "gr4", "@mimetype": "image/gif"}, {"@category": "high", "@height": "2619", "@width": "1620", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1359646212006525-gr4_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "475216", "@ref": "gr4", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "371", "@width": "340", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1359646212006525-gr1.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "34839", "@ref": "gr1", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "164", "@width": "150", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1359646212006525-gr1.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "6355", "@ref": "gr1", "@mimetype": "image/gif"}, {"@category": "high", "@height": "1646", "@width": "1507", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1359646212006525-gr1_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "208677", "@ref": "gr1", "@mimetype": "image/jpeg"}]}, "link": {"@rel": "abstract", "@href": "https://api.elsevier.com/content/abstract/scopus_id/84870054862"}}