{"scopus-eid": "2-s2.0-84863624387", "originalText": "serial JL 273239 291210 291690 291821 291827 291884 31 Optik OPTIK 2011-12-30 2011-12-30 2018-11-02T11:08:10 1-s2.0-S0030402611006218 S0030-4026(11)00621-8 S0030402611006218 10.1016/j.ijleo.2011.11.008 S300 S300.1 FULL-TEXT 1-s2.0-S0030402612X00147 2018-11-02T11:24:12.828788Z 0 0 20120801 20120831 2012 2011-12-30T00:00:00Z articleinfo articletitlenorm authfirstinitialnorm authfirstsurnamenorm cid cids contenttype copyright crossmark dateloaded dateloadedtxt datesearch datesort dateupdated dco docsubtype doctype doi eid ewtransactionid hubeid indexeddate issfirst issn issnnorm issuelist itemstage itemtransactionid itemweight openaccess openarchive pg pgfirst pglast pii piinorm pubdateend pubdatestart pubdatetxt pubyr sortorder srctitle srctitlenorm srctype ssids alllist content subj subheadings tomb volfirst volissue volumelist webpdf webpdfpagecount yearnav figure body acknowledge affil articletitle auth authfirstini authfull authkeywords authlast grantnumber grantsponsor primabst ref 0030-4026 00304026 false 123 123 16 16 Volume 123, Issue 16 17 1474 1477 1474 1477 201208 August 2012 2012-08-01 2012-08-31 2012 article fla Copyright © 2011 Elsevier GmbH. All rights reserved. PHOTOVOLTAICPROPERTIESBLACKSILICONMICROSTRUCTUREDBYFEMTOSECONDPULSEDLASER BAO X 1 Introduction 2 Experimental 3 Results and discussion 4 Conclusion Acknowledgements References AUSTON 1975 101 103 D TSYBESKOV 1998 33 38 L WUNSCH 2002 526 529 F REYNOLDS 2009 6392 6395 S KOLESAR 1996 23 29 E AHMED 1984 223 232 N STOCKS 1996 33 42 M WINDERBAUM 1997 239 248 S BUDIANU 2002 223 229 E KEPPNER 1999 169 177 H KOYNOV 2006 203107 S SUN 2009 9301 9304 L PENG 2005 1062 1067 K LIANG 2009 285 289 X PARTHIBAN 2009 92 97 S HER 1998 1673 1675 T WU 2001 1850 1852 C CAREY 2005 1773 1775 J HER 2000 383 385 T MCINTOSH 2009 191 197 K KEEVERS 1996 195 204 M BAOX2012X1474 BAOX2012X1474X1477 BAOX2012X1474XX BAOX2012X1474X1477XX item S0030-4026(11)00621-8 S0030402611006218 1-s2.0-S0030402611006218 10.1016/j.ijleo.2011.11.008 273239 2018-11-02T11:24:12.828788Z 2012-08-01 2012-08-31 1-s2.0-S0030402611006218-main.pdf https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0030402611006218/MAIN/application/pdf/8b6242d09816fe4f6af1877ae2559d12/main.pdf https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0030402611006218/MAIN/application/pdf/8b6242d09816fe4f6af1877ae2559d12/main.pdf main.pdf pdf true 371005 MAIN 4 1-s2.0-S0030402611006218-main_1.png https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0030402611006218/PREVIEW/image/png/7d9e52df65e969a344126b286eca776c/main_1.png https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0030402611006218/PREVIEW/image/png/7d9e52df65e969a344126b286eca776c/main_1.png main_1.png png 56891 849 656 IMAGE-WEB-PDF 1 1-s2.0-S0030402611006218-gr1.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0030402611006218/gr1/THUMBNAIL/image/gif/7bdd13b669b3f94a0fa9b66b4c7a59e7/gr1.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0030402611006218/gr1/THUMBNAIL/image/gif/7bdd13b669b3f94a0fa9b66b4c7a59e7/gr1.sml gr1 gr1.sml sml 11659 149 219 IMAGE-THUMBNAIL 1-s2.0-S0030402611006218-gr2.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0030402611006218/gr2/THUMBNAIL/image/gif/fb3aaa5953b3677e407d4e44dc858241/gr2.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0030402611006218/gr2/THUMBNAIL/image/gif/fb3aaa5953b3677e407d4e44dc858241/gr2.sml gr2 gr2.sml sml 3961 115 219 IMAGE-THUMBNAIL 1-s2.0-S0030402611006218-gr3.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0030402611006218/gr3/THUMBNAIL/image/gif/81eb96602f3ff165dece72b494ad0f18/gr3.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0030402611006218/gr3/THUMBNAIL/image/gif/81eb96602f3ff165dece72b494ad0f18/gr3.sml gr3 gr3.sml sml 2052 101 219 IMAGE-THUMBNAIL 1-s2.0-S0030402611006218-gr4.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0030402611006218/gr4/THUMBNAIL/image/gif/e9dfb800de23dca1de6067bc53fadd39/gr4.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0030402611006218/gr4/THUMBNAIL/image/gif/e9dfb800de23dca1de6067bc53fadd39/gr4.sml gr4 gr4.sml sml 3476 164 210 IMAGE-THUMBNAIL 1-s2.0-S0030402611006218-gr5.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0030402611006218/gr5/THUMBNAIL/image/gif/95f930eb06d9a5991cee11945e3b1aff/gr5.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0030402611006218/gr5/THUMBNAIL/image/gif/95f930eb06d9a5991cee11945e3b1aff/gr5.sml gr5 gr5.sml sml 1738 164 203 IMAGE-THUMBNAIL 1-s2.0-S0030402611006218-gr6.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0030402611006218/gr6/THUMBNAIL/image/gif/521d403d69aee22acf97018586741a75/gr6.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0030402611006218/gr6/THUMBNAIL/image/gif/521d403d69aee22acf97018586741a75/gr6.sml gr6 gr6.sml sml 4750 158 219 IMAGE-THUMBNAIL 1-s2.0-S0030402611006218-gr1.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0030402611006218/gr1/DOWNSAMPLED/image/jpeg/1356c45235c8201b897a0a50259ddc2f/gr1.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0030402611006218/gr1/DOWNSAMPLED/image/jpeg/1356c45235c8201b897a0a50259ddc2f/gr1.jpg gr1 gr1.jpg jpg 37308 179 263 IMAGE-DOWNSAMPLED 1-s2.0-S0030402611006218-gr2.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0030402611006218/gr2/DOWNSAMPLED/image/jpeg/36215c8fb53edbfb07277ab5de999d85/gr2.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0030402611006218/gr2/DOWNSAMPLED/image/jpeg/36215c8fb53edbfb07277ab5de999d85/gr2.jpg gr2 gr2.jpg jpg 21872 138 263 IMAGE-DOWNSAMPLED 1-s2.0-S0030402611006218-gr3.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0030402611006218/gr3/DOWNSAMPLED/image/jpeg/9e91c1dd721007397314388760465c27/gr3.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0030402611006218/gr3/DOWNSAMPLED/image/jpeg/9e91c1dd721007397314388760465c27/gr3.jpg gr3 gr3.jpg jpg 10149 139 302 IMAGE-DOWNSAMPLED 1-s2.0-S0030402611006218-gr4.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0030402611006218/gr4/DOWNSAMPLED/image/jpeg/abec7bb15682deed8fc5ab4378b97822/gr4.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0030402611006218/gr4/DOWNSAMPLED/image/jpeg/abec7bb15682deed8fc5ab4378b97822/gr4.jpg gr4 gr4.jpg jpg 16177 234 301 IMAGE-DOWNSAMPLED 1-s2.0-S0030402611006218-gr5.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0030402611006218/gr5/DOWNSAMPLED/image/jpeg/1d4821f17cfdd432a563593edd3ebd1c/gr5.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0030402611006218/gr5/DOWNSAMPLED/image/jpeg/1d4821f17cfdd432a563593edd3ebd1c/gr5.jpg gr5 gr5.jpg jpg 10785 243 301 IMAGE-DOWNSAMPLED 1-s2.0-S0030402611006218-gr6.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0030402611006218/gr6/DOWNSAMPLED/image/jpeg/2e2dc706fa9802371d08405fe820dcad/gr6.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0030402611006218/gr6/DOWNSAMPLED/image/jpeg/2e2dc706fa9802371d08405fe820dcad/gr6.jpg gr6 gr6.jpg jpg 15924 217 301 IMAGE-DOWNSAMPLED IJLEO 51930 S0030-4026(11)00621-8 10.1016/j.ijleo.2011.11.008 Elsevier GmbH Fig. 1 SEM photograph of our black silicon sample in 45° view. Fig. 2 The schematic diagram of solar cell based on black silicon. Fig. 3 Schematic diagram for measurement of solar cells based on black silicon. Fig. 4 The I–V characteristic of our solar cell sample under illumination of He–Ne laser at 632.8nm. Fig. 5 I–V characteristic of solar cell sample without illumination. Fig. 6 Photoresponse of our black silicon solar cell in visible region. Photovoltaic properties of black silicon microstructured by femtosecond pulsed laser Xi Bao ⁎ Feng Liu Xiaoli Zhou Department of Physics, Fudan University, Shanghai 200433, China ⁎ Corresponding author. Tel.: +86 21 61444696; fax: +86 21 55665163. Prototype devices based on black silicon have been fabricated by microstructuring 250μm thick multicrystalline n doped silicon wafers using femtosecond pulsed laser in ambient gas of SF6 to measure its photovoltaic properties. The enhanced optical absorption of black silicon extends across the visible region and all the black silicons prepared in this work exhibit enhanced optical absorption close to 90% from 300nm to 800nm. The highest open-circuit voltage (V oc) and short-circuit current (I sc) under the illumination of He–Ne continuous laser at 632.8nm were measured to be 53.3mV and 0.11mA, respectively at a maximum power conversion efficiency of 1.44%. Upon excitation with He–Ne continuous laser at 632.8nm, external quantum efficiency (EQE) of black silicon as high as 112.9% has also been observed. Development of black silicon for photovoltaic purposes could open up a new perspective in achieving high efficient silicon-based solar cell by means of the enhanced optical absorption in the visible region. The current–voltage characteristic and photo responsivity of these prototype devices fabricated with microstructured silicon were also investigated. Keywords Photovoltaic properties Black silicon Femtosecond pulsed laser 1 Introduction Silicon is the most commonly used semiconductor in microelectronics and optoelectronic devices [1–4]. As is well recognized, there is certain reflectance on silicon wafer due to its polished surfaces. Various measures have been taken in past few decades to overcome the weak optical absorption [5–13]. Several scenarios have also been proposed in past decades to enhance the optical absorption [14,15]. In recent years, a microstructured silicon irradiated by femtosecond pulsed laser in ambient gas of SF6 has gained much attention due to its unique morphological [16], physical properties and possible applications in photodetectors and solar cells, which is so called black silicon for its strong optical absorption just like a black body and has been proposed as potential illuminated materials to enhance silicon-based solar cell response. The enhanced optical absorption of black silicon has been reported by Wu et al. that from roughly 60% to roughly 90% at shorter wavelengths (0.25–1.1μm) as well as from a few percent to roughly 90% in the near-infrared region (1.1–2.5μm) [17]. Microstructured avalanche photodiodes (APD) and photodiodes fabricated with microstructured silicon have also been reported [17,18], which showed a broad spectral response ranging from the visible to the near-infrared (400–1600nm) [18]. Quantum efficiency (QE) and current–voltage (I–V) characteristic of the prototype device based on silicon microstructured by femtosecond pulsed laser have been investigated here. Our results show that the external quantum efficiency (EQE) of this novel material at 632.8nm has achieved 112.9% upon excitation with photons provided by a He–Ne continuous laser. Other photovoltaic parameters such as open circuit voltage (V oc), fill factor (FF), efficiency (η), and short circuit current (I sc) have also been determined in this paper. 2 Experimental The laser used in our experiments is a commercially available titanium–sapphire laser (Tsunami, Spectra Physics), with a chirped pulse amplification system (Spitfire, Spectra Physics) pumped by the second harmonic of a Nd:YLF laser at a 1-kHz repetition rate (Evolution, Spectra Physics). The pulse duration is 125fs which is measured by Single Shot Autocorrelator (SSA), and the pulse energy is 300μJ/pulse. The system provides variable output energies up to 1mJ/pulse, which can be calculated from the average output power. A 281-mm-focal-length fused silica convex lens is used to focus the attenuated laser pulses onto the target, which is placed in a vacuum chamber. The chamber may be filled with desired ambient gases, i.e., SF6. The n-doped silicon (100) wafer (ρ =3–8Ωcm) is mounted on and translated with an X–Y stage, whose resolution is 3μm, so each subsequent laser pulse is incident onto a fresh spot. All the progress can be controlled through the computer. Microstructured silicon wafers were characterized by a scanning electron microscope (SEM, Hitachi H-4700) for morphology observations and the size measurements. SEM photograph of our sample in 45° view from the surface normal was shown in Fig. 1 , in which the sharp conical spikes were up to 20-μm tall, and taper to about 1-μm diameter at the tip. The spacing of the sharp conical spikes as well as the width near the base were both about 10μm. Areas up to 10mm×10mm were microstructured by scanning the laser beam across the sample; the laser parameters and scan speed determine the height of the spikes [19]. To eliminate defects in silicon lattice introduced by femtosecond pulsed laser microstructuring, the samples were thermally annealed in vacuum at 825K for 40min (YOKOGAWA-UP 150, produced by Lindberg Inc.). After then we thermally evaporate aluminum contacts (about 260nm thick) on both sides of the samples, a comb contact was deposited through a mask on the front side and a thin Al film on the back side. Each branch of the comb contact is 0.8mm wide and 9mm long. The stalk of the comb contact is 1.6mm wide and 10mm long. Fig. 2 shows the schematic diagram of our device, the active area of our device was about 40mm2. Four samples of solar cells have been fabricated by femtosecond pulsed laser in ambient gas of SF6, under the pressure of 75.8, 75.16, 72.2 and 70.8kPa, respectively. The photo response of our four samples of silicon solar cells were measured by using the 632.8nm line of a He–Ne continuous laser as excitation source. The continuous laser power was measured by a powermeter to be 1190μW and the transmission of our telescope was about 70%, which was used to extend the laser beam. Considering the optical absorption of 90% and the laser spot was a circle, as well as the area occupied by the comb contacts, the laser power incident upon samples was 191μW. Upon illuminated by the He–Ne laser, the output voltage through a variable series resistance was measured by an oscillator (Tektronix 3024). The schematic diagram was shown in Fig. 3 . In this experiment, for each series resistance value, we take down the voltage measured by the oscillator, and calculated the corresponding current value according to the Ohmic Law, thus obtain the I–V characteristic under illumination. The I–V curve of a typical sample was shown in Fig. 4 , which was microstructured in 75.8kPa SF6. From Fig. 4, we can see that the open circuit voltage of solar cell sample u oc was 53.3mV, the red curve in Fig. 4 was a fitting curve according to experimental data, and cross the Y axis at −0.11mA, i.e., the short circuit current i sc was about 0.11mA, as means that the external quantum efficiency (EQE) of sample was as high as 112.89%. (For interpretation of the references to color in this text, the reader is referred to the web version of the article.) From the fitting curve in Fig. 4, we can also conclude that the maximum output power of sample was 2.38μW, so the energy conversion efficiency was 1.44%, and the fill factor (FF) was 46.39%. The other three samples were also measured, the open circuit voltages were 49.5mV, 46.58mV, 37.22mV, and the external quantum efficiencies were 107.1%, 104.3% and 89.7%, respectively. In contrast, the I–V characteristic of a typical sample without illumination was also investigated, as shown in Fig. 5 . From Fig. 5, we can see that the reverse saturated current i so was about 16.348μA at room temperature, which is much larger than several nA of typical commercial silicon diode. We also measured the spectral responsivity of the device in ultraviolet and visible region, using light from a 300W Xenon arc lamp that is filtered through a monochromator with a spectral resolution of 0.1nm. We scanned the monochromator in 25nm increaments from 250 to 800nm, keeping the output power at each wavelength to 1μW. A neutral-density filter wheel and commercial photodiodes are used to set the output power at each wavelength. A femtoampere meter was used to measure the short-circuit current when samples were illuminated by the light from the monochromator. All the measurements are done at room temperature, and the results are shown in Fig. 6 . It shows that at wavelengths longer than 632.8nm, the photoresponse increases with the wavelength until 800nm. Higher external quantum efficiency (EQE) may be obtained in this region. In region of 250–400nm, the photoresponse decreases with wavelength, so higher external quantum efficiency (EQE) may be also expected. 3 Results and discussion An n +/n heterojunction has been created between the disordered surface layer and the undisturbed substrate due to the microstructuring by femtosecond pulsed laser in SF6. Hall measurements of black silicon surface layer has been carried out by Carey et al. [18], the result shows that this surface layer was n + doped with a higher electron concentration than the substrate, and an electron mobility on the order of 100cm2/Vs, thus an n +/n heterojunction was created between the disordered surface layer and the undisturbed substrate [18]. As was testified from Fig. 5, it shows that the reverse saturated current i so was about 16.348μA at room temperature, which is three magnitudes higher than typical commercial silicon diode. Even three times larger than 2CP10 silicon diode, whose reverse saturated current was 5μA at 25°C. This may be due to the electron concentration in substrate is too high, although it is lower than that of the disordered surface layer. Once electrons in substrate diffuse into the depletion layer, they are swept off by the Built-in field to the other side, thus results in large reverse saturated current. While electrons in n + (disordered surface layer) are scattered by impurity and defects in diffusion process, so their mobility is low, just 100cm2/Vs, only one tenth of electron mobility in crystalline silicon. What should be noted is that the external quantum efficiency (EQE) of black silicon is larger than 1, that is, the number of electrons in photo current is larger than the number of photons which were used as exciting source. The reasons have not yet to be fully understood. The external quantum efficiency (EQE) of unstructured silicon was no more than 40% [20]. As was known to all of us, any novel phenomenon should not violate the principle of energy conservation, a basic physical law. A possible mechanism may be due to the Auger effect of this novel material, in which silicon is doped with sulfur and fluorine, though there is no report about its Auger effect so far. Auger effect is the most important Coulombic process in semiconductors while the excess energy is transferred to another carrier as opposed to giving rise to luminescence. That is, it is a non-radiation process. As mentioned before, a high density of impurities has been incorporated into the lattice in the microstructuring process [17]. Sulfur impurities are likely to be particularly important; sulfur is known to introduce states into the band gap of silicon, both near the band edge and in the middle of the gap [17]. The extremely high concentration of sulfur impurities (∼1%) even forms a band of states [18]. Sulfur, with its two extra valence electrons, should produce a higher electron concentration in these impurity states. Once a 632.8nm photon incidents upon the black silicon surface layer, one bound electron in valence band is exited to conduction band, thus a hole appeared. One electron previously on a impurity energy state relaxes to valence band recombining with the photogenerated hole and releases additional energy. The released additional energy was transferred to another electron on the impurity energy state, which is called Auger electron. The latter is, in turn, promoted to conduction band, where it can be swept by the intrinsic electric field and contribute to the photocurrent. Thus, one photon excites two electrons, one photoexcited electron and one Auger electron. So Auger process plays an important role in producing a significant photocurrent, that is, a super high external quantum efficiency (EQE). Another possible mechanism may be the life time of photo generated electrons is much longer than the transition time they need, that is, the defects formed in femtosecond pulsed laser ablation are capture centers for positive holes in nature, thus when the electrons are collected by the anode of the solar cell, positive holes are still captured by defects and induce some electrons in PN junction, just as they flow out from the cathode again, as was equal to enlarge the number of electrons. Impurity photovoltaic effect (IPV) has been previously demonstrated to improve the efficiency of silicon solar cells [17,21]. But the energy conversion efficiency of our solar cell based on black silicon is not as high as its external quantum efficiency (EQE), as may be due to its large reverse saturated current i so. For photo current flow through the series resistance will invoke an output voltage, which is measured by oscillator. The output voltage will apply on the solar cell itself contrarily, which is called self-bias voltage and cause a diode current, whose direction is on the contrary to photo current and its value is proportion to reverse saturated current i so. So the total current in the circuit is diminished. In order to improve the output power of our solar cell, measures must be taken to minimize the reverse saturated current i so. The black silicon exhibits its enhanced optical absorption not only in visible region, but also in near infrared region. The strong broad band optical absorption of black silicon extends well into the infrared region, its absorptance is still about 90% around 1500nm and even more than 85% around 2500nm. More research work about black silicon solar cell should be carried out in near infrared spectrum in the future. 4 Conclusion In summary, we have observed the external quantum efficiency (EQE) of our novel solar cell based on black silicon illuminated by He–Ne continuous laser at 632.8nm was up to 112.9%, which has never been observed before. As make it possible to improve the efficiency of silicon-based solar cells and the sensitivity of silicon-based photo detectors. Its open circuit voltage u oc and short circuit current i sc were measured to be 53.3mV and 0.11mA, respectively. Its energy conversion efficiency and fill factor (FF) were also calculated. Other three samples were also measured, and the external quantum efficiencies were 107.1%, 104.3% and 89.7%, respectively. We present the possible mechanisms of this novel phenomenon, the Auger effect and the electronic response of black silicon in near infrared region should be investigated in the future. In order to optimize microstructured silicon solar cells, we are investigating further the dependence of external quantum efficiency (EQE) on surface morphology such as spike height and density. The I–V characteristics under illumination and without illumination were also investigated in this paper. Acknowledgements This work was supported by the National Hi-Tech Research and Development Program (863) of China under No. 2006AA03A176. We thank Professor Li Zhao for helpful discussions, and Jingyan Qiu for samples preparing. References [1] D.H. Auston Picosecond optoelectronic switching and gating in silicon Appl. Phys. Lett. 26 1975 101 103 [2] L. Tsybeskov Nanocrystalline silicon for optoelectronic applications MRS Bulletin 23 1998 33 38 [3] F. Wünsch G. Citarella M. Kunst Optoelectronic properties of microcrystalline silicon films Thin Solid Films 403 2002 526 529 [4] S. Reynolds R. Carius F. Finger V. Smirnov Correlation of structural and optoelectronic properties of thin film silicon prepared at the transition from microcrystalline to amorphous growth Thin Solid Films 517 2009 6392 6395 [5] E.S. Kolesar Jr. V.M. Bright D.M. Sowders Optical reflectance reduction of textured silicon surfaces coated with an antireflective thin film Thin Solid Films 290–291 1996 23 29 [6] N.A.G. Ahmed J.S. Colligon A.E. Hill Surface texturing of silicon by dynamic recoil mixing Thin Solid Films 117 1984 223 232 [7] M.J. Stocks A.J. Carr A.W. Blakers Texturing of polycrystalline silicon Sol. Energy Mater. Sol. Cells 40 1996 33 42 [8] S. Winderbaum O. Reinhold F. Yun Reactive ion etching (RIE) as a method for texturing polycrystalline silicon solar cells Sol. Energy Mater. Sol. Cells 46 1997 239 248 [9] E. Budianu M. Purica E. Manea E. Rusu R. Gavrila M. Danila Optical improved structure of polycrystalline silicon-based thin-film solar cell Sol. Energy Mater. Sol. Cells 72 2002 223 229 [10] H. Keppner J. Meier P. Torres D. Fischer A. Shah Microcrystalline silicon and micromorph tandem solar cells Appl. Phys. A 69 1999 169 177 [11] S. Koynov M.S. Brandt M. Stutzmann Black nonreflecting silicon surfaces for solar cells Appl. Phys. Lett. 88 2006 203107 [12] L.F. Sun J.Y. Tang A new texturing technique of monocrystalline silicon surface with sodium hypochlorite Appl. Surf. Sci. 255 2009 9301 9304 [13] K.Q. Peng Y. Xu Y. Wu Y.J. Yan S.T. Lee J. Zhu Aligned single-crystalline Si nanowire arrays for photovoltaic applications Small 1 2005 1062 1067 [14] X.F. Liang X.Y. Huang Q.Y. Zhang Gd2(MoO4)3: Er nanophosphors for an enhancement of silicon solar-cell near-infrared response J. Fluoresc. 19 2009 285 289 [15] S. Parthiban V. Gokulakrishnan K. Ramamurthi E. Elangovan R. Martins High near-infrared transparent molybdenum-doped indium oxide thin films for nanocrystalline silicon solar cell applications Sol. Energy Mater. Sol. Cells 93 2009 92 97 [16] T.H. Her R.J. Finlay C. Wu S. Deliwala E. Mazur Microstructuring of silicon with femtosecond laser pulses Appl. Phys. Lett. 73 1998 1673 1675 [17] C. Wu C.H. Crouch L. Zhao J.E. Carey R. Younkin J.A. Levinson E. Mazur R.M. Farrell P. Gothoskar A. Karger Near-unity below-band-gap absorption by microstructured silicon Appl. Phys. Lett. 78 2001 1850 1852 [18] J.E. Carey C.H. Crouch S. Mengyan E. Mazur Visible and near-infrared responsivity of femtosecond-laser microstructured silicon photodiodes Opt. Lett. 30 2005 1773 1775 [19] T.H. Her R.J. Finlay C. Wu E. Mazur Femtosecond laser-induced formation of spikes on silicon Appl. Phys. A: Mater. Sci. Process. 70 2000 383 385 [20] K.R. McIntosh L. Gay J.N. Cotsell H. Katherine D.L. Bätzner B. Fabian B.S. Richards Increase in external quantum efficiency of encapsulated silicon solar cells from a luminescent down-shifting layer Prog. Photovolt.: Res. Appl. 17 2009 191 197 [21] M.J. Keevers M.A. Green Extended infrared response of silicon solar cells and the impurity photovoltaic effect Sol. Energy Mater. Sol. Cells 41/42 1996 195 204", "scopus-id": "84863624387", "coredata": {"eid": "1-s2.0-S0030402611006218", "dc:description": "Prototype devices based on black silicon have been fabricated by microstructuring 250μm thick multicrystalline n doped silicon wafers using femtosecond pulsed laser in ambient gas of SF6 to measure its photovoltaic properties. The enhanced optical absorption of black silicon extends across the visible region and all the black silicons prepared in this work exhibit enhanced optical absorption close to 90% from 300nm to 800nm. The highest open-circuit voltage (V oc) and short-circuit current (I sc) under the illumination of He–Ne continuous laser at 632.8nm were measured to be 53.3mV and 0.11mA, respectively at a maximum power conversion efficiency of 1.44%. Upon excitation with He–Ne continuous laser at 632.8nm, external quantum efficiency (EQE) of black silicon as high as 112.9% has also been observed. Development of black silicon for photovoltaic purposes could open up a new perspective in achieving high efficient silicon-based solar cell by means of the enhanced optical absorption in the visible region. The current–voltage characteristic and photo responsivity of these prototype devices fabricated with microstructured silicon were also investigated.", "openArchiveArticle": "false", "prism:coverDate": "2012-08-31", "openaccessUserLicense": null, "prism:aggregationType": "Journal", "prism:url": "https://api.elsevier.com/content/article/pii/S0030402611006218", "dc:creator": [{"@_fa": "true", "$": "Bao, Xi"}, {"@_fa": "true", "$": "Liu, Feng"}, {"@_fa": "true", "$": "Zhou, Xiaoli"}], "link": [{"@_fa": "true", "@rel": "self", "@href": "https://api.elsevier.com/content/article/pii/S0030402611006218"}, {"@_fa": "true", "@rel": "scidir", "@href": "https://www.sciencedirect.com/science/article/pii/S0030402611006218"}], "dc:format": "application/json", "openaccessType": null, "pii": "S0030-4026(11)00621-8", "prism:volume": "123", "prism:publisher": "Elsevier GmbH.", "dc:title": "Photovoltaic properties of black silicon microstructured by femtosecond pulsed laser", "prism:copyright": "Copyright © 2011 Elsevier GmbH. All rights reserved.", "openaccess": "0", "prism:issn": "00304026", "prism:issueIdentifier": "16", "dcterms:subject": [{"@_fa": "true", "$": "Photovoltaic properties"}, {"@_fa": "true", "$": "Black silicon"}, {"@_fa": "true", "$": "Femtosecond pulsed laser"}], "openaccessArticle": "false", "prism:publicationName": "Optik", "prism:number": "16", "openaccessSponsorType": null, "prism:pageRange": "1474-1477", "prism:endingPage": "1477", "pubType": "fla", "prism:coverDisplayDate": "August 2012", "prism:doi": "10.1016/j.ijleo.2011.11.008", "prism:startingPage": "1474", "dc:identifier": "doi:10.1016/j.ijleo.2011.11.008", "openaccessSponsorName": null}, "objects": {"object": [{"@category": "thumbnail", "@height": "149", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0030402611006218-gr1.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "11659", "@ref": "gr1", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "115", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0030402611006218-gr2.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "3961", "@ref": "gr2", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "101", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0030402611006218-gr3.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "2052", "@ref": "gr3", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "164", "@width": "210", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0030402611006218-gr4.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "3476", "@ref": "gr4", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "164", "@width": "203", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0030402611006218-gr5.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "1738", "@ref": "gr5", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "158", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0030402611006218-gr6.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "4750", "@ref": "gr6", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "179", "@width": "263", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0030402611006218-gr1.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "37308", "@ref": "gr1", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "138", "@width": "263", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0030402611006218-gr2.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "21872", "@ref": "gr2", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "139", "@width": "302", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0030402611006218-gr3.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "10149", "@ref": "gr3", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "234", "@width": "301", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0030402611006218-gr4.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "16177", "@ref": "gr4", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "243", "@width": "301", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0030402611006218-gr5.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "10785", "@ref": "gr5", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "217", "@width": "301", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0030402611006218-gr6.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "15924", "@ref": "gr6", "@mimetype": "image/jpeg"}]}, "link": {"@rel": "abstract", "@href": "https://api.elsevier.com/content/abstract/scopus_id/84863624387"}}