{"scopus-eid": "2-s2.0-85061189312", "originalText": "serial JL 271533 291210 291719 291720 291790 291893 291940 31 Applied Surface Science APPLIEDSURFACESCIENCE 2019-02-02 2019-02-02 2019-02-08 2019-02-08 2019-03-14T12:43:30 1-s2.0-S0169433219303332 S0169-4332(19)30333-2 S0169433219303332 10.1016/j.apsusc.2019.02.001 S300 S300.1 FULL-TEXT 1-s2.0-S0169433219X00045 2019-03-14T14:26:17.721067Z 0 0 20190601 2019 2019-02-02T01:39:53.117004Z articleinfo articletitlenorm authfirstinitialnorm authfirstsurnamenorm cid cids contenttype copyright crossmark dateloaded dateloadedtxt datesearch datesort dateupdated dco docsubtype doctype doi eid ewtransactionid hubeid indexeddate issn issnnorm itemstage itemtransactionid itemweight openaccess openarchive pg pgfirst pglast pii piinorm pubdatestart pubdatetxt pubyr sectiontitle sortorder srctitle srctitlenorm srctype ssids alllist content subj subheadings suppl tomb volfirst volissue volumelist webpdf webpdfpagecount yearnav figure table e-component body mmlmath acknowledge affil appendices articletitle auth authfirstini authfull authlast grantnumber grantsponsor grantsponsorid highlightsabst orcid primabst pubtype ref 0169-4332 01694332 true 478 478 C Volume 478 70 725 732 725 732 20190601 1 June 2019 2019-06-01 2019 Full Length Article article fla © 2019 Elsevier B.V. All rights reserved. 1878HIERARCHICALBLACKSILICONSOLARCELLSACHIEVEDBALANCELIGHTTRAPPINGINTERFACIALCONTACT PUTRA I 1 Introduction 2 Experimental details 3 Results and discussion 4 Conclusions Acknowledgment Appendix A Supplementary data References SAGA 2010 96 T GREEN 2003 181 192 M YOON 2010 329 J TYAGI 2013 443 461 V GARNETT 2010 1082 1087 E PAPET 2006 2319 2328 P KIM 2011 5242 5248 J OSMINKINA 2012 524 L JEONG 2012 2971 2976 S SINGH 2015 6631 6641 P MATSUO 1983 L210 S SOKMEN 2009 105005 U CLARK 2009 423 428 I CHEN 2015 1216 1223 C ZUBEL 2001 138 147 I ZHAO 2014 Z LIU 2013 165 167 J DIMITROV 2013 1 4 D CHEN 2010 094318 C CHEN 2017 11786 11792 C KULAKCI 2013 548 553 M FAN 2017 35998 36008 Z DO 2013 092301 K PENG 2006 387 394 K MITSUGI 2004 G302-G6 N LI 2017 17177 J HUANG 2011 285 308 Z SONG 2005 C148-C50 Y CASSIE 1944 546 551 A LI 2009 7147 7152 X CHEN 2017 C PENG 2005 1062 1067 K STAVENGA 2006 661 667 D IMAMURA 2017 358 366 K PYSCH 2007 1698 1706 D PUTRAX2019X725 PUTRAX2019X725X732 PUTRAX2019X725XI PUTRAX2019X725X732XI 2021-02-08T00:00:00.000Z 2021-02-08T00:00:00.000Z http://creativecommons.org/licenses/by-nc-nd/4.0/ © 2019 Elsevier B.V. All rights reserved. item S0169-4332(19)30333-2 S0169433219303332 1-s2.0-S0169433219303332 10.1016/j.apsusc.2019.02.001 271533 2019-03-14T14:26:17.721067Z 2019-06-01 1-s2.0-S0169433219303332-main.pdf https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433219303332/MAIN/application/pdf/232f9f34dceb21a1c8ed454e1508973b/main.pdf main.pdf pdf true 2507728 MAIN 8 1-s2.0-S0169433219303332-main_1.png https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433219303332/PREVIEW/image/png/694ed3c33681ff1ad9b6f11bfcc86552/main_1.png main_1.png png 57260 849 656 IMAGE-WEB-PDF 1 1-s2.0-S0169433219303332-gr1.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433219303332/gr1/THUMBNAIL/image/gif/285d5c284a29104d3d78099de2d67de0/gr1.sml gr1 gr1.sml sml 9002 125 219 IMAGE-THUMBNAIL 1-s2.0-S0169433219303332-gr2.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433219303332/gr2/THUMBNAIL/image/gif/c73d818ba613f9f2a844437f7408f345/gr2.sml gr2 gr2.sml sml 15498 149 219 IMAGE-THUMBNAIL 1-s2.0-S0169433219303332-gr3.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433219303332/gr3/THUMBNAIL/image/gif/85bb74a9f31ad885c1c3e538f02f3813/gr3.sml gr3 gr3.sml sml 5220 89 219 IMAGE-THUMBNAIL 1-s2.0-S0169433219303332-gr4.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433219303332/gr4/THUMBNAIL/image/gif/00e8f7b39d4c188f149c7395ec8fece4/gr4.sml gr4 gr4.sml sml 11989 77 219 IMAGE-THUMBNAIL 1-s2.0-S0169433219303332-gr5.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433219303332/gr5/THUMBNAIL/image/gif/24042442608eabd8da617941ab34adeb/gr5.sml gr5 gr5.sml sml 12648 164 189 IMAGE-THUMBNAIL 1-s2.0-S0169433219303332-gr6.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433219303332/gr6/THUMBNAIL/image/gif/686db6859a215a7ce29fdf3ab1985e52/gr6.sml gr6 gr6.sml sml 6908 164 205 IMAGE-THUMBNAIL 1-s2.0-S0169433219303332-gr7.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433219303332/gr7/THUMBNAIL/image/gif/03c85996eb9ee4b09d38327421b3e594/gr7.sml gr7 gr7.sml sml 14784 90 219 IMAGE-THUMBNAIL 1-s2.0-S0169433219303332-gr1.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433219303332/gr1/DOWNSAMPLED/image/jpeg/4c4735208a744ef777c77e62398178db/gr1.jpg gr1 gr1.jpg jpg 94265 460 803 IMAGE-DOWNSAMPLED 1-s2.0-S0169433219303332-gr2.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433219303332/gr2/DOWNSAMPLED/image/jpeg/fd1a09f5409031396d6785e91244d182/gr2.jpg gr2 gr2.jpg jpg 112214 546 803 IMAGE-DOWNSAMPLED 1-s2.0-S0169433219303332-gr3.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433219303332/gr3/DOWNSAMPLED/image/jpeg/dbf4fdac456d9124f560ae8aacbdf19c/gr3.jpg gr3 gr3.jpg jpg 59238 328 803 IMAGE-DOWNSAMPLED 1-s2.0-S0169433219303332-gr4.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433219303332/gr4/DOWNSAMPLED/image/jpeg/4c2911c500c543152749cbad8897bc12/gr4.jpg gr4 gr4.jpg jpg 42050 252 714 IMAGE-DOWNSAMPLED 1-s2.0-S0169433219303332-gr5.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433219303332/gr5/DOWNSAMPLED/image/jpeg/4925d5c2f227037fab5516e6458da9df/gr5.jpg gr5 gr5.jpg jpg 201717 696 803 IMAGE-DOWNSAMPLED 1-s2.0-S0169433219303332-gr6.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433219303332/gr6/DOWNSAMPLED/image/jpeg/aefd69015ba2ca2028293f91b425ed38/gr6.jpg gr6 gr6.jpg jpg 32750 304 380 IMAGE-DOWNSAMPLED 1-s2.0-S0169433219303332-gr7.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433219303332/gr7/DOWNSAMPLED/image/jpeg/cb269a53cc8dd1f053136f1562022e60/gr7.jpg gr7 gr7.jpg jpg 79652 256 625 IMAGE-DOWNSAMPLED 1-s2.0-S0169433219303332-gr1_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433219303332/gr1/HIGHRES/image/jpeg/d4ed59f4125e590648ec9da7241195a7/gr1_lrg.jpg gr1 gr1_lrg.jpg jpg 404556 1221 2132 IMAGE-HIGH-RES 1-s2.0-S0169433219303332-gr2_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433219303332/gr2/HIGHRES/image/jpeg/5f02d2bfb0de2c8ff3270b58429208e4/gr2_lrg.jpg gr2 gr2_lrg.jpg jpg 416877 1450 2132 IMAGE-HIGH-RES 1-s2.0-S0169433219303332-gr3_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433219303332/gr3/HIGHRES/image/jpeg/b3e77c1b0aeff9d2e5102187f0986b13/gr3_lrg.jpg gr3 gr3_lrg.jpg jpg 203799 871 2132 IMAGE-HIGH-RES 1-s2.0-S0169433219303332-gr4_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433219303332/gr4/HIGHRES/image/jpeg/18380fa690aa62145ef8f500e6639cde/gr4_lrg.jpg gr4 gr4_lrg.jpg jpg 193199 669 1896 IMAGE-HIGH-RES 1-s2.0-S0169433219303332-gr5_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433219303332/gr5/HIGHRES/image/jpeg/d7cfbd969c80b4cd6bbaa9f0a52f905f/gr5_lrg.jpg gr5 gr5_lrg.jpg jpg 762816 1849 2132 IMAGE-HIGH-RES 1-s2.0-S0169433219303332-gr6_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433219303332/gr6/HIGHRES/image/jpeg/5c15154de6d71f44ded5ea24de64d0cc/gr6_lrg.jpg gr6 gr6_lrg.jpg jpg 127961 808 1010 IMAGE-HIGH-RES 1-s2.0-S0169433219303332-gr7_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433219303332/gr7/HIGHRES/image/jpeg/3dc705f1d9e7e57642838bac9e3cde01/gr7_lrg.jpg gr7 gr7_lrg.jpg jpg 344257 679 1660 IMAGE-HIGH-RES 1-s2.0-S0169433219303332-mmc1.docx https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433219303332/mmc1/MAIN/application/vnd.openxmlformats-officedocument.wordprocessingml.document/ce23bb689700554aa890e9d9e73bbd8f/mmc1.docx mmc1 mmc1.docx docx 50396 APPLICATION 1-s2.0-S0169433219303332-si1.gif https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433219303332/STRIPIN/image/gif/04134d8cb2e4702d0ec7d684cc8f264c/si1.gif si1 si1.gif gif 1012 19 214 ALTIMG 1-s2.0-S0169433219303332-si2.gif https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433219303332/STRIPIN/image/gif/9f26721eff596a6fb0de47a3ebb03561/si2.gif si2 si2.gif gif 529 21 101 ALTIMG 1-s2.0-S0169433219303332-si3.gif https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433219303332/STRIPIN/image/gif/f43e11ffd2947c6e02aec28e197a05d6/si3.gif si3 si3.gif gif 866 22 191 ALTIMG 1-s2.0-S0169433219303332-si4.gif https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433219303332/STRIPIN/image/gif/14b6e63302785f3845d66ba02d1ab33f/si4.gif si4 si4.gif gif 981 22 200 ALTIMG 1-s2.0-S0169433219303332-si5.gif https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433219303332/STRIPIN/image/gif/ef5082b67432ca54c5ab029a911132b4/si5.gif si5 si5.gif gif 847 17 181 ALTIMG 1-s2.0-S0169433219303332-si6.gif https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0169433219303332/STRIPIN/image/gif/b4b8086ac7ec1853e0c88162574a265f/si6.gif si6 si6.gif gif 2765 43 575 ALTIMG 1-s2.0-S0169433219303332-am.pdf https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/egi:10MWLXGXN9V/MAIN/application/pdf/c862e54ea63b01a280771c66f00cca50/am.pdf https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/egi:10MWLXGXN9V/MAIN/application/pdf/c862e54ea63b01a280771c66f00cca50/am.pdf am am.pdf pdf false 926116 AAM-PDF APSUSC 41696 S0169-4332(19)30333-2 10.1016/j.apsusc.2019.02.001 Elsevier B.V. Fig. 1 (a) Schematic illustrations for the formation of hierarchical textures performed by two sequential etching processes. (b) Plot of dissolution current density versus the applied potential with different aqueous electrolytes. (c) Phenomenological illustrations of three series resistances of Rm (mass resistance), Rd (dissolution resistance), and Rec (electrochemical resistance) that kinetically determined the etching characteristics on pyramidal structures. Fig. 1 Fig. 2 (a) Dependence of nanopore length on the involved etching time. The scale bar of the inserted figure is 200 nm. (b) Contact-angle measured results of the hierarchical structures under the etching durations from 0 to 24 min. AFM images of (c) sole pyramidal structures, hierarchical structures made by performing Ag-assisted chemical etching for (d) 4 min and (e) 16 min. Fig. 2 Fig. 3 (a) PL results of the hierarchical structures and (b) related center intensity of PL peaks with respect to the etching time, respectively. Fig. 3 Fig. 4 Photographs of textures with performing Ag-assisted chemical etching for (a) 0 min (b) 8 min and (c)16 min. The inserted figures present the cross-sectional SEM images of corresponded morphologies with the scale bar of 200 nm, respectively. Fig. 4 Fig. 5 Measured reflection spectra of various hierarchical structures. Simulated reflection spectra of sole pyramidal and hierarchical structures illuminated under (b) normal incidence and (c) two different angles of light incidence. (d) Comparisons of average reflectivity at 600 nm of sole pyramidal and hierarchical structures under varied illumination angles. Fig. 5 Fig. 6 Photovoltaic J-V curve of solar cells prepared with different texturization processes. Fig. 6 Fig. 7 Side-view SEM images of Ag grids in contact with underlying hierarchical textures prepared with (a) 8-min and (b) 16-min of catalytic etching for nanopore formation. Fig. 7 Table 1 Photovoltaic performance of fabricated solar cells texturized with different durations of nanopore formation. The micro-pyramid based solar cells was compared as the reference. Table 1 Cell type Jsc (mA/cm2) Voc (V) FF (%) Efficiency (%) Rs (Ω) Rsh (Ω) Pyramid only 37.0 0.626 78.51 18.18 0.0014 10.5 4 min 37.3 0.631 78.48 18.47 0.0016 10.5 8 min 37.7 0.634 78.59 18.78 0.0017 12.7 16 min 36.3 0.622 78.45 17.71 0.0022 11.2 24 min 34.6 0.621 75.10 16.14 0.0038 10.4 Full length article 18.78% hierarchical black silicon solar cells achieved with the balance of light-trapping and interfacial contact Ilham Ramadhan Putra a Jheng-Yi Li a Chia-Yun Chen a b ⁎ a Department of Materials Science and Engineering, National Cheng Kung University, Tainan 70101, Taiwan Department of Materials Science and Engineering National Cheng Kung University Tainan 70101 Taiwan b Hierarchical Green-Energy Materials (Hi-GEM) Research Center, National Cheng Kung University, Tainan 70101, Taiwan Hierarchical Green-Energy Materials (Hi-GEM) Research Center National Cheng Kung University Tainan 70101 Taiwan ⁎ Corresponding author at: Department of Materials Science and Engineering, National Cheng Kung University, Tainan 70101, Taiwan. Department of Materials Science and Engineering National Cheng Kung University Tainan 70101 Taiwan 18.78% efficiency of crystalline silicon (Si) solar cells was achieved through introducing the combined nanopore/pyramid textures. These hierarchical structures possessed the ultra-low reflectivity with values <6% under the various illumination angles from 0 to 60°, evidencing their remarkable omnidirectional light-trapping capability. Although the greatly improved light-trapping effect of the hierarchical structures was demonstrated, we found that the increased formation durations of Si nanopores led the substantial increase of photoluminescent characteristics that could limit the efficient separation of photogenerated carriers through charge recombination. Moreover, the positive correlation in surface roughness of nanopore arrays with respect to the elongated etching durations was evidenced, and these issues could increase the series resistance of solar cells owing to poor interfacial contact between nanopores and front electrodes. Thus, there existed the optimal combination between two-scale textures critically for both photonic and electrical management of cell design. By optimizing the etching durations for the controlled nanopore formation, the improved light-trapping characteristics and fairly unchanged contact resistance with front electrode was achieved, possessing the improved conversion efficiency with >0.58% of increased value beyond the typical microtexture-based solar cells. 1 Introduction Crystalline silicon (Si) based solar cells have promised the effective energy supply for power needs that allowed converting the sunlight into electricity and led the solar-cell market over 85% in the world [1]. Moreover, the feasibility of obtaining Si as the raw material became an advantage compared with other types of solar cells such as Cadmium Telluride (CdTe) and Gallium Arsenide (GaAs) [2–4]. Recently, the introduction of Si nanostructures has attracted the worldwide attention due to the capability for meeting the criteria of improving cell performance with the needs of using fewer amounts of materials [5]. Among various nanostructure-involved synthetic techniques employed for the realization of higher-performance solar cells, surface texturing was considered a promising technique that enabled to dramatically solve the intrinsic limitations of Si with poor absorption characteristics of sunlight. Conventionally, the creation of pyramidal textures in micro-scale that was prepared on Si surfaces using basic etching in aqueous system, whose light-reflectivity could not merely be reduced particularly in the wavelength range of 600 nm–1000 nm, but further possessed the benefit of the light absorptance under large angles of light irradiation [6]. In addition, the introduction of nanotextures, such as nanocones, nanowires and nanotubes, could substantially diminish the light reflectivity at short wavelength covering 200–600 nm [7–9]. Indeed, the combination of the nano/micro textures became one of the promising architectural ways for the large-area photovoltaic applications, due to its ability to efficiently trap lights with broadband wavelength ranges [10]. To prepare such hierarchical textures on Si surfaces, two dominant etching strategies were performed including dry and wet etching. Dry-etching techniques, such as electron cyclotron resonance plasma (ECRP) etching and reactive ion etching (RIE), essentially required the utilization of high-energy ions or plasmas for selectively create the desired surface topography of Si [11,12]. By comparison, wet-chemical methods, related to chemical or electrochemical routes, possessed a superiority compared with the dry-etching techniques in some sectors such as facile and inexpensive procedures, high throughput for larger-area fabrication and elimination of vacuum requirement [13–15]. Based on these techniques, the highly light-absorptive textures could be created directly on the cell surfaces, but the resulting cell efficiency did not always increase accordingly. These could be attributed to the involvement of serve charge recombination occurred at surfaces of the synthesized nanostructures. Also, the poor electric contact was usually encountered between the light-absorptive textures and the metal electrode, thus introducing a great resistive loss that degraded the cell efficiency. These account for the results of cell efficiency <18% while introducing hierarchical textures on practical applications of solar cells [16–19]. Therefore, in this study, a convincing room-temperature etching process, termed as silver (Ag) assisted chemical etching, was applied for the controlled formation of regular nanopores arrays directly on the pyramidal microtextures. Both surface roughness and luminescent behaviors of involved hierarchical textures were examined and the correlation of these characteristics with etching durations were revealed. Taking together with the measured reflection spectra along with simulated investigations of their light-trapping effects under various angles of incidence, the improved efficiency of solar cells with standard areas of 5-in. by 5-in. was identified, showing the conversion efficiency of 18.78%, with >0.6% of efficiency enhancement beyond the typical microtexture-based solar cells. 2 Experimental details 5-inch by 5-inch, (100)-oriented single-crystalline and p-type (1–3 Ω cm) Si substrates were used in the study. Prior to etching process, the Si wafers were cleaned thoroughly with acetone, ethanol, and deionized water several times. Subsequently, the as-cleaned Si substrates were dipped in the alkaline etching solutions containing potassium hydroxide (3 wt%) with isopropyl alcohol (IPA, 20 vol%) as surfactants at 80 °C for 30 min in order to form the pyramidal structures on Si surfaces. Ag-assisted chemical etching, prepared with the mixed solutions containing 0.02 M of AgNO3 and 4.8 M of HF at room temperature, was then used for the preparation of nanopores directed on the micro-pyramid textures [20–23]. For electrochemical analysis, the bare Si substrates were immersed in the solutions of sole HF and AgNO3/HF, respectively, under the applied polarization potentials in the range of −0.2 V to 3 V. In addition, for the cell construction, the standard n+-doped emitter layers were created on either sole microtextures or combined nano/micro textures using phosphorus diffusion with POCl3 gas as the source. After removing the residual phosphosilicate glass with diluted HF treatment, the thin Si3N4 layers were then deposited with a plasma-enhanced chemical vapor deposition (PECVD) method. The front and rear electrodes were made with Ag grids and aluminium (Al) pastes via a screen printing and followed by firing treatment at 850 °C. Morphologies of as-prepared hierarchical structures were characterized with a field emission scanning electron microscopy (SEM, LEO 1530). Photoluminescent (PL) results were analyzed using a light source of light-emitting diode (LED) lamp with the wavelength of 365 nm and the measurements were conducted at room temperature. Reflectivity measurements were performed using an ultraviolet-visible spectrophotometer (U-3010, Hitachi) equipped with an integrating sphere covering the wavelength regions from 300 nm to 900 nm. Photovoltaic performances were measured with J-V measurement system under the illumination of standard AM 1.5 G solar simulator. 3 Results and discussion Fig. 1 (a) presented the schematic illustrations for the formation of Si hierarchical structures. The first step of fabrication was to create the microscale pyramidal structures using conventional alkaline etching, respectively. The formed pyramids could uniformly cover on the Si surfaces with various heights ranging from 0.5 μm to 8 μm, and then were sequentially treated with Ag-assisted chemical etching in order to create the well-regulated Si nanopores. In view of the electrochemical processes that occurred in the etching reaction with the assistance of Ag catalysts, the kinetics of redox reactions of AgNO3/HF and Si substrates were observed through the examinations of involved current density with respect to the applied polarization potentials, as presented in Fig. 1(b). It could be found that the current density accompanied with the dissolution of Si appeared a dip at the monitored potential in the presence of AgNO3 and HF mixed electrolytes, which represented the equilibrium current density of Si dissolution contributed from the anodic and cathodic branches of electrochemical balance. This dissolution current density (3.9 × 10−7 A cm−2) is almost four orders of magnitude larger than the case of etching under sole HF electrolytes (2.5 × 10−11 A cm−2). It should be noted while the etching process was involved with a local electrochemical reaction, but the numerous Ag nanoparticles simultaneously initiated the etching reactions which could be viewed as the collective electrochemical dissolution of Si with a presented dissolution current density. Thus, these measured features indicated that the presence of Ag ions could accelerate the oxidation reaction of Si on pyramidal textures. To further understand the etching kinetics, the cathodic current density correlated with the oxidation reactions was considered according to the following equation [24,25]. (1) J c = − zeKnC Ag + exp − E a / K B T where Jc represented the cathodic current density, z the number of electrons involved in Si dissolution, e the electron charge, K the rate constant, n is the electron density, CAg+ the AgNO3 concentration, Ea the activation energy for the cathodic reaction, KB the constant of Boltzmann, and T the absolute temperature. Accordingly, it was clear that the role of Ag+ ions was to facilitate the oxidation of Si by supplying holes through the reduction reaction, which accounted for the dramatic increase of cathodic current density in the presence of AgNO3 species, as presented in Eq. (1). Taking together, the overall electrochemical reactions with cathodic and anodic branches that occurred in these mixed solutions are presented as below [26–28], Cathodic reaction: (2) Ag + + e − ➔ Ag Anodic reaction: (3) Si + H 2 O ➔ SiO 2 + 4H + + 4e − (4) SiO 2 + 6 HF ➔ H 2 SiF 6 + 2H 2 O AgNO3 reactants acted as dual roles in the electrochemical reaction. The electroless galvanic reaction was firstly taken place between Ag+ ions and exposed Si in contact with aqueous electrolytes, causing the formation of dense Ag nanoparticles covering throughout the Si surfaces which was responsible for succeeding catalytic etching. Subsequently, the reduction of newly-arrived AgNO3 was preferentially occurred at these primary Ag catalysts rather than the exposed Si surfaces, which continuously supplied the holes and then injected into Si substrates beneath those Ag catalysts. With the removal of Si oxide in the presence of HF etchants, the etching pits were created and gradually form one-dimensional pores as long as the cycling reactions of Si oxidation/dissolution could be stably maintained. In kinetic aspect, the concentration of AgNO3 not merely affected the nucleation density of primary Ag nanoparticles, but further majorly determined the cathodic current density of involving catalytic etching, where the latter was quantitatively described as the term of C Ag+ in Eq. (1). In line with that, a phenomenological kinetic model for the formation of etched Si nanopores was presented in Fig. 1(c), indicating that the involved current density of electrochemical reactions was kinetically influenced by three series resistances of Rm (mass resistance), RD (dissolution resistance), and REC (electrochemical resistance). Among them, the issue of mass transfer of electrolytes was minimized with the employment of continuous stirring during the whole etching process. Also, RD was expected to be relatively small because of rapid process of oxide dissolution in the presence of HF etchants. Thus, the eventual etching rates were mainly controlled with the resistance of electrochemical process, which behaved as the rate-determining step for the formation of Si nanopores on micro-texture surfaces. Fig. 2 presented the correlation of nanopore length with the etching time. It could be clearly found that the lengths of etched nanopores did not always increase linearly with reaction time. Instead, the length evolution could be divided into two stages. In Stage I, the initial formation of Si nanopores was subjected to the nucleation of primary Ag nanoparticles on the texturized surfaces of pyramidal structures. The relative rough Si surfaces might impede the effective transport of holes injected into Si that induced the electroless deposition of Ag. Insufficient hole injections upon the initial stage of catalyst formation led the overall etching to be comparably slow, reflecting the nearly identical nanopore length regardless of the reaction time. In stage II, with longer durations the texturized surfaces were fully covered with primary Ag nanoparticles, and thereby the directional etching on Si dominated the reaction behaviors, which resulted in the constant etching rate within the etching durations from 4 min to 24 min. To gain insight into the surface features of etched pores, surface wettability was examined under various etching durations, as shown in Fig. 2(b), the contact angles of the nano/micro textures were increased in line with the etching time. The measured contact angle of the pyramidal micro-textures silicon was 110°. On the other hand, the contact angle values of textured combinations were increased from 125° to 133° under the etching durations from 4 to 24 min, respectively. It indicated that the consequences of such catalytic etching produced the combined textures with different roughened states. These features could be understood with Cassie-Baxter equation [29,30], (5) cos θ CB = r R fcosθ – r R 1 − f where θCB and θR represented the contact angle of the texturized structures and polished Si surfaces, respectively, rR the roughness of the wetted area, and f the area fraction of solid-liquid interfaces. Accordingly, a rise of wetting angle was essentially related to the increased roughness of Si surfaces. In this regard, the combination nano/micro structures with longer etching time produced more rough surfaces, reflecting the increase of contact angles. To further strengthen these findings, AFM measurements were performed and the results were presented in Fig. 2(c)–(e). The results demonstrated the trend of surface roughness in terms of root mean square deviation corresponded with the findings from the measured wetting results, where the value of roughness increased from 560 nm (pyramidal textures), 579 nm (pyramidal textures with 4-min etching) and 635 nm (pyramidal textures with 16-min etching). In addition, the PL spectra were examined, as shown in Fig. 3(a). The broad PL peaks located at the wavelength range from 480 to 680 nm could be found from all the combined textures made with various etching durations. It has been reported that the etched Si nanostructures possessed the rough sidewalls while experiencing the catalytic etching assisted with Ag catalysts, which allowed the light emission through the recombination of photogenerated electrons and holes dominantly at rough Si surfaces due to the oxygen related dangling bond density [31,32]. Such features became more obvious once the number of illuminated Si nanopores that effectively introduced the charge recombination was increased. This accounted for the increased trend of PL emission in terms of their peak intensity under the light illuminations centered at 365 nm, as evidenced in Fig. 3(b). With longer etching durations over 16 min, the resulting peak intensity of PL spectrum dramatically increased to the value approximately 1.9 times higher than that of planar Si, which suggested the fact that the involved rough sidewall areas intended to limit the efficient separation of photogenerated carriers through a process of charge recombination. On the other hand, the introduction of regular Si nanopores with etching duration <8 min resulted in the slight increase of PL intensity, showing the spectrally similar PL result with the case of 4-min etching and only around 1.2 times higher than the case of unetched Si. These results suggested that the length of nanopore arrays acted a critical role affecting the surface recombination of carriers. Our established hierarchical textures were practically applied for the fabrication of 5-inch solar cells, and the correlations of fabricated cells with respect to their fine morphologies were further examined, as presented in Fig. 4 . Without the introduction of regular nanopores, the grey surfaces could be observed due to the sole contribution from pyramidal microtextures, as shown in Fig. 4(a). On the other hand, the hierarchical textures, experienced with different durations (8 min in Fig. 4(b) and 16 min in Fig. 4(c)) of nanopore formation demonstrated the black features, representing the distinct light reflectivity due to the substantial enhancement of light absorption from the cell surfaces. The correlated spectral reflectivity was demonstrated in Fig. 5(a), respectively. The results indicated that dramatic reduction of light reflectivity was encountered; whose average spectral values were 23% (sole pyramidal textures), 13%, 6%, 3% and 4% from hierarchical textures involved with 4, 8, 16 and 24 min of catalytic etching, respectively. The explicit dependence of reduced light reflectivity covering the entire measured spectra on the etching durations could be observed, indicating that the longer nanopores introduced in the hierarchical architectures led to the enhanced light-trapping effect, and thereby facilitated the increased probability of light-to-carrier conversion through collecting more photons into Si. These results were further confirmed by performing the Finite Difference Time Domain (FDTD) analysis under the normal incidence of lights relative to the substrate planes, as demonstrated in Fig. 5(b), where the numerical investigations from both pyramidal structures and combined nanopore/pyramid structures corresponded well with the experimental measurements. In addition, the spectral reflectivity under various angles of incidence (AOI) was considered to be another important issue for evaluating their light-trapping effects. The simulated results were recorded and compared in Fig. 5(c), indicating that the remarkable improvement of reduced reflectivity could be achieved using hierarchical nanopore/pyramid textures at both incident angles of 300 and 450. To explore the universal trends of improved light-trapping effect with respect to the illumination angles, the incident angles were varied within the range of 00 (normal incidence) and 600, and the corresponding light reflectivity at 600 nm of pyramidal and hierarchical structures was compared. As could be observed in Fig. 5(d), the resulting reflectivity of hierarchical structures remained <6% under the various illumination angles from 00 to 600, evidencing their remarkable omnidirectional light-trapping capability beyond the sole pyramidal textures with reflectivity even higher than 21% at incident angle of 600. The contributions of introducing Si nanopores toward the relatively suppressed reflectivity could be understood by the gradual change of refraction-index profiles established by such two-scale Si structures, as illustrated in the inserted figure of Fig. 5(d). The subwavelength feature of the well-aligned Si nanopores essentially possessed the effective refraction index in between surrounding air and Si pyramids based on the effective medium theory [33], thus enabling to reduce the possible light reflection occurred at interfaces of micropyramids/nanopores. Solar cells with fixed area of 5-inch by 5-inch were fabricated, and the comparative photovoltaic J-V curves were presented in Fig. 6 . The results clearly revealed that the introduction of two-scale hierarchical textures could not guarantee the improved conversion efficiency beyond the single-scale microtextures. Instead, with the optimal etching duration (8 min) for nanopore formation, the resulting efficiency of hierarchical textures could reach 18.78%, which was >0.6% of increased value over the typical microtexture-based solar cells with efficiency of 18.18%. In addition, the detailed photovoltaic parameters of fabricated solar cells were summarized in Table 1 . Considering the pyramid-based solar cells as a reference, it could be concluded that the dramatic enhancement of short-circuit current density (Jsc) appeared in hierarchical-texture based solar cells made with 8-min etching. Such improved feature could be attributed to the increased light-trapping effect from the two-scale architectures that allowed the broadband absorption of illuminated lights. Nevertheless, the increase of nanopore length via raising the etching durations also resulted in the appearance of more defective sites that might behave as the recombination centers of photogenerated carriers. These trends in terms of resulting Jsc could also be qualitatively understood from the PL investigations [Fig. 3(a) and (b)], where the elongated nanopore formation over 16 min could significantly limit the cell efficiency through the decrease of the minority carrier lifetime, which minimized the positive effect to light absorption and in term suppressed the effective sustainability of carriers prior to experiencing recombination routes. This also implied that the surface passivation of nanostructure surfaces was required for boosting their conversion efficiency [34]. More importantly, there existed the competition phenomena between the light-trapping effect and the involved series resistance of cells responding to the final cell efficiency. In this regard, the series resistance, termed as Rseries, could be expressed as bellow [35], (6) R series , light V dark , mpp − V light , mpp − J sc − J mpp R series , dark J mpp , R series , dark = V dark , J sc − V oc J sc where Rseries,light and Rseries,dark represented series resistance with and without light illuminations, respectively; the subscript, mpp, denoted the maximum power point. The measured Rseries was found to monolithically increase with the introduction of nanopores on cell surfaces. The increase of Rseries represented the increased electrical loss, and the Rseries of the longest nanopores (24-min etching) was found to be above 2.7 times larger than the case of pyramid-only solar cells. Such constituted large Rseries turned to be rather competitive against the improvement of light-trapping behavior contributed from the designed two-scale textures. Considering that all the tested cells consisted of similar rear electrode made with carefully controlling procedures, the main issue which differed the cell performance lied in the front contact with the top Ag electrodes. This finding was further supported by examining the morphologies of cell surfaces in side views, as presented in Fig. 7 . The distinct contact morphologies of Ag electrodes with underlying Si textures could be observed. With optimal etching duration (8 min), the uniform interfacial features between an Ag pad and Si textures without the formation of voids at contact interfaces were generated, as shown in Fig. 7(a). The low Rseries (0.0017 Ω) was thereby achieved which was comparable with the microtexture-based reference (0.0014 Ω), thereby resulting in the best conversion efficiency due to reaching the balance of improved light-trapping characteristic and the fairly unchanged contact resistance with front electrode. Nevertheless, the longer nanopores (etching durations > 16 min) inevitably caused the poor interfacial contact owing to the substantial non-uniformity of Ag pastes during firing process and the formation of cracks or voids at interfaces between the highly rough texture surfaces and Ag electrode on the top, as shown in Fig. 7(b). This explained the dramatic increase of Rseries (0.0038 Ω) when etching durations reached 24 min, which eventually impeded the effective output of photogenerated carriers upon light illuminations. 4 Conclusions In conclusion, we investigated the structural engineering of hierarchical textures for improving the conversion efficiency of solar cells. It was found that the lengths of etched nanopores did not always increase linearly with the etching durations; instead, two distinct stages of etching process were taken place due to the fact that the formation of Si nanopores was subjected to the nucleation of primary Ag nanoparticles on the pyramidal surfaces. The increase of both surface roughness and PL intensity of emission peak with respect to the etching durations was identified, and these two characteristics were found to affect the eventual efficiency of solar cells. In addition, the hierarchical textures showed the black features, representing the substantial enhancement of light absorption from the cell surfaces. FDTD analysis was further employed and the simulated results corresponded well with measured reflectivity. It was found that the ultra-low reflectivity with values <6% was obtained from the combined nanopore/pyramid structures under the various illumination angles from 00 to 600, evidencing their remarkable omnidirectional light-trapping capability. Furthermore, we revealed that the controlled etching duration was critical for both photonic and electrical management of high-performance solar cells. By achieving the improved light-trapping characteristics and fairly unchanged contact resistance with the front electrodes, the hierarchical textures could reach the conversion efficiency of 18.78%, which was >0.6% of increased value beyond the typical microtexture-based solar cells. These results with design strategy were anticipated to guide the realization of high-performance solar cells based on two-scale textures. Acknowledgment This study was financially supported by Ministry of Science and Technology of Taiwan (MOST 106-2221-E-006-240) and (MOST 107-2221-E-006-013-MY3), and the Hierarchical Green-Energy Materials (Hi-GEM) Research Center, from The Featured Areas Research Center Program within the framework of the Higher Education Sprout Project by the Ministry of Education (MOE) and the Ministry of Science and Technology (MOST 107-3017-F-006 -003) in Taiwan. The authors greatly thank Center for Micro/Nano Science and Technology, National Cheng Kung University with the facilities provided for conducting material characterizations. Appendix A Supplementary data Supplementary material Image 1 Appendix A Supplementary data Supplementary data to this article can be found online at https://doi.org/10.1016/j.apsusc.2019.02.001. References [1] T. Saga Advances in crystalline silicon solar cell technology for industrial mass production NPG Asia Mater. 2 2010 96 [2] M.A. Green Crystalline and thin-film silicon solar cells: state of the art and future potential Sol. Energy 74 2003 181 192 [3] J. Yoon S. Jo I.S. Chun I. Jung H.-S. Kim M. Meitl E. Menard X. Li J.J. Coleman U. Paik GaAs photovoltaics and optoelectronics using releasable multilayer epitaxial assemblies Nature 465 2010 329 [4] V. Tyagi N.A. Rahim N. Rahim A. Jeyraj L. Selvaraj Progress in solar PV technology: research and achievement Renew. Sust. Energ. Rev. 20 2013 443 461 [5] E. Garnett P. Yang Light trapping in silicon nanowire solar cells Nano Lett. 10 2010 1082 1087 [6] P. Papet O. Nichiporuk A. Kaminski Y. Rozier J. Kraiem J.-F. Lelievre A. Chaumartin A. Fave M. Lemiti Pyramidal texturing of silicon solar cell with TMAH chemical anisotropic etching Sol. Energy Mater. Sol. Cells 90 2006 2319 2328 [7] J. Kim Y.H. Kim S.-H. Choi W. Lee Curved silicon nanowires with ribbon-like cross sections by metal-assisted chemical etching ACS Nano 5 2011 5242 5248 [8] L.A. Osminkina K.A. Gonchar V.S. Marshov K.V. Bunkov D.V. Petrov L.A. Golovan F. Talkenberg V.A. Sivakov V.Y. Timoshenko Optical properties of silicon nanowire arrays formed by metal-assisted chemical etching: evidences for light localization effect Nanoscale Res. Lett. 7 2012 524 [9] S. Jeong E.C. Garnett S. Wang Z. Yu S. Fan M.L. Brongersma M.D. McGehee Y. Cui Hybrid silicon nanocone–polymer solar cells Nano Lett. 12 2012 2971 2976 [10] P. Singh S.K. Srivastava M. Yameen B. Sivaiah V. Prajapati P. Prathap S. Laxmi B. Singh C. Rauthan P. Singh Fabrication of vertical silicon nanowire arrays on three-dimensional micro-pyramid-based silicon substrate J. Mater. Sci. 50 2015 6631 6641 [11] S. Matsuo M. Kiuchi Low temperature chemical vapor deposition method utilizing an electron cyclotron resonance plasma Jpn. J. Appl. Phys. 22 1983 L210 [12] Ü. Sökmen A. Stranz S. Fündling H. Wehmann V. Bandalo A. Bora M. Tornow A. Waag E. Peiner Capabilities of ICP-RIE cryogenic dry etching of silicon: review of exemplary microstructures J. Micromech. Microeng. 19 2009 105005 [13] I.T. Clark B.S. Aldinger A. Gupta M.A. Hines Aqueous etching produces Si (100) surfaces of near-atomic flatness: strain minimization does not predict surface morphology J. Phys. Chem. C 114 2009 423 428 [14] C.-Y. Chen C.-P. Wong Unveiling the shape-diversified silicon nanowires made by HF/HNO3 isotropic etching with the assistance of silver Nanoscale 7 2015 1216 1223 [15] I. Zubel M. Kramkowska The effect of isopropyl alcohol on etching rate and roughness of (100) Si surface etched in KOH and TMAH solutions Sensors Actuators A Phys. 93 2001 138 147 [16] Z. Zhao B. Zhang P. Li W. Guo A. Liu Effective passivation of large area black silicon solar cells by SiO2/SiNx:H stacks Int. J. Photoenergy 2014 2014 [17] J. Liu B. Liu S. Liu Z. Shen C. Li Y. Xia A simple method to produce dual-scale silicon surfaces for solar cells Surf. Coat. Technol. 229 2013 165 167 [18] D.Z. Dimitrov C.-H. Du Crystalline silicon solar cells with micro/nano texture Appl. Surf. Sci. 266 2013 1 4 [19] C. Chen R. Jia H. Yue H. Li X. Liu D. Wu W. Ding T. Ye S. Kasai H. Tamotsu Silicon nanowire-array-textured solar cells for photovoltaic application J. Appl. Phys. 108 2010 094318 [20] C.-Y. Chen P.-H. Hsiao T.-C. Wei T.-C. Chen C.-H. Tang Well incorporation of carbon nanodots with silicon nanowire arrays featuring excellent photocatalytic performances Phys. Chem. Chem. Phys. 19 2017 11786 11792 [21] M. Kulakci F. Es B. Ozdemir H.E. Unalan R. Turan Application of Si nanowires fabricated by metal-assisted etching to crystalline Si solar cells IEEE J. Photovoltaics 3 2013 548 553 [22] Z. Fan W. Zhang Q. Ma L. Yan L. Xu Y. Fu Light-trapping characteristics of ag nanoparticles for enhancing the energy conversion efficiency of hybrid solar cells ACS Appl. Mater. Interfaces 9 2017 35998 36008 [23] K.S. Do M.G. Kang J.J. Park G.H. Kang J.-M. Myoung H.-e. Song Surface texturing of crystalline silicon solar cell using silicon nanowires Jpn. J. Appl. Phys. 52 2013 092301 [24] K. Peng J. Hu Y. Yan Y. Wu H. Fang Y. Xu S. Lee J. Zhu Fabrication of single-crystalline silicon nanowires by scratching a silicon surface with catalytic metal particles Adv. Funct. Mater. 16 2006 387 394 [25] N. Mitsugi K. Nagai Pit formation induced by copper contamination on silicon surface immersed in dilute hydrofluoric acid solution J. Electrochem. Soc. 151 2004 G302-G6 [26] J.-Y. Li C.-H. Hung C.-Y. Chen Hybrid black silicon solar cells textured with the interplay of copper-induced galvanic displacement Sci. Rep. 7 2017 17177 [27] Z. Huang N. Geyer P. Werner J. De Boor U. Gösele Metal-assisted chemical etching of silicon: a review Adv. Mater. 23 2011 285 308 [28] Y.-Y. Song Z.-D. Gao J.J. Kelly X.-H. Xia Galvanic deposition of nanostructured noble-metal films on silicon Electrochem. Solid-State Lett. 8 2005 C148-C50 [29] A. Cassie S. Baxter Wettability of porous surfaces Trans. Faraday Soc. 40 1944 546 551 [30] X. Li B.K. Tay P. Miele A. Brioude D. Cornu Fabrication of silicon pyramid/nanowire binary structure with superhydrophobicity Appl. Surf. Sci. 255 2009 7147 7152 [31] C.-Y. Chen T.-C. Wei C.-T. Lin J.-Y. Li Enhancing formation rate of highly-oriented silicon nanowire arrays with the assistance of back substrates Sci. Rep. 7 3164 2017 [32] K. Peng Y. Xu Y. Wu Y. Yan S.T. Lee J. Zhu Aligned single-crystalline Si nanowire arrays for photovoltaic applications Small 1 2005 1062 1067 [33] D. Stavenga S. Foletti G. Palasantzas K. Arikawa Light on the moth-eye corneal nipple array of butterflies Proc. R. Soc. Lond. B Biol. Sci. 273 2006 661 667 [34] K. Imamura D. Irishika H. Kobayash Surface nanocrystalline Si structure and its surface passivation for highly efficient black Si solar cells Prog. Photovolt. Res. Appl. 25 2017 358 366 [35] D. Pysch A. Mette S.W. Glunz A review and comparison of different methods to determine the series resistance of solar cells Sol. Energy Mater. Sol. Cells 91 2007 1698 1706", "scopus-id": "85061189312", "coredata": {"eid": "1-s2.0-S0169433219303332", "dc:description": "18.78% efficiency of crystalline silicon (Si) solar cells was achieved through introducing the combined nanopore/pyramid textures. These hierarchical structures possessed the ultra-low reflectivity with values <6% under the various illumination angles from 0 to 60°, evidencing their remarkable omnidirectional light-trapping capability. Although the greatly improved light-trapping effect of the hierarchical structures was demonstrated, we found that the increased formation durations of Si nanopores led the substantial increase of photoluminescent characteristics that could limit the efficient separation of photogenerated carriers through charge recombination. Moreover, the positive correlation in surface roughness of nanopore arrays with respect to the elongated etching durations was evidenced, and these issues could increase the series resistance of solar cells owing to poor interfacial contact between nanopores and front electrodes. Thus, there existed the optimal combination between two-scale textures critically for both photonic and electrical management of cell design. By optimizing the etching durations for the controlled nanopore formation, the improved light-trapping characteristics and fairly unchanged contact resistance with front electrode was achieved, possessing the improved conversion efficiency with >0.58% of increased value beyond the typical microtexture-based solar cells.", "openArchiveArticle": "false", "prism:coverDate": "2019-06-01", "openaccessUserLicense": null, "prism:aggregationType": "Journal", "prism:url": "https://api.elsevier.com/content/article/pii/S0169433219303332", "dc:creator": [{"@_fa": "true", "$": "Putra, Ilham Ramadhan"}, {"@_fa": "true", "$": "Li, Jheng-Yi"}, {"@_fa": "true", "$": "Chen, Chia-Yun"}], "link": [{"@_fa": "true", "@rel": "self", "@href": "https://api.elsevier.com/content/article/pii/S0169433219303332"}, {"@_fa": "true", "@rel": "scidir", "@href": "https://www.sciencedirect.com/science/article/pii/S0169433219303332"}], "dc:format": "application/json", "openaccessType": null, "pii": "S0169-4332(19)30333-2", "prism:volume": "478", "prism:publisher": "Elsevier B.V.", "dc:title": "18.78% hierarchical black silicon solar cells achieved with the balance of light-trapping and interfacial contact", "prism:copyright": "© 2019 Elsevier B.V. All rights reserved.", "openaccess": "0", "prism:issn": "01694332", "openaccessArticle": "false", "prism:publicationName": "Applied Surface Science", "openaccessSponsorType": null, "prism:pageRange": "725-732", "prism:endingPage": "732", "pubType": "fla", "prism:coverDisplayDate": "1 June 2019", "prism:doi": "10.1016/j.apsusc.2019.02.001", "prism:startingPage": "725", "dc:identifier": "doi:10.1016/j.apsusc.2019.02.001", "openaccessSponsorName": null}, "objects": {"object": [{"@category": "thumbnail", "@height": "125", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433219303332-gr1.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "9002", "@ref": "gr1", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "149", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433219303332-gr2.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "15498", "@ref": "gr2", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "89", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433219303332-gr3.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "5220", "@ref": "gr3", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "77", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433219303332-gr4.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "11989", "@ref": "gr4", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "164", "@width": "189", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433219303332-gr5.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "12648", "@ref": "gr5", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "164", "@width": "205", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433219303332-gr6.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "6908", "@ref": "gr6", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "90", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433219303332-gr7.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "14784", "@ref": "gr7", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "460", "@width": "803", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433219303332-gr1.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "94265", "@ref": "gr1", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "546", "@width": "803", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433219303332-gr2.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "112214", "@ref": "gr2", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "328", "@width": "803", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433219303332-gr3.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "59238", "@ref": "gr3", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "252", "@width": "714", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433219303332-gr4.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "42050", "@ref": "gr4", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "696", "@width": "803", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433219303332-gr5.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "201717", "@ref": "gr5", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "304", "@width": "380", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433219303332-gr6.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "32750", "@ref": "gr6", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "256", "@width": "625", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433219303332-gr7.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "79652", "@ref": "gr7", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "1221", "@width": "2132", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433219303332-gr1_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "404556", "@ref": "gr1", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "1450", "@width": "2132", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433219303332-gr2_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "416877", "@ref": "gr2", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "871", "@width": "2132", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433219303332-gr3_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "203799", "@ref": "gr3", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "669", "@width": "1896", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433219303332-gr4_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "193199", "@ref": "gr4", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "1849", "@width": "2132", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433219303332-gr5_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "762816", "@ref": "gr5", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "808", "@width": "1010", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433219303332-gr6_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "127961", "@ref": "gr6", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "679", "@width": "1660", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433219303332-gr7_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "344257", "@ref": "gr7", "@mimetype": "image/jpeg"}, {"@category": "standard", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433219303332-mmc1.docx?httpAccept=%2A%2F%2A", "@multimediatype": "Microsoft Word file", "@type": "APPLICATION", "@size": "50396", "@ref": "mmc1", "@mimetype": "application/word"}, {"@category": "thumbnail", "@height": "19", "@width": "214", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433219303332-si1.gif?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "ALTIMG", "@size": "1012", "@ref": "si1", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "21", "@width": "101", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433219303332-si2.gif?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "ALTIMG", "@size": "529", "@ref": "si2", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "22", "@width": "191", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433219303332-si3.gif?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "ALTIMG", "@size": "866", "@ref": "si3", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "22", "@width": "200", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433219303332-si4.gif?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "ALTIMG", "@size": "981", "@ref": "si4", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "17", "@width": "181", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433219303332-si5.gif?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "ALTIMG", "@size": "847", "@ref": "si5", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "43", "@width": "575", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433219303332-si6.gif?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "ALTIMG", "@size": "2765", "@ref": "si6", "@mimetype": "image/gif"}, {"@category": "standard", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0169433219303332-am.pdf?httpAccept=%2A%2F%2A", "@multimediatype": "Acrobat PDF file", "@type": "AAM-PDF", "@size": "926116", "@ref": "am", "@mimetype": "application/pdf"}]}, "link": {"@rel": "abstract", "@href": "https://api.elsevier.com/content/abstract/scopus_id/85061189312"}}