{"scopus-eid": "2-s2.0-85048861921", "originalText": "serial JL 271495 291210 291731 291732 291746 291809 291864 291865 291892 291893 31 Solar Energy Materials and Solar Cells SOLARENERGYMATERIALSSOLARCELLS 2018-06-18 2018-06-18 2018-06-18 2018-06-18 2019-06-28T18:56:36 1-s2.0-S0927024818303088 S0927-0248(18)30308-8 S0927024818303088 10.1016/j.solmat.2018.06.019 S300 S300.2 FULL-TEXT 1-s2.0-S0927024818X00117 2019-06-28T20:03:59.534079Z 0 0 20181101 20181130 2018 2018-06-19T00:57:08.060795Z absattachment articleinfo articletitlenorm authfirstinitialnorm authfirstsurnamenorm cid cids contenttype copyright crossmark dateloaded dateloadedtxt datesearch datesort dateupdated dco docsubtype doctype doi eid ewtransactionid hubeid indexeddate issn issnnorm itemstage itemtransactionid itemweight openaccess openarchive pg pgfirst pglast pii piinorm pubdateend pubdatestart pubdatetxt pubyr sectiontitle sortorder srctitle srctitlenorm srctype ssids alllist content subj subheadings suppl tomb volfirst volissue volumelist webpdf webpdfpagecount yearnav figure table body acknowledge affil articletitle auth authfirstini authfull authkeywords authlast grantnumber grantsponsor highlightsabst orcid primabst ref specialabst 0927-0248 09270248 true 186 186 C Volume 186 39 9 13 9 13 201811 November 2018 2018-11-01 2018-11-30 2018 VSI: SiliconPV 2018 article fla © 2018 Published by Elsevier B.V. HIGHEFFICIENCYBLACKIBCCSISOLARCELLSPOLYSICARRIERSELECTIVEPASSIVATINGCONTACTS YANG G 1 Introduction 2 Experimental 2.1 Poly-Si passivating contacts 2.2 IBC solar cells with poly-Si CSPCs 3 Results and discussion 3.1 IBC solar cells performances 3.2 Modulated surface textured passivation stack 3.3 IBC solar cells with MST-ARC 4 Conclusion Acknowledgements References DING 2012 193 195 K GATZ 2016 1932 1936 H ZHANG 2014 1326 1330 D TOMASI 2017 17062 A RIENACKER 2016 412 418 M YOUNG 2016 68 76 D GEISSBUHLER 2015 081601 J YANG 2016 5891 5897 X YOSHIKAWA 2017 17032 K TOMASI 2014 1046 1054 A MASUKO 2014 1433 1435 K YANG 2017 896 904 X YABLONOVITCH 1985 1211 E MOLDOVAN 2015 123 127 A ROMER 2014 85 91 U NOGAY 2017 18 24 G YANG 2016 84 90 G STUCKELBERGER 2016 2 J MACK 2018 9 I YANG 2018 193904 G CHHAJED 2008 251108 S LUMB 2013 A585 A594 M OH 2013 A157 A166 S SCHUBERT 2008 5290 5298 M HSU 2014 2 17 C INGENITO 2014 270 278 A SAVIN 2015 624 H OTTO 2012 361 364 M HEIKKINEN 2017 282 287 I SINTON 1996 2510 R INGENITO 2016 354 365 A YANG 2017 392 399 G ISABELLA 2010 101106 O INGENITO 2015 1649 1659 A YANGX2018X9 YANGX2018X9X13 YANGX2018X9XG YANGX2018X9X13XG 2020-06-18T00:00:00.000Z 2020-06-18T00:00:00.000Z http://creativecommons.org/licenses/by-nc-nd/4.0/ © 2018 Published by Elsevier B.V. item S0927-0248(18)30308-8 S0927024818303088 1-s2.0-S0927024818303088 10.1016/j.solmat.2018.06.019 271495 2019-06-28T20:03:59.534079Z 2018-11-01 2018-11-30 1-s2.0-S0927024818303088-main.pdf https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818303088/MAIN/application/pdf/6a1093b803b51295e176e7ec27174bce/main.pdf main.pdf pdf true 1109119 MAIN 5 1-s2.0-S0927024818303088-main_1.png https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818303088/PREVIEW/image/png/83b6d4cd55919207e950be6081778600/main_1.png main_1.png png 54398 849 656 IMAGE-WEB-PDF 1 1-s2.0-S0927024818303088-fx1.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818303088/fx1/THUMBNAIL/image/gif/184279ca9da2551488464bb3b5bd3a8b/fx1.sml fx1 true fx1.sml sml 20735 123 219 IMAGE-THUMBNAIL 1-s2.0-S0927024818303088-gr1.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818303088/gr1/THUMBNAIL/image/gif/8e8ffbb7f6c477b2cbddb5690a9ee1b3/gr1.sml gr1 gr1.sml sml 14458 53 219 IMAGE-THUMBNAIL 1-s2.0-S0927024818303088-gr2.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818303088/gr2/THUMBNAIL/image/gif/c02651dde6a4ae53a975870565feb6ac/gr2.sml gr2 gr2.sml sml 22021 164 202 IMAGE-THUMBNAIL 1-s2.0-S0927024818303088-gr3.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818303088/gr3/THUMBNAIL/image/gif/9d541e125363e125d8fbb252f163dc7e/gr3.sml gr3 gr3.sml sml 24990 123 219 IMAGE-THUMBNAIL 1-s2.0-S0927024818303088-gr4.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818303088/gr4/THUMBNAIL/image/gif/fef99cc4c13ea9374f0a15e1418ca793/gr4.sml gr4 gr4.sml sml 22587 147 219 IMAGE-THUMBNAIL 1-s2.0-S0927024818303088-gr5.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818303088/gr5/THUMBNAIL/image/gif/6197b7b298106d472820857e14ac2d10/gr5.sml gr5 gr5.sml sml 28902 162 219 IMAGE-THUMBNAIL 1-s2.0-S0927024818303088-fx1.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818303088/fx1/DOWNSAMPLED/image/jpeg/8c0dc5e216738b68894a0473520646a4/fx1.jpg fx1 true fx1.jpg jpg 58189 200 356 IMAGE-DOWNSAMPLED 1-s2.0-S0927024818303088-gr1.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818303088/gr1/DOWNSAMPLED/image/jpeg/98877d5b98616ab7cfc01c28c8c4d475/gr1.jpg gr1 gr1.jpg jpg 87190 197 809 IMAGE-DOWNSAMPLED 1-s2.0-S0927024818303088-gr2.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818303088/gr2/DOWNSAMPLED/image/jpeg/11f3f17f9fb1820241acad22364d8763/gr2.jpg gr2 gr2.jpg jpg 59990 244 301 IMAGE-DOWNSAMPLED 1-s2.0-S0927024818303088-gr3.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818303088/gr3/DOWNSAMPLED/image/jpeg/20f823a4f75dc7ce0bb23e840de9c8bb/gr3.jpg gr3 gr3.jpg jpg 105232 381 678 IMAGE-DOWNSAMPLED 1-s2.0-S0927024818303088-gr4.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818303088/gr4/DOWNSAMPLED/image/jpeg/a2d5f65380f3050de0a11cf8dc265d8e/gr4.jpg gr4 gr4.jpg jpg 59255 225 336 IMAGE-DOWNSAMPLED 1-s2.0-S0927024818303088-gr5.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818303088/gr5/DOWNSAMPLED/image/jpeg/0b0be81ff3a7d40183ffd1149586a71e/gr5.jpg gr5 gr5.jpg jpg 72622 252 339 IMAGE-DOWNSAMPLED 1-s2.0-S0927024818303088-fx1_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818303088/fx1/HIGHRES/image/jpeg/f1fe14a3c665ad472e29c453b6309c76/fx1_lrg.jpg fx1 true fx1_lrg.jpg jpg 320754 886 1576 IMAGE-HIGH-RES 1-s2.0-S0927024818303088-gr1_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818303088/gr1/HIGHRES/image/jpeg/4a5b218f59b25215e94043ffc8793270/gr1_lrg.jpg gr1 gr1_lrg.jpg jpg 548379 871 3583 IMAGE-HIGH-RES 1-s2.0-S0927024818303088-gr2_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818303088/gr2/HIGHRES/image/jpeg/13f482ece8e682ccedfe9aa188327239/gr2_lrg.jpg gr2 gr2_lrg.jpg jpg 285545 1082 1333 IMAGE-HIGH-RES 1-s2.0-S0927024818303088-gr3_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818303088/gr3/HIGHRES/image/jpeg/2dbbfc4fc002ad4a633c5afeacd2a96e/gr3_lrg.jpg gr3 gr3_lrg.jpg jpg 996977 1687 3000 IMAGE-HIGH-RES 1-s2.0-S0927024818303088-gr4_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818303088/gr4/HIGHRES/image/jpeg/e359e39bdd0455170e83a122bc40838d/gr4_lrg.jpg gr4 gr4_lrg.jpg jpg 315107 999 1489 IMAGE-HIGH-RES 1-s2.0-S0927024818303088-gr5_lrg.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024818303088/gr5/HIGHRES/image/jpeg/b5486906608a8e3141e1c2544841e072/gr5_lrg.jpg gr5 gr5_lrg.jpg jpg 402344 1113 1500 IMAGE-HIGH-RES SOLMAT 9494 S0927-0248(18)30308-8 10.1016/j.solmat.2018.06.019 Fig. 1 (A, a1–a7) Schematic representation of the self-aligned process for IBC solar cells; (a8) cross-sectional scanning electron microscope (SEM) picture of the trench between the poly-Si BSF and emitter fingers; (B, b1~b4) schematic representation of the etch back process for IBC solar cells; (b5) cross-sectional SEM picture of the trench between the poly-Si BSF and emitter fingers. (c) Schematic representation of the back side of the wafer, containing two solar cells. For sake of simplicity, the back side SiNx layer was not drawn. Fig. 1 Fig. 2 Measured EQE and estimated losses of Cell #1, reported in terms of mA/cm2 and integrated between 300 and 1200 nm. Fig. 2 Fig. 3 SEM pictures of the MST-ARC passivated Si surfaces, with (a) the as deposited SiO2 layer and (b~f) the wet-etched SiO2 as function of HF etching time. Fig. 3 Fig. 4 Log-scale reflectance spectra of symmetrical samples endowed with MST-ARC shown in Fig. 3(c, d, f), or SiNx:H ARC. A b-Si sample prepared by reactive ion plasma etching is used as reference, whose SEM picture is shown in the inset. Fig. 4 Fig. 5 The EQE and 1-R curves of solar cells with SiNx:H ARC and MST-ARC (prepared with HF, 0.55%, etching time for 1.5 min). The insets are the cross-sectional SEM images of the front surface of both cells. Fig. 5 Table 1 Performance of IBC solar cells with poly-Si CSPCs, prepared with self-aligned process (Fig. 1 (A-sequence)) and etch-back process (Fig. 1 (B-sequence)). Table 1 Cell Area [cm2] V OC [mV] J SC, I-V [mA/cm2] FF [%] η [%] 1 a 0.72 709 40.7 76.4 22.1 2 a 0.72 681 41.3 80.0 22.5 3 a 9.00 696 39.6 79.6 21.9 4 b 1.00 682 41.6 81.0 23.0 5 b,c 2.00 701 42.2 77.8 23.0 a IBC cells from different runs with the same self-aligned process flow as in Fig. 1 (A-sequence). b IBC cells from different runs with the same process flow as in Fig. 1 (B-sequence). c IBC cell with MST-ARC, see Section III (c). High-efficiency black IBC c-Si solar cells with poly-Si as carrier-selective passivating contacts Guangtao Yang a ⁎ Peiqing Guo a Paul Procel a Gianluca Limodio a Arthur Weeber a b Olindo Isabella a Miro Zeman a a Delft University of Technology, PVMD Group, Mekelweg 4, 2628 CD Delft, The Netherlands Delft University of Technology, PVMD Group Mekelweg 4 Delft 2628 CD The Netherlands b ECN Part of TNO, Solar Energy, PO Box 1, 1755 ZG Petten, The Netherlands ECN Part of TNO, Solar Energy PO Box 1 Petten 1755 ZG The Netherlands ⁎ Coprresponding author. In this work, we present the application of poly-Si carrier-selective passivating contacts (CSPCs) as both polarities in interdigitated back-contacted (IBC) solar cell architectures. We compared two approaches to form a gap between the back-surface field (BSF) and emitter fingers. It is proved that the gaps prepared by both approaches are efficient in preventing carriers’ recombination. To minimize the reflection losses, we developed a novel modulated surface texturing (MST) structure as anti-reflection coating (ARC). It is obtained by superposing a nano-textured SiO2 layer on the conventional micro-textured pyramids, which are passivated with a-Si:H / SiNx:H layers. This approach decouples the light harvesting from the Si surface passivation, which potentially results in the highest possible optical and electrical performances of the solar cells. The reflectance (R) of the MST-ARC is very close to that of the high-aspect ratio nano-structured silicon (black-Silicon), achieving R < 1% between 450 and 1000 nm. The J 0 of MST-ARC passivated Si surface (6.3 fA/cm2) is the same as that of standard a-Si:H/SiNx:H layers passivated pyramidally-textured Si surface. By applying this novel MST-ARC in our IBC solar cell, the highest J SC observed in a device is 42.2 mA/cm2 with a V OC as high as 701 mV. A spectral response enhancement in case of the MST-ARC cell is observed over the whole wavelength range with respect to the cell with standard SiNx:H ARC. The highest efficiency achieved in this work is 23.0%, with the potential to reach 24.0% in short term by using more conductive metal fingers. Graphical abstract fx1 Keywords Poly-silicon Carrier selective passivating contact Light in-coupling IBC c-Si solar cells 1 Introduction The conversion efficiency of c-Si solar cells is continuously increased by means of material innovation with the aim to improve both bulk and surface passivation. Still, minority carriers’ recombination velocity at c-Si/contact interface can be further quenched by means of the application of carrier-selective passivating contacts (CSPCs). These technologies are based, for example, on a-Si:H (Silicon Heterojunction, SHJ) [1–4], doped poly-Si [5–8], and metal-oxides [9,10]. SHJ technology has recently led to world-record, > 26%, interdigitated back-contacted (IBC) solar cells [11]. This is a solar cell architecture with both contacts at the rear side and no optical shading losses are occurring at the front side as is the case for the front/back-contacted (FBC) cell design [12,13]. A main drawback of the SHJ solar cell is that the temperature stability of the a-Si:H based layers (< 250 °C) hinders industrial implementation of this technology for low cost production. Besides that, the limited transparency of the a-Si:H based materials for the short wavelength light induces parasitic absorption losses when they are used on the light facing side of the solar cells. The metal-oxide based passivating contacts, like MoOx and TiOx which are transparent, are also rapidly emerging and already enable efficiencies beyond 22% [9,10]. Even though attempts have been made to fire metal contacts on TiOx [14], such materials still generally exhibit the low thermal stability drawback. Back to 1970s, semi-insulating poly-crystalline silicon (SIPOS) was developed to passivate and contact Si for PV application [15]. It is a mixture of doped micro-crystalline silicon and silicon oxide (SiO x ). By using such a carrier-selective contact, very good passivation of the c-Si surface was obtained resulting in an V OC of 720 mV for the c-Si solar cell test structure n+-SIPOS/thin SiO2/p-type c-Si/thin SiO2/n+-SIPOS [15]. Recently, with a similar concept, the poly-crystalline silicon [16–19] and alloys, for example in the form of poly-SiCx [5,20], have attracted attention in several research groups as a high-temperature stable CSPC structure. They have already been developed and demonstrated solar cells with record-high conversion efficiencies of > 25% (FBC) and > 26% (IBC) [22]. Nevertheless, there is still a restriction that limits the efficiency of solar cells with such materials, which is the high parasitic absorption in the CSPC layers caused mainly by free carrier absorption (FCA), especially for heavily doped poly-Si. Therefore, the best way to use such CSPCs is to apply them on the back side of the IBC solar cells [21,22], even though, the high FCA still induces optical losses, which is potentially solved by the oxygen alloying in the poly-Si films to form poly-SiOx CSPCs [23–26], and experimentally demonstrated in the IBC solar cells [27]. Besides the parasitic absorption losses in the solar cells, another main optical loss is the reflection loss from the front side of the cell. In order to minimize such loss, multi-layer anti-reflection coating (ARC) concept is now widely used in the research and industry [28–31]. Another promising approach to minimize the reflection loss is the application of the so-called black-Silicon (b-Si) technology [32,33]. However, the passivation for the nanotextured Si surface is more challenging, no matter the b-Si is prepared by dry or wet etching [34–36]. In this work, we propose a novel approach to treat the Si surface, for obtaining optical performance like b-Si but with excellent surface passivation. The goal of this work is to demonstrate - at device level - the application of poly-Si CSPCs in IBC solar cells and the concurrent minimization of reflection losses. We first optimized and simplified the previously developed self-aligned poly-Si CSPCs IBC solar cell process [21] for a more industrially-feasible process. The obtained IBC solar cell results are then presented and discussed. In order to quantify the optical losses, an opto-electrical modelling with TCAD simulation of the IBC solar cells with poly-Si CSPC was performed. With the aim of minimizing the reflectance loss, we report on the development of a modulated surface textured anti-reflection coating (MST-ARC) for application in solar cells. The optical and passivation properties of the MST-ARC are then presented. Finally, the optical enhancement in the IBC solar cell by the application of MST-ARC is presented and discussed. 2 Experimental 2.1 Poly-Si passivating contacts Our poly-Si CSPCs consist of an ultra-thin tunnelling SiO2 layer and a doped poly-Si layer, realized as follows. First, the tunnelling SiO2 layer is formed on both sides of the wafer by a wet-chemical method. Secondly, the intrinsic amorphous silicon (a-Si, 250 nm) is deposited on both sides of the wafer by means of low-pressure chemical vapour deposition (LPCVD). Ex-situ doping is realized by ion-implantation. Thirdly, a high temperature process is executed to activate and drive-in the implanted dopants, while it is also used to turn the a-Si to poly-Si phase. Finally, a forming gas annealing step is applied for hydrogenating layers and interfaces. The details regarding the process and optimization of the poly-Si CSPCs were previously published [21]. In this work, < 100 > oriented, 280-μm thick, 1–5 Ωcm, double-side polished FZ wafers were used. The injection-dependent minority carrier lifetime (τ) and the implied open-circuit voltage (iV OC) were measured by a Photoconductance Lifetime Tester using Quasi-Steady State Photoconductance (QSSPC) method [37]. Four-point probe measurements and the transmission line method (TLM) were used, respectively, to obtain the sheet resistance (RSH) of the passivating contacts and the contact resistance (RC) between such passivating contacts and the evaporated Al. In order to ensure an accurate measurement, the c-Si bulk used for the RSH and RC measurements exhibited opposite doping type than the one of the passivating contacts under test. 2.2 IBC solar cells with poly-Si CSPCs The main steps to fabricate our IBC solar cells with the self-aligned process were presented in our previous work [21]. The schematic description of the process is illustrated in Fig. 1 (A-sequence). A gap between back-surface field (BSF) and emitter is formed during the patterning of BSF and emitter at step-a3 and step-a6 (see SEM image in Fig. 1a8). Due to the BSF patterning etch step at step-a3 (see Fig. 1a3), the BSF and emitter are located at different levels on the back side of the cell surface. And, due to the etch, the c-Si surface shows nano-scale roughness. This surface roughness will influence the passivation properties of the emitter that is deposited on top of it, when compared to that deposited on the polished surface. In this work, we modified the process flow by patterning the BSF and emitter in a different way, ensuring that both BSF and emitter layers are deposited on the polished c-Si surface. Therefore, this modified process flow will enable optimal passivation for both BSF and emitter. By applying this patterning process, shown in Fig. 1 (B-sequence), P and B are locally implanted into the LPCVD intrinsic a-Si layer and an etching step (see Fig. 1b3) is used to separate the BSF and emitter fingers, forming a trench gap between them. After the BSF and emitter patterning steps, both processes (A) and (B) undergo the same front side texturing with mixture solution of TMAH and ALKA-TEX 8 from GP-Solar-GmbH, which results in a pyramid size of less than 3 µm. And then a lightly-doped front surface field (FSF) implantation [38], and a one-step annealing/dopants-activation process are implemented before the metallization. The FSF is then passivated with a-Si:H / SiNx:H stack. The SiNx:H layer on the back side is mainly used for optical purpose and to increase the internal reflection. Solar cells on the same wafer are isolated from each other by a 1-mm wide p-type poly-Si area, as in the sketch in Fig. 1(c). The J-V curves of IBC cells are measured with a class AAA Wacom WXS-156S solar simulator. The active area of each cell is precisely illuminated through a laser-cut metallic mask. Series-resistance-free J-V curves and related pseudo fill factor (pFF) are measured with a Sinton Suns-V OC. The reference cells for both J-V and external quantum efficiency (EQE) measurements were calibrated at the CalLab of Fraunhofer Institute for Solar Energy Systems. 3 Results and discussion 3.1 IBC solar cells performances The optimization of poly-Si CSPCs and their application into IBC solar cell with the self-aligned process was previously published [21]. The current characteristics of our n+ poly-Si are: J 0 = 4.5 fA/cm2, sheet resistance (RSH) = 89 Ω/□, and contact resistance with Al RC,TLM = 0.9 mΩ∙cm2; while the p+ poly-Si passivating contacts show J 0 = 11 fA/cm2, RSH = 122 Ω/□, and contact resistance with Al RC,TLM = 0.3 mΩ∙cm2. The passivating a-Si:H / SiNx:H stack deposited on the FSF yields J 0 = 6.5 fA/cm2 [39]. The performance of IBC cells prepared by the self-aligned approach (cell #1, #2, and #3), shown in Fig. 1(A), are listed in Table 1. The highest efficiencies so far, prepared with the self-aligned process, reached by us are 22.5% for a 0.72-cm2 large cell and 21.9% for a 9.0-cm2 large cell. With this approach, the highest V OC and FF obtained (on different devices) are 709 mV and 80.0%, respectively. As mentioned in Section II (B), in the self-aligned process, the passivation of the emitter is deteriorated by the nano-roughness of the c-Si surface owning to the wet-etching process in step-a3 (shown in Fig. 1a3). Meanwhile, the two times poly-Si layer deposition increases the complexity of the whole process. We therefore developed an etch-back process (Fig. 1 (B-sequence)). In this process, the LPCVD poly-Si layer for both BSF and emitter is deposited in one single step on polished c-Si surface. The trench between BSF and emitter is obtained by wet-etching with a photolithography-patterned SiNx protective layer on top of both BSF and emitter. The solar cells prepared with this approach (cells #4 and #5) are also reported in Table 1. For both cells, the efficiencies are 23.0%. FF = 81% obtained for the 1-cm2 wide cell indicates that the well-passivated 20-μm wide gap is large enough to isolate the BSF from the emitter fingers. For both approaches shown in Fig. 1, FF values of 80% or higher have been obtained, proving that both processes allow for very well separated BSF and emitter fingers, thus minimizing shunting losses. The EQE curve for Cell # 1 and its loss analysis based on TCAD opto-electrical simulation are shown in Fig. 2. The validation of the modelling is presented in our previous work [40]. A perfect match is obtained between the measured and the simulated EQE spectra. Based on Fig. 2, main losses come from two aspects: (1) the high FCA in the n+/p+ poly-Si finger regions at the rear of the cell, and (2) the reflection loss from the front side of the cell. In order to quench the poly-Si FCA optical loss, thinner and more transparent p+ and n+ layers based on poly-SiOx are proposed [23–27] to replace the > 250-nm thick poly-Si films in the role of CSPCs. It was demonstrated that such CSPCs based on poly-SiOx and their application in solar cells can enhance the infrared light response of the IBC solar cells [27]. Here we report on how we minimized the reflection loss arising the front side of the solar cell. We propose a novel approach that quenches the reflectance spectrum to values as low as those from b-Si [33], while maintaining state-of-the-art passivation for the FSF. This approach is achieved by superposing a nano-textured SiO2 layer on top of the passivating stack, coating the pyramidally-textured front Si surface. In the following section, the preparation, optical performance and the passivation properties of such ARC will be discussed. 3.2 Modulated surface textured passivation stack On the front side of the IBC solar cell of this work, an a-Si:H (5 nm) / SiNx:H (75 nm) stack is used as passivating structure for the random pyramidally-textured FSF. Even though the SiNx:H layer acts as ARC, a high reflection loss can still be observed, as discussed in Section III (A), see Fig. 2. To drastically reduce such a loss, we superpose high-aspect ratio nano-features on the micro-scale pyramids at the front side of the c-Si bulk. This is what we call modulated surface texturing (MST [41,42]), which allows for broad-band anti-reflective effect and efficient light scattering in the cell. In addition, we embed in our MST-ARC high-quality passivation properties. It is fabricated by coating the SiNx:H ARC layer with a 2-µm thick low-temperature PECVD SiO2 layer, followed by wet etching in HF to form the nano-textures [43]. The surface morphology of the samples as a function of the HF (0.55%) dip duration is shown in Fig. 3. As etching time increases, nano-meter scale SiO2 needles appear on the surface. The needles exist until the SiO2 layer is totally etched away. The samples shown in Fig. 3 are symmetrical passivation test samples endowed with FSF and a-Si:H / SiNx:H / (nano-textured) SiO2 as passivation stack. Compared to the standard a-Si:H / SiNx:H passivation stack for FSF (J 0 = 6.5 fA/cm2), the obtained J 0,FSF/a-Si:H/SiNx:H/SiO2 is 6.3 fA/cm2 after the SiO2 layer deposition, see Fig. 3(a). This indicates that the deposition of the SiO2 does not affect the passivation properties at the FSF. Increasing the etching time until 3.5 min, the passivation keeps the same. After etching for 4.5 min, the J 0 increases to 8.3 fA/cm2, which is attributed to the too thin SiNx:H layer in the valleys between pyramids. In fact, it can be seen from Fig. 3(b) that the SiO2 layer is much thinner in the valleys than on pyramid facets and tips. When the HF dip is operated, the SiO2 layer in the valley is etched away, leaving exposed the passivating SiNx:H layer to be unintentionally thinned. Measurements of reflectance (R) are conducted on these samples to evaluate their light in-coupling and trapping enhancement. The results are shown in Fig. 4 and compared to the reference sample with 75-nm thick SiNx:H as ARC on randomly pyramid textured Si surface and to a b-Si sample, which is prepared by reactive ion etching, similarly to previously reported [33,42]. All MST-ARC samples with nano-textured SiO2 layers exhibit a lower reflectance than that for the SiNx:H ARC reference sample, over nearly the whole wavelength range, except at around 580 ± 70 nm, where the 75-nm SiNx:H ARC shows its minimal reflectance. In addition, MST-ARC samples etched for 1.5 min and 2.5 min perform very closely to the b-Si reference, achieving R < 1% between 450 and 1000 nm. Compared to b-Si technology, the approach proposed in this work is superior from passivation perspective, owing to the fact that the optical enhancement is decoupled from the excellent FSF passivation ensured by the a-Si:H / SiNx:H stack. Actually, most of the state-of-the-art passivation technologies used in the academy researches and industries could be used in place of a-Si:H / SiNx:H stack, such as Al2O3 and Silicon-Heterojunction (a-Si:H alloys) passivation layers. 3.3 IBC solar cells with MST-ARC In order to realize this optical enhancement in solar cells, we applied the MST-ARC process steps in an IBC solar cell fabricated with the etch-back process (see Fig. 1 (B-sequence)). In this solar cell, the morphology of the cell front side is the same as that shown in Fig. 3(c) for ensuring an optimal FSF passivation. The solar cell result is listed in Table 1, as cell #5. A J SC as high as 42.2 mA/cm2 is obtained from the I-V measurement, which is mainly attributed to the enhanced light management exhibited by the MST-ARC. With this novel ARC approach, the solar cell surface is as black as those obtained by the b-Si approach [33]. However, as mentioned above, since the optics are decoupled from the passivation of the Si surface, our MST-ARC opens up more opportunities to optimize independently the passivation and the light management. Therefore, a solar cell V OC of 701 mV was achieved, which is higher than the one reported for the 22.1% state-of-the-art black silicon solar cell [33]. Currently, the conversion efficiency of this cell is 23% and is limited by the conductivity of the thin e-Beam evaporated Al fingers. The EQE curve of cell # 5 is shown in Fig. 5 alongside that of cell # 1 (pyramidally-textured c-Si surface covered with SiNx as ARC) as reference. Compared to cell # 1, cell # 5 shows higher spectral response over nearly the whole wavelength range, which is more obvious for wavelengths below 450 nm and above 800 nm. A further optimization of the nano-textured SiO2 layer thickness and morphology, and of the underneath SiNx:H layer thickness can further lower the reflection in the shorter wavelength range. Also, replacing a-Si:H / SiNx:H passivating stack for the FSF with non-absorbing passivation layers, such as a single SiNx:H layer, will avoid the parasitic absorption otherwise due to the a-Si: H. Therefore, a further enhancement in the shorter wavelength range response is expected. 4 Conclusion In this paper we presented the ion-implanted poly-Si with tunnelling SiO2 as carrier selective passivating contacts (CSPCs) for application in IBC solar cells. Two different patterning approaches are used to pattern the poly-Si layers (BSF and emitter). Both approaches allow for very well separated BSF and emitter fingers with a well-passivated gap between them, thus minimizing shunting losses. We developed a novel MST-ARC approach for solar cell application, which is achieved by superposing the nano-textured SiO2 layer on the a-Si:H / SiNx passivation layers coating micro-scale pyramids. This approach decouples light management from surface passivation, since it enables similar level of low reflectance with respect to that of b-Si reference, while maintaining as high-quality passivation properties as in case of the random pyramidally-textured Si surface. A very high J SC value of 42.2 mA/cm2 was obtained in the IBC solar cell with such MST-ARC. The EQE curve of this cell shows the spectral response enhancement over the whole wavelength range with respect to the standard SiNx ARC. The best IBC solar cells obtained in this work shows an efficiency as high as 23.0%, with the potential to reach 24% by solving the limits of metal finger conductivity. Acknowledgements This work was carried out with a subsidy of the Dutch Ministry of Economic Affairs (TKI Solar Energy projects) and has received funding from the European Union's Horizon2020 Programme for research, technological development and demonstration under Grant Agreement no. 727523. References [1] K. Ding U. Aeberhard F. Finger U. Rau Optimized amorphous silicon oxide buffer layers for silicon heterojunction solar cells with microcrystalline silicon oxide contact layers Phys. Status Solidi.: Rapid Res. Lett. 6 2012 193 195 [2] H.A. Gatz J.K. Rath M.A. Verheijen W.M.M. Kessels R.E.I. Schropp Silicon heterojunction solar cell passivation in combination with nanocrystalline silicon oxide emitters Phys. Status Solidi A: Appl. Mater. Sci. 213 2016 1932 1936 [3] D. Zhang D. Deligiannis G. Papakonstantinou R.A.C.M.M. van Swaaij M. Zeman Optical enhancement of silicon heterojunction solar cells with hydrogenated amorphous silicon carbide emitter IEEE J. Photovolt. 4 2014 1326 1330 [4] A. Tomasi B. Paviet-Salomon Q. Jeangros J. Haschke G. Christmann L. Barraud A. Descoeudres J.P. Seif S. Nicolay M. Despeisse S. De Wolf C. Ballif Simple processing of back-contacted silicon heterojunction solar cells using selective-area crystalline growth Nat. Energy 2 2017 17062 [5] S.W. Glunz, F. Feldmann, A. Richter, M. Bivour, C. Reichel, H. Steinkemper, J. Benick, M. Hermle, The irresistible charm of a simple current flow pattern 25% with a solar cell featuring a full area back contact, in: Proceedings of the 31st European Photovoltaic Solar Energy Conference and Exhibition, Hamburg, 2015. [6] M. Rienäcker A. Merkle U. Römer H. Kohlenberg J. Krügener R. Brendel R. Peibst Recombination behavior of photolithography-free back junction back contact solar cells with carrier-selective polysilicon on oxide junctions for both polarities Energy Procedia 92 2016 412 418 [7] D. Yan, A. Cuevas, S. Phang, Y. Wan, J. Bullock, A. Liu, D. Macdonald, Industrially Compatible n+ polySi/SiOx Electron-Selective Conductors for High Efficiency Silicon Solar Cells, in: Proceedings of the 8th SiliconPV, Lausanne. [8] D.L. Young W. Nemeth V. LaSalvia M.R. Page S. Theingi J. Aguiar B.G. Lee P. Stradins Low-cost plasma immersion ion implantation doping for interdigitated back passivated contact (IBPC) solar cells Sol. Energy Mater. Sol. Cells 158 1 2016 68 76 [9] J. Geissbühler J. Werner S.M. de Nicolas L. Barraud A. Hessler-Wyser M. Despeisse S. Nicolay A. Tomasi B. Niesen S. De Wolf C. Ballif 22.5% efficient silicon heterojunction solar cell with molybdenum oxide hole collector Appl. Phys. Lett. 107 2015 081601 [10] X. Yang Q. Bi H. Ali K. Davis W.V. Schoenfeld K. Weber High-performance TiO2-based electron-selective contacts for crystalline silicon solar cells Adv. Mater. 28 28 2016 5891 5897 [11] K. Yoshikawa H. Kawasaki W. Yoshida T. Irie K. Konishi K. Nakano T. Uto D. Adachi M. Kanematsu H. Uzu K. Yamamoto Silicon heterojunction solar cell with interdigitated back contacts for a photoconversion efficiency over 26% Nat. Energy 2 2017 17032 [12] A. Tomasi B. Paviet-Salomon D. Lachenal S.M. de Nicolas A. Descoeudres J. Geissbuhler S. De Wolf C. Ballif Back-contacted silicon heterojunction solar cells with efficiency > 21% IEEE J. Photovolt. 4 2014 1046 1054 [13] K. Masuko M. Shigematsu T. Hashiguchi D. Fujishima M. Kai N. Yoshimura T. Yamaguchi Y. Ichihashi T. Mishima N. Matsubara T. Yamanishi T. Takahama M. Taguchi E. Maruyama S. Okamoto Achievement of more than 25% conversion efficiency with crystalline silicon heterojunction solar cell IEEE J. Photovolt. 4 6 2014 1433 1435 [14] X. Yang K. Weber Z. Hameiri S. De Wolf , Industrially feasible, dopant-free, carrier-selective contacts for high-efficiency silicon solar cells Prog. Photovolt.: Res. Appl. 25 2017 896 904 [15] E. Yablonovitch T. Gmitter R.M. Swanson Y.H. Kwark A 720 mV open circuit voltage SiOx:c‐Si:SiOx double heterostructure solar cell Appl. Phys. Lett. 47 1985 1211 [16] A. Moldovan F. Feldmann M. Zimmer J. Rentsch J. Benick M. Hermle Tunnel oxide passivated carrier-selective contacts based on ultra-thin SiO2 layers Sol. Energy Mater. Sol. Cells 142 2015 123 127 [17] C. Reichel, F. Feldmann, R. Muller, A. Moldovan, M. Hermle, S.W. Glunz, Interdigitated Back Contact Silicon Solar Cells with Tunnel Oxide Passivated Contacts Formed by Ion Implantation, in: Proceedings of the 29th European PV Solar Energy Conference and Exhibition, Amsterdam, The Netherlands. [18] U. Römer R. Peibst T. Ohrdes B. Lim J. Krügener E. Bugiel T. Wietler R. Brendel Recombination behavior and contact resistance of n+ and p+ poly-crystalline Si/mono-crystalline Si junctions Sol. Energy Mater. Sol. Cells 131 2014 85 91 [19] 〈https://isfh.de/en/forschung/photovoltaik/projekte/26-2/〉 (Accessed 12 March 2018). [20] G. Nogay J. Stuckelberger P. Wyss E. Rucavado C. Allebé T. Koida M. Morales-Masis M. Despeisse F.-J. Haug P. Löper C. Ballif Interplay of annealing temperature and doping in hole selective rear contacts based on silicon-rich silicon-carbide thin films Sol. Energy Mater. Sol. Cells 173 2017 18 24 [21] G. Yang A. Ingenito O. Isabella M. Zeman IBC c-Si solar cells based on ion-implanted poly-silicon passivating contacts Sol. Energy Mater. Sol. Cells 158 1 2016 84 90 [22] See 〈https://isfh.de/en/26-1-record-efficiency-for-p-type-crystalline-si-solar-cells/〉 for information on the >26% IBC solar cell with poly-Si passivating contacts (Accessed 20 February 2018). [23] G. Yang, A. Ingenito, O. Isabella, M. Zeman, patent, The Netherlands, NLB1 2013722, 2015. [24] J. Stuckelberger G. Nogay P. Wyss Q. Jeangros C. Allebé F. Debrot X. Niquille M. Ledinsky A. Fejfar M. Despeisse F.J. Haug P. Löper C. Ballif Sol. Energy Mater. Sol. Cells 158 2016 2 [25] I. Mack J. Stuckelberger P. Wyss G. Nogay Q. Jeangros J. Horzel C. Allebé M. Despeisse F.-J. Haug A. Ingenito P. Löper C. Ballif Properties of mixed phase silicon-oxide-based passivating contacts for silicon solar cells Sol. Energy Mater. Sol. Cells 181 2018 9 [26] O. Isabella, G. Yang, P. Procel, M. Zeman, patent, The Netherlands E00057 NL (2017), 2017. [27] G. Yang P. Guo P. Procel A. Weeber O. Isabella M. Zeman Poly-crystalline silicon-oxide films as carrier-selective passivating contacts for c-Si solar cells Appl. Phys. Lett. 112 2018 193904 [28] S. Chhajed M.F. Schubert J.K. Kim E.F. Schubert Nanostructured multilayer graded-index antireflection coating for Si solar cells with broadband and omnidirectional characteristics Appl. Phys. Lett. 93 25 2008 251108 [29] M.P. Lumb W. Yoon C.G. Bailey D. Scheiman J.G. Tischler R.J. Walters Modeling and analysis of high-performance, multicolored anti-reflection coatings for solar cells Opt. Express 21 S4 2013 A585 A594 [30] S.J. Oh S. Chhajed D.J. Poxson J. Cho E.F. Schubert S.J. Tark D. Kim J.K. Kim Enhanced broadband and omni-directional performance of polycrystalline Si solar cells by using discrete multilayer antireflection coatings Opt. Express 21 S1 Suppl 1 2013 A157 A166 [31] M.F. Schubert F.W. Mont S. Chhajed D.J. Poxson J.K. Kim E.F. Schubert Design of multilayer antireflection coatings made from co-sputtered and low-refractive-index materials by genetic algorithm Opt. Express 16 8 2008 5290 5298 [32] C. Hsu J. Wu Y. Lu D.J. Flood A.R. Barron L. Chen Fabrication and characteristics of black silicon for solar cell applications: an overview Mater. Sci. Semicond. Process. 25 2014 2 17 [33] A. Ingenito O. Isabella M. Zeman Experimental demonstration of 4n2 classical absorption limit in nanotextured ultrathin solar cells with dielectric omnidirectional back reflector ACS Photonics 1 3 2014 270 278 [34] H. Savin P. Repo G. von Gastrow P. Ortega E. Calle M. Garín R. Alcubilla Black silicon solar cells with interdigitated back-contacts achieve 22.1% efficiency Nat. Nanotechnol. 89 2015 624 [35] M. Otto M. Kroll T. Käsebier R. Salzer R.B. Wehrspohn Conformal Al2O3 coatings on black silicon by thermal ALD for surface passivation Energy Procedia 27 2012 361 364 [36] I.T.S. Heikkinen P. Repo V. Vähänissi T. Pasanen V. Malinen H. Savin Efficient surface passivation of black silicon using spatial atomic layer deposition Energy Procedia 124 2017 282 287 [37] R.A. Sinton A. Cuevas Contactless determination of current–voltage characteristics and minority‐carrier lifetimes in semiconductors from quasi‐steady‐state photoconductance data Appl. Phys. Lett. 69 1996 2510 [38] A. Ingenito O. Isabella M. Zeman Simplified process for high efficiency, self-aligned IBC c-Si solar cells combining ion implantation and epitaxial growth: design and fabrication Sol. Energy Mater. Sol. Cells 157 2016 354 365 [39] G. Yang Y. Zhang P. Procel A. Weeber O. Isabella M. Zeman Poly-Si(O)x passivating contacts for high-efficiency c-Si IBC solar cells Energy Procedia 124 2017 392 399 [40] P. Procel, G. Yang, O. Isabella, M. Zeman, Opto-electrical modelling of IBC solar cells based on poly-Si or heterojunction carrier-selective passivating contacts, in: Proceedings of the 35th European Photovoltaic Solar Energy Conference and Exhibition, Amsterdam. [41] O. Isabella J. Krč M. Zeman Modulated surface textures for enhanced light trapping in thin-film silicon solar cells Appl. Phys. Lett. 97 2010 101106 [42] A. Ingenito O. Isabella M. Zeman Nano-cones on micro-pyramids: modulated surface textures for maximal spectral response and high-efficiency solar cells Progress. Photovolt.: Res. Appl. 23 11 2015 1649 1659 [43] G. Yang, O. Isabella, M. Zeman, patent, The Netherlands, 017880NL.", "scopus-id": "85048861921", "coredata": {"eid": "1-s2.0-S0927024818303088", "dc:description": "In this work, we present the application of poly-Si carrier-selective passivating contacts (CSPCs) as both polarities in interdigitated back-contacted (IBC) solar cell architectures. We compared two approaches to form a gap between the back-surface field (BSF) and emitter fingers. It is proved that the gaps prepared by both approaches are efficient in preventing carriers’ recombination. To minimize the reflection losses, we developed a novel modulated surface texturing (MST) structure as anti-reflection coating (ARC). It is obtained by superposing a nano-textured SiO2 layer on the conventional micro-textured pyramids, which are passivated with a-Si:H / SiNx:H layers. This approach decouples the light harvesting from the Si surface passivation, which potentially results in the highest possible optical and electrical performances of the solar cells. The reflectance (R) of the MST-ARC is very close to that of the high-aspect ratio nano-structured silicon (black-Silicon), achieving R < 1% between 450 and 1000 nm. The J 0 of MST-ARC passivated Si surface (6.3 fA/cm2) is the same as that of standard a-Si:H/SiNx:H layers passivated pyramidally-textured Si surface. By applying this novel MST-ARC in our IBC solar cell, the highest J SC observed in a device is 42.2 mA/cm2 with a V OC as high as 701 mV. A spectral response enhancement in case of the MST-ARC cell is observed over the whole wavelength range with respect to the cell with standard SiNx:H ARC. The highest efficiency achieved in this work is 23.0%, with the potential to reach 24.0% in short term by using more conductive metal fingers.", "openArchiveArticle": "false", "prism:coverDate": "2018-11-30", "openaccessUserLicense": null, "prism:aggregationType": "Journal", "prism:url": "https://api.elsevier.com/content/article/pii/S0927024818303088", "dc:creator": [{"@_fa": "true", "$": "Yang, Guangtao"}, {"@_fa": "true", "$": "Guo, Peiqing"}, {"@_fa": "true", "$": "Procel, Paul"}, {"@_fa": "true", "$": "Limodio, Gianluca"}, {"@_fa": "true", "$": "Weeber, Arthur"}, {"@_fa": "true", "$": "Isabella, Olindo"}, {"@_fa": "true", "$": "Zeman, Miro"}], "link": [{"@_fa": "true", "@rel": "self", "@href": "https://api.elsevier.com/content/article/pii/S0927024818303088"}, {"@_fa": "true", "@rel": "scidir", "@href": "https://www.sciencedirect.com/science/article/pii/S0927024818303088"}], "dc:format": "application/json", "openaccessType": null, "pii": "S0927-0248(18)30308-8", "prism:volume": "186", "prism:publisher": "Published by Elsevier B.V.", "dc:title": "High-efficiency black IBC c-Si solar cells with poly-Si as carrier-selective passivating contacts", "prism:copyright": "© 2018 Published by Elsevier B.V.", "openaccess": "0", "prism:issn": "09270248", "dcterms:subject": [{"@_fa": "true", "$": "Poly-silicon"}, {"@_fa": "true", "$": "Carrier selective passivating contact"}, {"@_fa": "true", "$": "Light in-coupling"}, {"@_fa": "true", "$": "IBC c-Si solar cells"}], "openaccessArticle": "false", "prism:publicationName": "Solar Energy Materials and Solar Cells", "openaccessSponsorType": null, "prism:pageRange": "9-13", "prism:endingPage": "13", "pubType": "fla", "prism:coverDisplayDate": "November 2018", "prism:doi": "10.1016/j.solmat.2018.06.019", "prism:startingPage": "9", "dc:identifier": "doi:10.1016/j.solmat.2018.06.019", "openaccessSponsorName": null}, "objects": {"object": [{"@category": "thumbnail", "@height": "123", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818303088-fx1.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "20735", "@ref": "fx1", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "53", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818303088-gr1.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "14458", "@ref": "gr1", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "164", "@width": "202", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818303088-gr2.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "22021", "@ref": "gr2", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "123", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818303088-gr3.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "24990", "@ref": "gr3", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "147", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818303088-gr4.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "22587", "@ref": "gr4", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "162", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818303088-gr5.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "28902", "@ref": "gr5", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "200", "@width": "356", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818303088-fx1.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "58189", "@ref": "fx1", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "197", "@width": "809", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818303088-gr1.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "87190", "@ref": "gr1", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "244", "@width": "301", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818303088-gr2.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "59990", "@ref": "gr2", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "381", "@width": "678", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818303088-gr3.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "105232", "@ref": "gr3", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "225", "@width": "336", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818303088-gr4.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "59255", "@ref": "gr4", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "252", "@width": "339", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818303088-gr5.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "72622", "@ref": "gr5", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "886", "@width": "1576", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818303088-fx1_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "320754", "@ref": "fx1", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "871", "@width": "3583", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818303088-gr1_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "548379", "@ref": "gr1", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "1082", "@width": "1333", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818303088-gr2_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "285545", "@ref": "gr2", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "1687", "@width": "3000", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818303088-gr3_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "996977", "@ref": "gr3", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "999", "@width": "1489", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818303088-gr4_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "315107", "@ref": "gr4", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "1113", "@width": "1500", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024818303088-gr5_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "402344", "@ref": "gr5", "@mimetype": "image/jpeg"}]}, "link": {"@rel": "abstract", "@href": "https://api.elsevier.com/content/abstract/scopus_id/85048861921"}}