{"scopus-eid": "2-s2.0-84867236777", "originalText": "serial JL 271495 291210 291731 291732 291746 291809 291864 291865 291892 291893 31 Solar Energy Materials and Solar Cells SOLARENERGYMATERIALSSOLARCELLS 2012-10-10 2012-10-10 2012-11-26T19:37:28 1-s2.0-S0927024812004400 S0927-0248(12)00440-0 S0927024812004400 10.1016/j.solmat.2012.09.016 S300 S300.1 FULL-TEXT 1-s2.0-S0927024812X00114 2015-05-15T03:20:14.179583-04:00 0 0 20130101 20130131 2013 2012-10-10T00:00:00Z articleinfo crossmark dco dateupdated tomb dateloaded datesearch indexeddate volumelist yearnav absattachment articletitlenorm authfirstinitialnorm authfirstsurnamenorm cid cids confeditor contenttype copyright dateloadedtxt docsubtype doctype doi eid ewtransactionid hubeid issn issnnorm itemstage itemtransactionid itemweight openaccess openarchive pg pgfirst pglast pii piinorm pubdateend pubdatestart pubdatetxt pubyr sectiontitle sortorder srctitle srctitlenorm srctype subheadings suppl vol volfirst volissue webpdf webpdfpagecount figure table body acknowledge affil articletitle auth authfirstini authfull authkeywords authlast primabst ref specialabst alllist content subj ssids 0927-0248 09270248 false 108 108 C Volume 108 16 93 97 93 97 201301 January 2013 2013-01-01 2013-01-31 2013 Selected publications from the 22nd Space Photovoltaic Research and Technology (SPRAT) Conference Jeremiah S. McNatt Michael H.-C. Jin Dave A. Scheiman Regular Articles article fla Copyright © 2012 Elsevier B.V. All rights reserved. FABRICATIONMICRONANOSURFACETEXTUREBYCSCLLITHOGRAPHYANTIREFLECTIONPHOTOELECTRONICPROPERTIESFORSOLARCELLS LIU J 1 Introduction 2 Experimental details 3 Results and discussion 3.1 The morphology of micro-nano structure 3.2 Antireflection property of micro-nano structure 3.3 Photoelectric property of micro-nano structure 4 Conclusions Acknowledgments References HUA 2010 258 262 X RESTREPO 1976 1195 1197 F NISHIMOTO 2000 393 402 Y ZHENQIANGXI 2003 255 263 D SUN 2009 9301 9304 L CHEN 2010 629 633 J PENG 2005 1062 1067 K WANG 2010 024301-1 024301-3 F HWANG 2000 33 39 N STRIEMER 2002 2980 2982 C ZHOU 2011 053513-1 053513-5 J LIU 2011 375 379 J LIAO 2010 465302-1 465302-5 Y JIANGHONG 2010 5 10 W SENWANG 2007 061105-1 061105-3 X LIUX2013X93 LIUX2013X93X97 LIUX2013X93XJ LIUX2013X93X97XJ item S0927-0248(12)00440-0 S0927024812004400 1-s2.0-S0927024812004400 10.1016/j.solmat.2012.09.016 271495 2012-11-26T17:33:29.736957-05:00 2013-01-01 2013-01-31 1-s2.0-S0927024812004400-main.pdf https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024812004400/MAIN/application/pdf/6268a3b70fe3c2db1199da63d81afb20/main.pdf https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024812004400/MAIN/application/pdf/6268a3b70fe3c2db1199da63d81afb20/main.pdf main.pdf pdf true 873492 MAIN 5 1-s2.0-S0927024812004400-main_1.png https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024812004400/PREVIEW/image/png/21782686c1986432635c12c0a5991aac/main_1.png https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024812004400/PREVIEW/image/png/21782686c1986432635c12c0a5991aac/main_1.png main_1.png png 60945 849 656 IMAGE-WEB-PDF 1 1-s2.0-S0927024812004400-fx1.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024812004400/fx1/DOWNSAMPLED/image/jpeg/ec7773ae2e4f77015f0dd33095d58c9c/fx1.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024812004400/fx1/DOWNSAMPLED/image/jpeg/ec7773ae2e4f77015f0dd33095d58c9c/fx1.jpg fx1 true fx1.jpg jpg 25091 210 500 IMAGE-DOWNSAMPLED 1-s2.0-S0927024812004400-fx1.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024812004400/fx1/THUMBNAIL/image/gif/6a8d822adb497f0b1e9bac27b9b758f9/fx1.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024812004400/fx1/THUMBNAIL/image/gif/6a8d822adb497f0b1e9bac27b9b758f9/fx1.sml fx1 true fx1.sml sml 6626 92 219 IMAGE-THUMBNAIL 1-s2.0-S0927024812004400-gr1.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024812004400/gr1/DOWNSAMPLED/image/jpeg/25ebf2d0a5fbbf3fee467543bb9f0833/gr1.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024812004400/gr1/DOWNSAMPLED/image/jpeg/25ebf2d0a5fbbf3fee467543bb9f0833/gr1.jpg gr1 gr1.jpg jpg 22728 241 340 IMAGE-DOWNSAMPLED 1-s2.0-S0927024812004400-gr1.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024812004400/gr1/THUMBNAIL/image/gif/9177d239eabacdb392a89f0aead2ff1f/gr1.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024812004400/gr1/THUMBNAIL/image/gif/9177d239eabacdb392a89f0aead2ff1f/gr1.sml gr1 gr1.sml sml 5708 155 219 IMAGE-THUMBNAIL 1-s2.0-S0927024812004400-gr2.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024812004400/gr2/DOWNSAMPLED/image/jpeg/68eb5e730efd229031c358d5789e808d/gr2.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024812004400/gr2/DOWNSAMPLED/image/jpeg/68eb5e730efd229031c358d5789e808d/gr2.jpg gr2 gr2.jpg jpg 96663 819 357 IMAGE-DOWNSAMPLED 1-s2.0-S0927024812004400-gr2.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024812004400/gr2/THUMBNAIL/image/gif/e355788463cfc255ef1b281f02c4f6c1/gr2.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024812004400/gr2/THUMBNAIL/image/gif/e355788463cfc255ef1b281f02c4f6c1/gr2.sml gr2 gr2.sml sml 3851 163 71 IMAGE-THUMBNAIL 1-s2.0-S0927024812004400-gr3.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024812004400/gr3/DOWNSAMPLED/image/jpeg/7c150bbcffdc20a46e0cfa138e17450c/gr3.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024812004400/gr3/DOWNSAMPLED/image/jpeg/7c150bbcffdc20a46e0cfa138e17450c/gr3.jpg gr3 gr3.jpg jpg 63498 780 339 IMAGE-DOWNSAMPLED 1-s2.0-S0927024812004400-gr3.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024812004400/gr3/THUMBNAIL/image/gif/61818f4a6fc4a6534c445990c82a5690/gr3.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024812004400/gr3/THUMBNAIL/image/gif/61818f4a6fc4a6534c445990c82a5690/gr3.sml gr3 gr3.sml sml 3276 163 71 IMAGE-THUMBNAIL 1-s2.0-S0927024812004400-gr4.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024812004400/gr4/DOWNSAMPLED/image/jpeg/369db02eafe741228b353899a6a6c61e/gr4.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024812004400/gr4/DOWNSAMPLED/image/jpeg/369db02eafe741228b353899a6a6c61e/gr4.jpg gr4 gr4.jpg jpg 42042 527 339 IMAGE-DOWNSAMPLED 1-s2.0-S0927024812004400-gr4.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024812004400/gr4/THUMBNAIL/image/gif/c68e14752fb8b3e07f7abeec4661833e/gr4.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024812004400/gr4/THUMBNAIL/image/gif/c68e14752fb8b3e07f7abeec4661833e/gr4.sml gr4 gr4.sml sml 3172 163 105 IMAGE-THUMBNAIL 1-s2.0-S0927024812004400-gr5.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024812004400/gr5/DOWNSAMPLED/image/jpeg/d5713642879752bba0dcd98ff6a0667e/gr5.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024812004400/gr5/DOWNSAMPLED/image/jpeg/d5713642879752bba0dcd98ff6a0667e/gr5.jpg gr5 gr5.jpg jpg 10709 101 190 IMAGE-DOWNSAMPLED 1-s2.0-S0927024812004400-gr5.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024812004400/gr5/THUMBNAIL/image/gif/3360ce07c99c4b2c8003ac1482ff529c/gr5.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024812004400/gr5/THUMBNAIL/image/gif/3360ce07c99c4b2c8003ac1482ff529c/gr5.sml gr5 gr5.sml sml 2291 117 219 IMAGE-THUMBNAIL 1-s2.0-S0927024812004400-gr6.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024812004400/gr6/DOWNSAMPLED/image/jpeg/f79d7e2b78a0c80f5eeba0c8353d1294/gr6.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024812004400/gr6/DOWNSAMPLED/image/jpeg/f79d7e2b78a0c80f5eeba0c8353d1294/gr6.jpg gr6 gr6.jpg jpg 21368 254 339 IMAGE-DOWNSAMPLED 1-s2.0-S0927024812004400-gr6.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024812004400/gr6/THUMBNAIL/image/gif/ee1e703413d59167a1596d5b6fb193d5/gr6.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024812004400/gr6/THUMBNAIL/image/gif/ee1e703413d59167a1596d5b6fb193d5/gr6.sml gr6 gr6.sml sml 5069 164 219 IMAGE-THUMBNAIL 1-s2.0-S0927024812004400-gr7.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024812004400/gr7/DOWNSAMPLED/image/jpeg/95541e06b4b55d7e36dee1ab9a0cf429/gr7.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024812004400/gr7/DOWNSAMPLED/image/jpeg/95541e06b4b55d7e36dee1ab9a0cf429/gr7.jpg gr7 gr7.jpg jpg 34074 538 339 IMAGE-DOWNSAMPLED 1-s2.0-S0927024812004400-gr7.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0927024812004400/gr7/THUMBNAIL/image/gif/3a4090252e4cdeea1aade18d0153973b/gr7.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0927024812004400/gr7/THUMBNAIL/image/gif/3a4090252e4cdeea1aade18d0153973b/gr7.sml gr7 gr7.sml sml 2719 163 103 IMAGE-THUMBNAIL SOLMAT 6379 S0927-0248(12)00440-0 10.1016/j.solmat.2012.09.016 Elsevier B.V. Fig. 1 Process of fabricating silicon micro-nano surface texture by CsCl self-assembly lithography and dry etching: (a) making pyramidal structure, (b) deposition of CsCl film, (c) development for CsCl islands, (d) etching of silicon by ICP for nanopillars, (e) removal of CsCl resist. Fig. 2 SEM images: (a) top-view and cross-sectional morphology of micro-pyramidal structure textured in the NaOH, Na2SiO39 H2O, IPA solution and DI water at 80°C for 25min. (b) Tilted top-view and cross-sectional images of micro-nano surface texture. (c) Tilted top-view images of single nanopillar arrays. (b) and (c) are under the same etching conditions. Fig. 3 Cross-sectional SEM images of pyramids covered by nanopillar arrays with different average diameters (a) 100nm, (b) 200nm, (c) 500nm. All pictures are magnified at 10.0k. Fig. 4 Reflectance curves of (a) planar wafer, pyramid, nanopillar arrays and micro-nano structure, (b) pyramid structure with different nanopillar arrays of average diameter from 100 to 500nm. Fig. 5 Diagrammatic drawing of reflection measurement. Fig. 6 Distribution of reflected light when white parallel light comes at incidence angle 45° and the illumination of planar wafer is divided by 80. Fig. 7 I–V curves for solar cells (a) with different surfaces of planar, pyramid, nanopillar and micro-nano (the sizes of pillars for nanopillar and micro-nano have the same profile of 200nm diameter and 1μm height), (b) having pyramid with different nanopillars. Table 1 ICP etching conditions for Fig. 3 (DN is the average diameter of nanoislands, airflow the C4F8:SF6:He, EP the excitation power, BP the bias power, CP the chamber pressure and ET the etching time). DN (nm) Airflow (sccm) EP (W) BP (W) CP (Pa) ET (min) d=100nm h=500nm 200 150:60:10 260 10 4.0 11 d=200nm h=1μm 300 150:60:10 400 30 4.6 4 d=500nm h=1.5μm 600 150:60:10 400 30 4.6 6 Table 2 Solar cell parameters: short circuit current density (J sc), open circuit voltage (V oc), fill factor (FF), photovoltaic conversion efficiency (η), series (R s) and shunt (R sh) resistances. Surface texture J sc(mA/cm2) V oc(mV) FF η (%) R s (Ω) R sh(Ω) Planar 18.74 502 66.32 6.08 0.172 249.04 Pyramid 19.44 500 68.38 6.45 0.198 238.89 Nanopillar 21.05 486 64.51 6.58 0.250 219.60 Micro-nano 21.98 477 68.64 7.05 0.286 115.09 Table 3 Solar cell parameters of pyramid with different average diameter nanopillars. Diameter of nanopillar (nm) J sc (mA/cm2) V oc (mV) FF η (%) R s (Ω) R sh(Ω) 100 22.30 475 66.36 7.02 0.308 120.04 200 21.98 477 68.64 7.05 0.286 115.09 500 21.12 480 68.78 7.04 0.254 134.22 Fabrication of micro-nano surface texture by CsCl lithography with antireflection and photoelectronic properties for solar cells Jing Liu a b Marina Ashmkhan a b Gangqiang Dong b Bo Wang a Futing Yi a ⁎ a Institute of High Energy Physics of Chinese Academy of Science, Beijing 100049, China b University of Chinese Academy of Science, Beijing 100049, China ⁎ Corresponding author. Tel.: +86 10 8823 5983. A pyramid and nanopillar micro-nano surface texture of silicon wafer, which has pyramid arrays about 4–8μm with different nanopillars of average diameter from 100 to 500nm and height from 500nm to 1.5μm, is fabricated by Cesium Chloride (CsCl) self-assembly lithography and dry etching for solar cell. This micro-nano surface texture with 100 and 200nm average diameter has very good antireflection with reflectance below 5% for the wavelength ranging from 400 to 1000nm and much lower than that of single pyramid or nanopillar arrays with the same average diameter. The reflected distribution of this micro-nano structure illuminated with white parallel light at incidence angle of 45° is tested by a irradiatometer at the reflected angle from 10 to 80 degree and shows a total diffuse and very low reflection at different reflected angles, which benefits from both the advantages of nanopillar and pyramid structure. The solar cell with this micro-nano texture has been finished with thermal diffusion of Phosphorus for P–N junction and printing silver plasma for front electrode poles, and its photovoltaic conversion efficiency is about 7.05% which is higher than that of solar cell only with the planar, single pyramid or nanopillar and made with the same fabricating process. Graphical abstract Highlights ► Cesium Chloride self-assembly and dry etching is used to make micro-nano texture. ► Pyramid arrays with different diameter nanopillars are fabricated with this method. ► Reflectance of the micro-nano surface texture is reduced to below 5%. ► Reflection of micro-nano structure is a total diffuse reflection. ► Efficiency of solar cell with this micro-nano texture is about 7.05%. Keywords Micro-nano texture Cesium chloride self-assembly Antireflection Photoelectronic property Solar cell 1 Introduction Using textured structure to reduce optical reflectivity is an indispensable process for silicon solar cells production. For conventional monocrystalline Si (c-Si) solar cells, it employed micrometer-range pyramid arrays for surface texturing to trap incident solar light, which are easily obtained by anisotropy corrosion of silicon using alkaline solution such as NaOH [1], KOH [2], Na2CO3 [3], Na3PO4 [4], etc. These micron-scale textures enhance photon absorption mainly by a geometric optics effect, giving some of reflected light a second chance to enter Si. Therefore, the surface reflection ratio can be reduced to 10% within the whole solar spectra [5]. In recent years, with the development of nanotechnology, silicon nanowires have received extensive interest due to the potential application in photovoltaic devices including solar cells for the surface morphology of silicon nanostructure making it possible to absorb more light and to reduce the reflectance. Many nanopillar fabrication methods have been created, such as nanoimprint lithography [6], silver (Ag) induced chemical etching [7,8], chemical vapor deposition (CVD) [9] and so on [10,11]. In this work, we incorporate micro-nano texture into Si wafer with micro pyramid texture and nanopillars by wet eroding and dry etching, and test the optical reflectivities of the micro-nano texture and photoelectronic properties of solar cells with the texture. The silicon nanopillars are fabricated by dry etching with the mask of cesium chloride (CsCl) islands originally from self-assembly method, which has the advantages of simple process with evaporation of thermal coating for CsCl film, growth of CsCl islands in humidity environment and dissolution of CsCl islands in water [12,13]. With this micro-nano surface texture, the reflectance of wafer is reduced to below 5% and much lower than that with single pyramid or single nanopillar arrays with the same average diameter for wavelength ranging from 400 to 1000nm, and the distribution of reflected light at different angles for the micro-nano structure is almost independent with reflected angle to form a total diffuse reflection. The low reflected property of this micro-nano texture benefits from both the advantages of antireflections of nanopillar and pyramid structure. The solar cells with micro-nano surface texture have been fabricated by diffusing of thermal Phosphorus and printing silver electrode poles, and its efficiency is about 7.05% and higher than 6.08% for planar solar cell and 6.58% for only nanopillar one with same fabricating process mainly from its good light trapping property of the micro-nano texture. 2 Experimental details P-type (100) polished monocrystalline silicon wafers with the resistivity of 1–3Ωcm and the thickness of 350μm are cleaned in H2O:H2SO4:H2O2 (6:4:1) to give a hydrophilic surface as substrates. The whole process of fabricating silicon micro-nano surface texture by CsCl self-assembly lithography and ICP etching is described in Fig. 1, and can be summarized in the following five steps. Firstly, fabrication of micro pyramids: cleaned wafers are textured in the NaOH (1.5wt%) solution, Na2SiO3.9H2O (1.5wt%) solution and IPA (6.5%) and DI water (90.5%) at 80°C for 25min to form pyramidal structures on the wafer surface shown in Fig. 1(a) [14]. Secondly, CsCl film is deposited by heat evaporation onto the surface of substrate in high vacuum system (0.01Pa) shown in Fig. 1(b). Thirdly, under certain humidity and temperature, some CsCl grow up to form CsCl nanoisland arrays on the wafer shown in Fig. 1(c). Then, the dry etching with inductively coupled plasma (ICP) is used to transfer the CsCl nanoislands to silicon nanopillar arrays on the pyramidal structures shown in Fig. 1(d). Finally, the wafer etched is soaked in DI water for one minute to remove the residual CsCl nanoislands, and the silicon micro-nano textures have been finished shown in Fig. 1(e). The wafer with micro-nano surface texture is subjected to phosphorus diffusion by liquid dopant source (POCl3) at 850°C to form the P–N junction for solar cells as conventional cell fabrication protocol. N2 gas goes through the liquid of POCl3 to take it into the quartz tunnel oven and the POCl3 decomposes into P2O5 and Cl2 with abundant O2, then the P2O5 deposits on the surface of wafer as a layer of phosphorosilicate glass of which P will diffused into the silicon further to from P–N junction with 12min diffusion under 850°C. The P–N junction has the sheet resistance of 40Ω/□, the P density of 1018/cm3 and the depth of 0.4μm for solar cell. Al paste is used for the back contact with back surface field (BSF) by firing for solidifying at 200°C in 20min and sintering for BSF at 600°C in 5min, and Ag paste is used for the front finger contacts by printing Ag paste on the silicon surface through metal shadow mask and firing at 220°C in 20min for solidifying and sintering at 750°C in 5min for Ohmic contact. 3 Results and discussion 3.1 The morphology of micro-nano structure Fig. 2 shows the results of SEM photos for the micro pyramidal, micro-nano, and nanopillar structures. Fig. 2(a) is only the morphology of textured substrate with 4–8μm pyramidal structure made by the anisotropic texturization of alkaline solution. Fig. 2(b) is the micro-nano structure of silicon nanopillars about 200nm average diameter and 1μm height on the micro-pyramids by ICP etching under the condition of C4F8:SF6:He=150:60:10sccm, excitation power 400W, bias power 30W and chamber pressure 4.6Pa for 4min, and Fig. 2(c) is only the nanopillars with 1μm height and 200nm average diameter on planar wafer for comparison. The CsCl islands as a kind of self-assembly nano structure can be made with different diameter by controlling the thickness of CsCl and the time and humidity of development for the growth of CsCl islands. The silicon nanopillars on pyramidal structure translated with the CsCl islands mask by ICP etching can be fabricated with average diameter ranging from 100 to 500nm for the research of antireflection and photoelectric properties of solar cells. Fig. 3 shows pyramids with different nanopillar arrays ranging from 100 to 500nm average diameter. For Fig. 3(a), the nanopillars are about 100nm average diameter and 500nm height, and the bigger nanopillars about 200nm average diameter 1μm height are shown in Fig. 3(b). Fig. 3(c) represents the morphology of nanopillars with 500nm width and 1.5μm height, and the contour profile of pyramidal structure is unsharp gradually from Fig. 3(a) to (c) due to the excessive increase of ICP etching which results in the destruction of pyramid bit by bit. The details of ICP etching conditions for different diameters and height of silicon nanopillars are optimized and recorded in Table 1. 3.2 Antireflection property of micro-nano structure The micro-nano structure as a rough surface like “black silicon” has good antireflection for the scattering to light and the reduction of refractive index gradually [15]. Fig. 4(a) shows the total reflectance of textured silicon wafer with single pyramid, single nanopillar, micro-nano surface texture and planar silicon measured by a spectrometer at the incidence angle of 8°. Remarkable decrease of reflectivity is observed in micro-nano surface texture sample with the same size of the single nanopillars of 200nm diameter and 1μm height (Fig. 2(b) and (c)) compared to that in planar surface and pyramid structure from measurement in Fig. 4(a). For pyramid structure, reflectance reduces to 20% much higher than 10% of the only nanopillar arrays from wavelength ranging from 400 to 1000nm. With micro-nano mix surface texture of pyramids and nanopillars, the reflectance of wavelength minimizes to 5% among the all measurements from 400 to 1000nm. The reflections of micro-nano surface with nanopillar arrays of different average diameter are tested and reveal that pyramids with small nanopillars below 200nm diameter can present a bit lower reflection than big nanopillars of 500nm diameter but cannot show large change of reflection for small nanopillars below 200nm from the wavelength of 400–1000nm (Fig. 4(b)). The lower reflection property of micro-nano surface texture can be attributed to the following: (1) the pyramid arrays give some of reflected light a second chance to enter Si and reduce the mirror reflection. (2) Highly rough surface of the nanopillars leads to strong light scattering and most of the incoming light could be absorbed after multiple reflections in the forest of nanopillar arrays. Micro-nano structure can scatter the incidence light to reduce reflection at large different reflected angle. Fig. 5 shows the diagrammatic drawing to measure the diffused reflected light with an incident white parallel light beam of Xe photosource at incidence angle 45° by an irradiatometer (FZ-A made by Beijing Normal University) with illumination (μw/cm2) at different reflected angle. The nanopillars for the single nanopillar and the micro-nano structure are all 200nm diameter and 1μm height (Fig. 2(b) and (c)), and the illumination of reflected light for only planar wafer is divided by 80 and added to Fig. 6. Obviously the planar wafer as a mirror has strong reflectivity of 4.78×104 μw/cm2 at the mirror reflected angle of α=45° with the total direct incident light of 1.2×105 μw/cm2 from the source. The reflected illumination of nanopillar arrays has a sharp peak at α=45° for the polished section on nanopillars' top which is undamaged for CsCl nanoislands' protection and the planar bottom between nanopillars like planar wafer as mirror, and is 573μw/cm2 obviously much smaller than that of planar wafer at the mirror reflected angle and very low values at other reflected angles. For pyramid structure without the effect of mirror like planar wafer, the curve is smooth and the reflected illumination at α from 30° to 60° is slight higher than other reflected angles for the fractional diffuse reflection of pyramid corresponding to the tilt micro surfaces of the pyramid. While for the micro-nano structure with pyramids and nanopillars, reflection is without sharp as low as that of single nanopillar structure from 10° to 35° and 55° to 80°, and the smooth distribution curve just as that of single pyramid structure but much lower than that. Therefore, the micro-nano structure is a total diffuse reflection and the reflection is very low from both the advantages of nanopillar and pyramid structures. Except for mirror reflection of the planar wafer, all the other structured wafer show illumination of around 30μw/cm2 across the lower than 30° and higher than 60° for the diffuse reflection. 3.3 Photoelectric property of micro-nano structure Fig. 7(a) shows the illuminated I–V characteristics of the solar cell with pyramid, nanopillar and micro-nano texture, and its photovoltaic properties are measured by AM 1.5G (1000W/m2 at 25°C) with the parameters of short circuit current density (J sc), open circuit voltage (V oc), fill factor (FF), photovoltaic conversion efficiency (η), series (R s) and shunt (R sh) resistances summarized in Table 2. The J sc and η increase from planar, pyramid, nanopillars to micro-nano surface texture for the antireflection and light trap of textures, while V oc and R sh decrease for the more space lattice defects of structure to recombination losses and the high R s is due to the poor electrical contact between electric poles and the P–N surface. The photovoltaic conversion efficiencies with 6.08% for planar wafer, 6.45% for pyramid structure, 6.58% for nanopillar arrays and 7.05% for micro-nano surface texture show that the solar cell of micro-nano texture has the maximum efficiency with same fabrication process for its highest antireflection property described in Fig. 4(a). The I–V curves and photovoltaic parameters of pyramid with different average diameter nanopillars are shown in Fig. 7(b) and Table 3, and it is difficult to find the direct relation between diameters and its photovoltaic performance from the results. The more efforts will be made to optimize the fabricating process of solar cell with the micro-nano structure to increase the photovoltaic conversion efficiency including the passivation with SiN x , making texture structure selectively on the active device area, covering ITO conducting layer on the front surface and so on. 4 Conclusions A micro-nano structure containing pyramids about 4–8μm and nanopillar arrays of average diameter from 100 to 500nm and height from 500nm to 1.5μm, is successfully fabricated by CsCl self-assembly lithography method and dry etching to reduce the reflectance of silicon surface. The tested reflectance of the micro-nano structure with nanopillars smaller than 200nm average diameter is below to 5% at wavelength from 400 to 1000nm and the distribution of reflected light is a total diffuse and very low reflection with white incidence light at the angle 45° from the both advantages of nanopillar and pyramid structure. The solar cells with micro-nano textures of different nanopillars have been fabricated and show the highest efficiency of 7.05% with the micro-nano structure of 200nm diameter nanopillars among all the finished solar cell at the same process mainly attribute to the trap incident light of micro-nano texture. The micro-nano structures made by wet etching for micro pyramidal structure and dry etching with the mask of CsCl islands from self-assemble lithography for nanopillars provide a new economic way to fabricate the solar cells with relative higher efficiency only benefiting from the effect of structures. There are much more work to optimize the fabricating process of micro-nano structure solar cell as a new texture surface for improving photovoltaic conversion efficiency, which has directly relation with micro-nano structures, P–N junction, passivation of surface, electrode poles and so on. Acknowledgments This work is supported by the National Science Foundation of China with contract number of 50972144. The authors thank Professor Fengzhen Liu in College of Materials Science and Optic-Electronic Technology of GUCAS for helping us test the photovoltaic conversion efficiency. References [1] X.S. Hua Y.J. Zhang H.W. Wang The effect of texture unit shape on silicon surface on the absorption properties Solar Energy Materials and Solar Cells 94 2010 258 262 [2] F. Restrepo C.E. Backus Black solar-cells or tetrahedral texturing of a silicon surface IEEE Transactions on Electron Devices 23 1976 1195 1197 [3] Y. Nishimoto K. Namba Investigation of texturization for crystalline silicon solar cells with sodium carbonate solutions Solar Energy Materials and Solar Cells 61 2000 393 402 [4] Deren Zhenqiang Xi Yang Duanlin Que Texturization of monocrystalline silicon with tribasicsodium phosphate Solar Energy Materials and Solar Cells 77 2003 255 263 [5] L.F. Sun J.Y. Tang A new texturing technique of monocrystalline silicon surface with sodium hypochlorite Applied Surface Science 255 2009 9301 9304 [6] J.Y. Chen K.W. Sun Enhancement of the light conversion efficiency of silicon solar cells by using nanoimprint anti-reflection layer Solar Energy Materials and Solar Cells 94 2010 629 633 [7] K.Q. Peng Y. Xu Y. Wu Aligned single-crystalline Si nanowire arrays for photovoltaic applications Small 1 2005 1062 1067 [8] Fei Wang Hong Yu Yu Xincai Wang Junshuai Li Xiaowei Sun Mingfei Yang She Mein Wong Hongyu Zheng Maskless fabrication of large scale Si nanohole array via laser annealed metal nanoparticles catalytic etching for photovoltaic application Journal of Applied Physics 108 2010 024301-1 024301-3 [9] N.M. Hwang W.S. Cheong DY Yoon Growth of silicon nanowires by chemical vapor deposition: approach by charged cluster model Journal of Crystal Growth 218 2000 33 39 [10] C.C. Striemer P.M. Fauchet Dynamic etching of silicon for broadband antireflection applications Applied Physics Letters 81 2002 2980 2982 [11] Jing Zhou Meret Hildebrandt Ming Lu Self-organized antireflecting nano-cone arrays on Si (100) induced by ion bombardment Journal of Applied Physics 109 2011 053513-1 053513-5 [12] J. Liu Y.-X. Liao B.-Wang F.-T. Yi The fabrication and photoelectric properties of the nanopillar arrays for solar cell Materials Science Forum 694 2011 375 379 [13] Y.-X. Liao F.-T. Yi The fabrication and photoelectric properties of the nanopillar arrays for solar cell Nanotechnology 21 2010 465302-1 465302-5 [14] Wu Jiang-hong Hu She-jun Wang Yi Fan Dong-hua Li Chang-ming Study on surface texturization and properties of monocrystalline silicon-based solar cells Technology and Development of Chemical Industry 8 2010 5 10 [15] Xiao Zheng Yu Sen Wang Hong Tao Fan Simple lithographic approach for subwavelength structure antireflection Applied Physics Letters 91 2007 061105-1 061105-3", "scopus-id": "84867236777", "coredata": {"eid": "1-s2.0-S0927024812004400", "dc:description": "A pyramid and nanopillar micro-nano surface texture of silicon wafer, which has pyramid arrays about 4–8μm with different nanopillars of average diameter from 100 to 500nm and height from 500nm to 1.5μm, is fabricated by Cesium Chloride (CsCl) self-assembly lithography and dry etching for solar cell. This micro-nano surface texture with 100 and 200nm average diameter has very good antireflection with reflectance below 5% for the wavelength ranging from 400 to 1000nm and much lower than that of single pyramid or nanopillar arrays with the same average diameter. The reflected distribution of this micro-nano structure illuminated with white parallel light at incidence angle of 45° is tested by a irradiatometer at the reflected angle from 10 to 80 degree and shows a total diffuse and very low reflection at different reflected angles, which benefits from both the advantages of nanopillar and pyramid structure. The solar cell with this micro-nano texture has been finished with thermal diffusion of Phosphorus for P–N junction and printing silver plasma for front electrode poles, and its photovoltaic conversion efficiency is about 7.05% which is higher than that of solar cell only with the planar, single pyramid or nanopillar and made with the same fabricating process.", "openArchiveArticle": "false", "prism:coverDate": "2013-01-31", "openaccessUserLicense": null, "prism:aggregationType": "Journal", "prism:url": "https://api.elsevier.com/content/article/pii/S0927024812004400", "dc:creator": [{"@_fa": "true", "$": "Liu, Jing"}, {"@_fa": "true", "$": "Ashmkhan, Marina"}, {"@_fa": "true", "$": "Dong, Gangqiang"}, {"@_fa": "true", "$": "Wang, Bo"}, {"@_fa": "true", "$": "Yi, Futing"}], "link": [{"@_fa": "true", "@rel": "self", "@href": "https://api.elsevier.com/content/article/pii/S0927024812004400"}, {"@_fa": "true", "@rel": "scidir", "@href": "https://www.sciencedirect.com/science/article/pii/S0927024812004400"}], "dc:format": "application/json", "openaccessType": null, "pii": "S0927-0248(12)00440-0", "prism:volume": "108", "prism:publisher": "Elsevier B.V.", "dc:title": "Fabrication of micro-nano surface texture by CsCl lithography with antireflection and photoelectronic properties for solar cells", "prism:copyright": "Copyright © 2012 Elsevier B.V. All rights reserved.", "prism:issueName": "Selected publications from the 22nd Space Photovoltaic Research and Technology (SPRAT) Conference", "openaccess": "0", "prism:issn": "09270248", "dcterms:subject": [{"@_fa": "true", "$": "Micro-nano texture"}, {"@_fa": "true", "$": "Cesium chloride self-assembly"}, {"@_fa": "true", "$": "Antireflection"}, {"@_fa": "true", "$": "Photoelectronic property"}, {"@_fa": "true", "$": "Solar cell"}], "openaccessArticle": "false", "prism:publicationName": "Solar Energy Materials and Solar Cells", "openaccessSponsorType": null, "prism:pageRange": "93-97", "prism:endingPage": "97", "pubType": "fla", "prism:coverDisplayDate": "January 2013", "prism:doi": "10.1016/j.solmat.2012.09.016", "prism:startingPage": "93", "dc:identifier": "doi:10.1016/j.solmat.2012.09.016", "openaccessSponsorName": null}, "objects": {"object": [{"@category": "standard", "@height": "210", "@width": "500", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024812004400-fx1.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "25091", "@ref": "fx1", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "92", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024812004400-fx1.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "6626", "@ref": "fx1", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "241", "@width": "340", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024812004400-gr1.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "22728", "@ref": "gr1", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "155", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024812004400-gr1.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "5708", "@ref": "gr1", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "819", "@width": "357", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024812004400-gr2.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "96663", "@ref": "gr2", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "163", "@width": "71", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024812004400-gr2.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "3851", "@ref": "gr2", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "780", "@width": "339", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024812004400-gr3.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "63498", "@ref": "gr3", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "163", "@width": "71", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024812004400-gr3.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "3276", "@ref": "gr3", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "527", "@width": "339", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024812004400-gr4.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "42042", "@ref": "gr4", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "163", "@width": "105", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024812004400-gr4.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "3172", "@ref": "gr4", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "101", "@width": "190", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024812004400-gr5.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "10709", "@ref": "gr5", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "117", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024812004400-gr5.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "2291", "@ref": "gr5", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "254", "@width": "339", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024812004400-gr6.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "21368", "@ref": "gr6", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "164", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024812004400-gr6.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "5069", "@ref": "gr6", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "538", "@width": "339", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024812004400-gr7.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "34074", "@ref": "gr7", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "163", "@width": "103", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0927024812004400-gr7.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "2719", "@ref": "gr7", "@mimetype": "image/gif"}]}, "link": {"@rel": "abstract", "@href": "https://api.elsevier.com/content/abstract/scopus_id/84867236777"}}