{"scopus-eid": "2-s2.0-85084949280", "originalText": "serial JL 271987 291210 291718 291892 31 Materials Science in Semiconductor Processing MATERIALSSCIENCEINSEMICONDUCTORPROCESSING 2020-05-23 2020-05-23 2020-05-23 2020-05-23 2020-07-23T10:55:49 1-s2.0-S1369800120302328 S1369-8001(20)30232-8 S1369800120302328 10.1016/j.mssp.2020.105187 S300 S300.1 FULL-TEXT 1-s2.0-S1369800120X00126 2021-02-20T08:30:20.923994Z 0 0 20201101 2020 2020-05-23T16:53:01.074833Z articleinfo articlenumber articletitlenorm authfirstinitialnorm authfirstsurnamenorm cid cids contenttype copyright crossmark dateloaded dateloadedtxt datesearch datesort dateupdated dco docsubtype doctype doi eid ewtransactionid hubeid indexeddate issn issnnorm itemstage itemtransactionid itemweight openaccess openarchive pg pgfirst pii piinorm pubdatestart pubdatetxt pubyr sectiontitle sortorder srctitle srctitlenorm srctype ssids alllist content subj subheadings suppl tomb volfirst volissue volumelist webpdf webpdfpagecount yearnav figure table body acknowledge affil articletitle auth authfirstini authfull authkeywords authlast grantnumber grantsponsor primabst ref 1369-8001 13698001 true 118 118 C Volume 118 5 105187 105187 105187 20201101 1 November 2020 2020-11-01 2020 Original research articles article fla © 2020 Elsevier Ltd. All rights reserved. AMETALFREEADDITIVETEXTURIZATIONMETHODUSEDFORDIAMONDWIRESAWNMULTICRYSTALLINESILICONWAFERS LI L 1 Introduction 2 Materials and methods 3 Results and discussion 4 Conclusion CRediT authorship contribution statement Acknowledgements References SREEJITH 2019 162 172 K CHEN 2019 1 8 K LIU 2019 149 155 H BLATTMANN 2015 766 773 V ABE 2016 T WANG 2018 1 4 S LIPPOLD 2014 104 110 M ZHANG 2018 292 296 J WANG 2018 220 225 T JIANG 2016 870 873 Y SHENG 2018 85 88 G HUANG 2011 285 308 Z ES 2016 866 869 F ZHA 2017 J GAO 2018 250 255 K OH 2012 743 J HAN 2012 497 513 N TIWARI 2017 105 113 A MA 2006 L LIU 2018 7561 7564 Y LIX2020X105187 LIX2020X105187XL 2022-05-23T00:00:00.000Z 2022-05-23T00:00:00.000Z http://creativecommons.org/licenses/by-nc-nd/4.0/ © 2020 Elsevier Ltd. All rights reserved. 2020-05-09T05:43:16.714Z http://vtw.elsevier.com/data/voc/AddOnTypes/50.7/eoas Primary Research and Development Plan of Zhejiang Province http://data.elsevier.com/vocabulary/SciValFunders/501100013145 http://sws.geonames.org/1814991 NSFC National Natural Science Foundation of China http://data.elsevier.com/vocabulary/SciValFunders/501100001809 http://sws.geonames.org/1814991 item S1369-8001(20)30232-8 S1369800120302328 1-s2.0-S1369800120302328 10.1016/j.mssp.2020.105187 271987 2021-02-20T08:30:20.923994Z 2020-11-01 1-s2.0-S1369800120302328-main.pdf https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1369800120302328/MAIN/application/pdf/7f393f3900e6feeb3ab0896f54c53131/main.pdf main.pdf pdf true 2396168 MAIN 6 1-s2.0-S1369800120302328-main_1.png https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1369800120302328/PREVIEW/image/png/043fcca2554ec445d8023404d615cc6e/main_1.png main_1.png png 57840 849 656 IMAGE-WEB-PDF 1 1-s2.0-S1369800120302328-gr3.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1369800120302328/gr3/DOWNSAMPLED/image/jpeg/21d85a4643d60fa5e29f1cc097c54d45/gr3.jpg gr3 gr3.jpg jpg 189241 580 811 IMAGE-DOWNSAMPLED 1-s2.0-S1369800120302328-gr2.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1369800120302328/gr2/DOWNSAMPLED/image/jpeg/a172f0fbd54db6a83febce225899a783/gr2.jpg gr2 gr2.jpg jpg 42647 289 388 IMAGE-DOWNSAMPLED 1-s2.0-S1369800120302328-gr5.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1369800120302328/gr5/DOWNSAMPLED/image/jpeg/90d3af88d40176960e33d42f8bda90ae/gr5.jpg gr5 gr5.jpg jpg 84487 237 691 IMAGE-DOWNSAMPLED 1-s2.0-S1369800120302328-gr4.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1369800120302328/gr4/DOWNSAMPLED/image/jpeg/3376701462f6e381a5aad925f7674e56/gr4.jpg gr4 gr4.jpg jpg 133219 390 811 IMAGE-DOWNSAMPLED 1-s2.0-S1369800120302328-gr7.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1369800120302328/gr7/DOWNSAMPLED/image/jpeg/da9d13f34834401cbd93d19ef4cb176b/gr7.jpg gr7 gr7.jpg jpg 73750 375 535 IMAGE-DOWNSAMPLED 1-s2.0-S1369800120302328-gr6.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1369800120302328/gr6/DOWNSAMPLED/image/jpeg/b09b65a2a5b3ca7437c75a68d0efe869/gr6.jpg gr6 gr6.jpg jpg 49918 289 388 IMAGE-DOWNSAMPLED 1-s2.0-S1369800120302328-gr8.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1369800120302328/gr8/DOWNSAMPLED/image/jpeg/a6196afca89200351b67ff99f7f21af7/gr8.jpg gr8 gr8.jpg jpg 44707 285 388 IMAGE-DOWNSAMPLED 1-s2.0-S1369800120302328-gr1.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1369800120302328/gr1/DOWNSAMPLED/image/jpeg/c4077ee59fd38fa059e548cdda8ff011/gr1.jpg gr1 gr1.jpg jpg 78276 239 691 IMAGE-DOWNSAMPLED 1-s2.0-S1369800120302328-gr3.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1369800120302328/gr3/THUMBNAIL/image/gif/942239a092a9394d66566205ba8fbdec/gr3.sml gr3 gr3.sml sml 28986 157 219 IMAGE-THUMBNAIL 1-s2.0-S1369800120302328-gr2.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1369800120302328/gr2/THUMBNAIL/image/gif/089b3633d9d5e9f69d431945f7759e4d/gr2.sml gr2 gr2.sml sml 14599 163 219 IMAGE-THUMBNAIL 1-s2.0-S1369800120302328-gr5.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1369800120302328/gr5/THUMBNAIL/image/gif/8b160649c0aa633ac285a0828d2bbbba/gr5.sml gr5 gr5.sml sml 21140 75 219 IMAGE-THUMBNAIL 1-s2.0-S1369800120302328-gr4.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1369800120302328/gr4/THUMBNAIL/image/gif/1ca4f783b1a41b0f0d634e1bdabdc32f/gr4.sml gr4 gr4.sml sml 21396 105 219 IMAGE-THUMBNAIL 1-s2.0-S1369800120302328-gr7.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1369800120302328/gr7/THUMBNAIL/image/gif/5f3b07ed462607eabbcb904d0908cf09/gr7.sml gr7 gr7.sml sml 24946 153 219 IMAGE-THUMBNAIL 1-s2.0-S1369800120302328-gr6.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1369800120302328/gr6/THUMBNAIL/image/gif/695624beaf2daa86d1dd7b241f491bef/gr6.sml gr6 gr6.sml sml 15828 163 219 IMAGE-THUMBNAIL 1-s2.0-S1369800120302328-gr8.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1369800120302328/gr8/THUMBNAIL/image/gif/7dbe3d5e54fa49cba7084a0ef1c31f7f/gr8.sml gr8 gr8.sml sml 14677 161 219 IMAGE-THUMBNAIL 1-s2.0-S1369800120302328-gr1.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1369800120302328/gr1/THUMBNAIL/image/gif/15b8338165a4e18767a18ef5711db248/gr1.sml gr1 gr1.sml sml 16686 76 219 IMAGE-THUMBNAIL 1-s2.0-S1369800120302328-gr3_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1369800120302328/gr3/HIGHRES/image/jpeg/f7a8e7f3728a7adb83acff61961be859/gr3_lrg.jpg gr3 gr3_lrg.jpg jpg 1414944 2569 3591 IMAGE-HIGH-RES 1-s2.0-S1369800120302328-gr2_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1369800120302328/gr2/HIGHRES/image/jpeg/381b114250c52d353bdcdc283584fc28/gr2_lrg.jpg gr2 gr2_lrg.jpg jpg 190882 1283 1720 IMAGE-HIGH-RES 1-s2.0-S1369800120302328-gr5_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1369800120302328/gr5/HIGHRES/image/jpeg/e2d9177119f5bb3ddf5baa11c03e04d4/gr5_lrg.jpg gr5 gr5_lrg.jpg jpg 552079 1049 3059 IMAGE-HIGH-RES 1-s2.0-S1369800120302328-gr4_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1369800120302328/gr4/HIGHRES/image/jpeg/28804dc1fcc0fe93cc963f4194da97f3/gr4_lrg.jpg gr4 gr4_lrg.jpg jpg 923597 1729 3591 IMAGE-HIGH-RES 1-s2.0-S1369800120302328-gr7_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1369800120302328/gr7/HIGHRES/image/jpeg/b3043e10dac5438cf355636bb28ad085/gr7_lrg.jpg gr7 gr7_lrg.jpg jpg 503332 1659 2370 IMAGE-HIGH-RES 1-s2.0-S1369800120302328-gr6_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1369800120302328/gr6/HIGHRES/image/jpeg/1aa3bd542d3882e9554a6aa8599e9716/gr6_lrg.jpg gr6 gr6_lrg.jpg jpg 235005 1282 1721 IMAGE-HIGH-RES 1-s2.0-S1369800120302328-gr8_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1369800120302328/gr8/HIGHRES/image/jpeg/cb313aadea1335ec36890f1cc24707a4/gr8_lrg.jpg gr8 gr8_lrg.jpg jpg 213566 1263 1721 IMAGE-HIGH-RES 1-s2.0-S1369800120302328-gr1_lrg.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1369800120302328/gr1/HIGHRES/image/jpeg/32cf26a950f5ac3ff85a2469d670c948/gr1_lrg.jpg gr1 gr1_lrg.jpg jpg 627732 1058 3059 IMAGE-HIGH-RES 1-s2.0-S1369800120302328-am.pdf am am.pdf pdf 2220308 AAM-PDF https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/egi:10PS12SV816/MAIN/application/pdf/8699bd9cef484a85836117a043584f56/am.pdf MATSCI 105187 105187 S1369-8001(20)30232-8 10.1016/j.mssp.2020.105187 Elsevier Ltd Fig. 1 SEM images of DWS mc-Si wafers etched by a conventional acid solution (a), and by PAAE (b). Fig. 1 Fig. 2 The reflectance spectra of the DWS mc-Si wafers etched by different solutions. Fig. 2 Fig. 3 SEM images of DWS mc-Si wafers etched in solution C for different time. (a) 30 s, (b) 45 s, (c) 60 s, (d) 90 s, (e) 120 s, and (f) 150 s. (g) is their hemispherical reflectance spectra. Fig. 3 Fig. 4 SEM images of DWS mc-Si wafers etched in solution C for 120 s at different temperatures. (a) 10 °C, (b) 20 °C, (c) 30 °C, (d) 40 °C, and (e) 50 °C. (f) is the hemispherical reflectance spectra. Fig. 4 Fig. 5 SEM images of DWS mc-Si wafers etched for 120 s at 20 °C in solution C before (a) and after etching for 2 min in 1 wt% NaOH (b). Fig. 5 Fig. 6 The hemispherical reflectance spectra of DWS mc-Si wafers. (a) Unetched DWS mc-Si wafer, (b) etched for 120 s at 20 °C in solution C, (c) further etched for 2 min in 1 wt% NaOH after (b). Fig. 6 Fig. 7 SEM images of etched DWS mc-Si wafers. (a) as-cutting mc-Si wafer, (b) etched in solution C, (c) etched in alkali solution, (d) etched in alkali solution and then etched in solution C. Fig. 7 Fig. 8 The hemispherical reflectance spectra of the DWS mc-Si wafers. (a) etched in alkali solution, (b) after etched in alkali solution and then etched in solution C, (c) etched in solution C. Fig. 8 Table 1 Solar Cell performances of the sample etched by PAAE. Table 1 Jsc (mA cm−2) VOC (mV) FF (%) η(%) Rsh (Ω cm2) Rs (Ω cm2) PAAE 37.29 655 79.47 19.39 14314.89 0.35 A metal-free additive texturization method used for diamond-wire-sawn multi-crystalline silicon wafers Likai Li Resources Investigation Data curation Writing - original draft a Hao Jin Visualization b Qi Wang Formal analysis b Deren Yang Writing - review & editing a Lei Wang Conceptualization Methodology Writing - review & editing a ∗ a State Key Laboratory of Silicon Materials and School of Materials Science and Engineering, Zhejiang University, Hangzhou, 310027, China State Key Laboratory of Silicon Materials and School of Materials Science and Engineering Zhejiang University Hangzhou 310027 China State Key Laboratory of Silicon Materials and School of Materials Science and Engineering, Zhejiang University, Hangzhou, 310027, China b Zhejiang JinkoSolar Co., Ltd., Jiaxing, 314416, China Zhejiang JinkoSolar Co., Ltd. Jiaxing 314416 China Zhejiang JinkoSolar Co., Ltd., Jiaxing, 314416, China ∗ Corresponding author. Diamond-wire-sawn (DWS) technique has been widely applied in PV industry. However, this technique still has a big challenge when it is used for multi-crystalline silicon (mc-Si) because its reflectivity of DWS mc-Si etched by the conventional acid etching solution (HF/HNO3/H2O system) is quite higher. This paper proposes a metal-free additive texturization method, in which polyethylene glycol (PEG) is added to the HF/HNO3/H2O system to reduce the reaction rate of silicon wafers and improve the wettability of the etching liquid and the surface of mc-Si wafers. The etching points will gradually turn into nanopores instead of worm-like structures due to low reaction rates. Those nanopores form a gradually changed refractive index between silicon and air, which immensely reduces the surface reflectivity of mc-Si wafers. The mc-Si wafers processed in the experiment have an average surface reflectivity of about 16.9% in the wavelength range of 300–1100 nm, which is generally lower than the mc-Si wafers etched by the conventional acid etching process. This technical route has been applied to fabricate the 156 mm × 156 mm DWS mc-Si solar cells, and finally, the conversion efficiency of 19.39% has been obtained. Moreover, this approach matches well with the current PV industrial processes, showing a promising prospect. Keywords Silicon Diamond-wire-sawn Texturization Metal-free additive Nanostructure Solar cell 1 Introduction Reducing costs and improving efficiency have always been the goals pursued by the development of Si-based solar cells. Given this, diamond-wire-sawn (DWS) technique will gradually replace slurry-wire-sawn (SWS) technique due to abundant advantages, such as low kerf loss, higher productivity, less environmental contamination and lesser breakage of wire [1]. DWS mc-Si wafer surface will produce parallel saw marks, which are not produced by SWS mc-Si. However, the saw marks cannot be removed with the standard isotropic acidic micro-texturing process. Even more deadly, the top of wafers contains a thin layer of amorphous silicon after cutting. The presence of this amorphous silicon layer can hinder the etching of silicon wafers by acids. In addition, DWS mc-Si wafers have less saw damaged sites as compared to SWS mc-Si wafers, which provide starting points for the HF/HNO3/H2O system. Thus, it is difficult to obtain an ideal surface light trapping structure after etching process for DWS mc-Si [2,3]. Therefore, it is rather necessary to find an improved method to etch DWS mc-Si wafers effectively so as to have low reflectivity. The texturing methods of DWS mc-Si wafers are mainly divided into two categories, namely dry etching and wet etching respectively. Dry etching techniques, such as reactive ion etching (RIE) and femtosecond laser etching, can create the desired surface topography of Si with high-energy particles and laser. Dry etching is precise, controllable and stable. However, this method requires a high degree of cleanliness on the surface of silicon wafers to reduce the pollution and defects during the etching process, and dry etching equipments are also expensive, which prevents its large-scale industrial application [4–6] Another category is wet etching, mainly including HF/HNO3/H2O system incorporated with different additives and metal assisted chemical etching (MACE). Based on that MnO2 has a slower reaction rate in the acid system than silicon, Liu et al. added MnO2 particles to the HF/HNO3/H2O etching system. Because MnO2 particles were deposited on the surface of silicon wafers, some dense worm-like corrosion pits were formed on the surface after acid etching process. Therefore, a weighted average low surface reflectivity for the AM1.5G sun spectrum in the wavelength range of 380–1100 nm was achieved at about 25% for etched DWS mc-Si [3]. Lippold et al. added H2SO4 as an additive to the acid system to investigate etching effect [7]. Although the surface reflectivity of the silicon wafers etched by this method was reduced, it still remained at a high level. Moreover, physical crash as the pretreatment process to increase the surface roughness of DWS mc-Si wafers, combined with conventional HF/HNO3/H2O system, was also utilized to obtain desired surface morphology. Zhang et al. used ultrasonication vibration to remove saw marks and smooth zones on the DWS wafer surfaces by producing new pits [8]. Wang et al. developed the X–Y axis micro-pressure sandblast treatment system to pre-texture the surface of DWS mc-Si wafers [9]. However, such method made silicon wafer fragment rate extremely high, which greatly raised the production cost. Thus, MACE method has attracted much attention in recent years because of its excellent controllability and compatibility. The principle of this method is to deposit metal nanoparticles on the surface of silicon wafers by a one-step method or a two-step method. And then, the silicon wafers will generate nanopores due to the fast reaction rate. This layer of nanopores is a gradually changed refractive index between silicon and air, which reduces the surface reflectivity of silicon wafers [10–15]. However, this process uses metal ions such as silver, platinum or copper. The presence of metal particles can greatly reduce the minority carrier lifetime of silicon wafers so as to decrease efficiency of solar cells. Metal ions also can cause serious environmental pollution. Furthermore, the large specific surface area of nanopores can causes the surface recombination and Auger recombination, resulting in low minority carrier lifetime [16]. Therefore, to find a cheap, metal-free and environmentally friendly method to make the higher quality of surface texture for DWS mc-Si wafers is very attractive in PV industry. In this article, we have proposed a simple, low cost and compatible etching method for DWS mc-Si wafers. In experiments, an organic alcohol polyethylene glycol (PEG) is added to conventional acid etching solution. This method does not require removing the surface damage layer and additional process, which makes the approach fully compatible with the current Si solar cell production line. By optimizing the reaction temperature, time and acid solution ratio, the silicon surface texture structure prepared by this method shows a good light trapping effect. Solar cells have been trial-produced on large-area DWS mc-Si wafers (156 mm × 156 mm) combined with this etching process, and good photoelectric conversion efficiency has been achieved (19.39%). In addition, the optimized etching temperature is 20 °C, which is higher than the conventional acid etching process. So, this method is conducive to saving energy for cooling system. All the results indicate that our technical route has useful application prospects. 2 Materials and methods The 156 mm × 156 mm, 180 ± 20 μm thick, p-type DWS mc-Si wafers with the resistivity of 1–3 Ω cm were provided by the GCL Company in China. First, the silicon wafers were cut into small pieces (30 mm × 30 mm) with a laser cutter, and the organic substances and metal impurities on the surface of silicon wafers were removed by the standard cleaning method (RCA1, RCA2). Then, the wafers were dried by nitrogen. After that, the wafers were immediately immersed into the texturing solution. To dissolve a certain amount of polyethylene glycol (PEG) in deionized water (DIW) is recorded as the solution A (In solution A, the mass fraction of PEG is 1.5%). The degree of polymerization of polyethylene glycol in the solution is 1000. To mix hydrofluoric acid (HF), nitric acid (HNO3) and DIW in a volume ratio of 1:3.75:2 is recorded as the solution B. The concentrations of the adopted HNO3 and HF is 68 wt% and 40 wt%, respectively. Then, pour the solution A into the solution B, which is recorded as the solution C (The volume ratio of solution A to solution B is 2:27). The cleaned silicon wafers were vertically immersed in the solution C, we call it as the PEG-assisted acid etch (PAAE). As a comparison, some cleaned silicon wafers were vertically immersed in the solution B (conventional etching method). The effects of temperatures and time on the surface morphology of silicon wafers were studied. After the texturization (etching), to reduce the surface recombination of silicon wafers, nanoporous Si was ultrasonically cleaned for 2 min in 1 wt% NaOH solution at room temperature. The samples were then rinsed with DIW and dried with nitrogen. Finally, the innovative method was applied to fabricate 156 mm × 156 mm DWS mc-Si solar cells following the standard process at Canadian Solar Inc. (in Suzhou). The morphology and structure of samples were observed by a field emission scanning electron microscope (FESEM, Hitachi S4800) and an atomic force microscope (AFM, Bruker Dimension Edge). The optical property of samples was measured by a UV–VIS–NIR spectrophotometer (Hitachi, U-4100). 3 Results and discussion Adding PEG to a conventional acid etching solution has a good influence on the surface morphology of silicon wafers. It can be seen from Fig. 1 that after etching with a conventional acid solution, the surface of silicon wafer appears the worm-like structure with a width of about 5 μm and a length of 5–10 μm. And the etch pits are shallow and unevenly distributed; After the addition of PEG to a conventional acid solution, the surface of silicon wafer generates nano-porous structure, in which the porous holes have a diameter of ~500 nm and are evenly distributed. We also test the mass loss rate (MLR) of silicon wafers etched by two different methods. The MLR of the wafer etched by the conventional acid solution is ~15 times larger than that by PAAE. This indicates the addition of PEG can greatly reduce the reaction rate of silicon wafers. Moreover, in a short period of time, nanopores generated on the surface of silicon wafers will not combine with each other to form micron corrosion pits. As we all know, PEG is highly hydrophilic [17,18], the addition of PEG can reduce the surface tension of the etching solution and improve the wettability of the etching solution. Silicon wafers etched in the etching solution can generate gas. In conventional HF/HNO3/H2O system, the surface tension of the solution is large, and the generated gas adheres to the surface of the silicon wafer, hindering the further progress of the reaction and making the surface morphology of silicon wafers uneven. After adding PEG, the surface tension of the solution is reduced, and the gas can quickly escape from the surface of the silicon wafer to generate uniform surface morphology. Silicon wafers are hydrophobic materials. When silicon wafers are placed in the conventional acid etching solution, the silicon wafers cannot be fully contacted with the liquid. So, the number of etching starting points is small. The addition of PEG can make the silicon wafer and the etching solution fully contact, and increase the number of etching starting points. Low surface tension and high wettability combined with slow reaction rate can produce nano scale etching pits as shown in Fig. 1(b), resulting in the different surface topography of wafers etched by a conventional acid solution. The surface topography is the major factor determining the surface reflectivity of silicon. The reflectivity affects the conversion efficiency of the solar cell. It can be seen from Fig. 2 that in the range of 300–1100 nm, the surface reflectivity of silicon wafer etched by the conventional acid solution is higher (more than 30%), which cannot meet the needs of solar cell fabrication. After adding PEG, the surface reflectivity is greatly reduced to a minimum of 16.9%. The main reason for the reduction is that nanoporous structure can form a gradually changed refractive index between silicon and air, which can immensely reduce the surface reflectivity of silicon wafers. However, the silicon etched by the conventional acid solution generates micro worm-like structure instead of nanoporous structure, so that it has no enough anti-reflection effect [19,20]. Fig. 3 (a~f) shows the surface morphologies of the samples etched in solution C for different time,the corresponding reflectivity spectra are shown in Fig. 3(g). As can be seen in Fig. 3(a), when the reaction time is 30 s, abundant etching starting points have been generated on the surface of the silicon wafer, but no nanopore begins to form. As the etching time increases, nanoporous begins to form, and the diameter and depth of the nanoporous gradually increase. It can be seen from Fig. 3(g) that the reflectivity gradually increases with the increase of etching time. This is directly related to the diameter increase of the nanopore. As we know, long etching time generates more nanopores which increases surface area and decreases minority carrier lifetime, but short etching time is not conducive to the control of the reaction. Thus, the optimal time for etching in our experiments is 120 s while the reflection is also very low. In the range of 300–1100 nm, the average reflectivity is only 16.9%. Fig. 4 (a~e) shows the surface morphologies of the samples etched by PAAE at different temperatures in solution C. Fig. 4(f) shows the reflectance spectra in the visible range for the corresponding samples. It can be seen from Fig. 4(a) that when the reaction temperature is 10 °C, nanoporous begins to form on the surface of the silicon wafer, but the size of the nanoporous is still very small and unevenly distributed. Due to the low temperature, the reaction activity of substances involved in the reaction is low and the etching speed is slow, so the silicon wafer does not produce obvious changes. Fig. 4(b) shows that when the reaction temperature is 20 °C, the etching speed is accelerated, and the size of the nanoporous on the surface of the silicon wafer starts to increase. As the temperature further increases, the size of the nanoporous gradually increases, which reaches to a maximum value at 40 °C. Fig. 4(e) shows that when the reaction temperature reaches 50 °C, the etching rate is fast so that a micron-scale worm-like structure is formed. The obtained structure is similar to the fundamental morphology of DWS mc-Si wafers etched by the conventional HF/HNO3/H2O system. In this temperature, the effect of PEG is completely invalid. This result demonstrates that an important effect of PEG is to reduce the etching rate of silicon wafers. As the reaction temperature increases, the reflectivity continuously increases, as shown in Fig. 6. It can be seen that at 10 °C, the average reflectivity is about 11.9%. At 50 °C, the average reflectivity reaches 33.9%, which indicates that PEG loses its effect. In practical production, higher and lower reaction temperatures will increase additional production costs. Thus, we set the optimal reaction temperature to 20 °C. The nanoporous structure will introduce serious surface recombination because of its large specific surface. What's more serious is that the rough structures will make the phosphorus (P) diffusion uneven in the solar cell manufacturing process, which will reduce short-circuit of cells internally. Inconsistent depth of nanopores can also cause uneven thickness of SiNx. Therefore, we investigate the NaOH post-treatment to modify Si nanoporous structure. Fig. 5 (a and b) show the SEM images of Si nanostructures etched by PAAE before and after the post-treatment process, respectively. After the post-treatment, the sharp structure on the porous silicon surface is removed, and the nanoporous becomes smooth. Such structure is beneficial in reducing surface recombination and matching with the subsequent process. The average reflectivity in the range of 300–1100 nm illustrated in Fig. 6 grows to 22.6% from 16.9%, but still below 25%. To verify the etch effect, the 156 mm × 156 mm DWS mc-Si wafers etched by PAAE were used to fabricate solar cells on the basis of the standard process at Canadian Solar Inc. (in Suzhou, China). The measured performance parameters of solar cells are shown in Table 1 . One can see that the conversion efficiency of 19.40% has been obtained. The efficiency of DWS mc-Si solar cells can be further improved if optimized parameters of cell manufacture are adopted in future. In order to further study the principle of action of PEG, we conducted a comparative trial. The silicon wafer was polished with alkali to remove the surface damage layer, and then the polished silicon wafer was immersed in solution C to texture under the same conditions. Fig. 7 (c) shows the morphology of the polished silicon wafer. The surface of the silicon wafer contains oblique pyramids of different sizes. Because the grain's crystal orientations of the mc-Si surface are various, the directions of the pyramids formed by the alkali etch are also various. Fig. 7(d) shows the morphology of the silicon wafer polished and then etched in solution C. The silicon does not form similar surface topography shown in Fig. 7(b). Fig. 8 shows the reflectance spectra for the alkali polished sample, alkali polished and then acid-etched sample, acid-etched sample without alkali polishing. It can be found that the sample which undergoes alkali polishing and acid etching has almost no anti-reflection effect. DWS mc-Si also has surface defects that are critical to acid etch and form the starting point for etching pits. When alkali corrosion removes the surface damage layer, the acid etch cannot form pits on the smooth and dense silicon surface, resulting in the higher surface reflectivity. It can also be seen from Fig. 7(b) that the direction of the cut line marks forms longitudinally arranged etch pits, which also proves the effect of surface defects. The addition of PEG in the experiment increased the wettability of the acid and the surface of silicon wafers, making the corrosion more uniform and easier to carry out, but the suede could not be formed on the defect-free surface. Surface reflectivity after polishing and etching with solution C is much higher than that of silicon wafer directly etched with solution C. It can be concluded that the conventional acid and PEG etching solution is directly related to the surface morphology. The surface of DWS mc-Si contains a lot of defects, which act as good etched spots. After etching, nanoporous structures can be generated. If silicon wafers are polished, surface defects will be greatly reduced, so that nanoporous structure is no longer produced. 4 Conclusion We have proposed a novel technical process route for the surface texturing of DWS mc-Si. By adding PEG to the conventional acid etching solution, nanoporous is generated on the surface of DWS mc-Si. The reflectivity and surface topography are controllable. With the increase of time, the diameter of the nanopores and the reflectivity gradually increases. As the temperature increases, the increased reaction rate also leads to an increase of nanopore diameter and reflectivity. At 50 °C, the addition of PEG completely loses its effect. Considering reflectivity, controllability of the reaction, and energy saving, the optimal reaction time and temperature in our experiments are 120 s and 20 °C, respectively. And then, the silicon surface reflectivity is ~16.9%. Based on the pilot production line combined with this etching process, an 19.39% conversion efficiency of DWS mc-Si solar cell has been obtained. The cell conversion efficiency is expected to be further improved by optimizing production line processes. CRediT authorship contribution statement Likai Li: Resources, Investigation, Data curation, Writing - original draft. Hao Jin: Visualization. Qi Wang: Formal analysis. Deren Yang: Writing - review & editing. Lei Wang: Conceptualization, Methodology, Writing - review & editing. Declaration of competing interest The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Acknowledgements This work was supported by the National Key R&D Program of China (No.2018YFB1500300), National Natural Science Foundation of China (No. 51532007, 61721005), and Key Project of Zhejiang Province (No. 2018C01034). References [1] K.P. Sreejith A.K. Sharma S. Kumbhar An additive-free non-metallic energy efficient industrial texturization process for diamond wire sawn multicrystalline silicon wafers[J] Sol. Energy 184 2019 162 172 Sreejith K P, Sharma A K, Kumbhar S, et al (2019). An additive-free non-metallic energy efficient industrial texturization process for diamond wire sawn multicrystalline silicon wafers[J]. Solar Energy, 184: 162-172. [2] K. Chen J. Zha F. Hu MACE nano-texture process applicable for both single-and multi-crystalline diamond-wire sawn Si solar cells[J] Sol. Energy Mater. Sol. Cell. 191 2019 1 8 Chen K, Zha J, Hu F, et al (2019). MACE nano-texture process applicable for both single-and multi-crystalline diamond-wire sawn Si solar cells[J]. Solar Energy Materials and Solar Cells, 191: 1-8. [3] H. Liu L. Zhao H. Diao High-performance texturization of multicrystalline silicon wafer by HF/HNO3/H2O system incorporated with MnO2 particles[J] Mater. Sci. Semicond. Process. 101 2019 149 155 Liu H, Zhao L, Diao H, et al (2019). High-performance texturization of multicrystalline silicon wafer by HF/HNO3/H2O system incorporated with MnO2 particles[J]. Materials Science in Semiconductor Processing, 101: 149-155. [4] V. Blattmann D. Trusheim Hybrid laser-etching-process for wafer texturing[J] Energy Procedia 77 2015 766 773 Blattmann V, Trusheim D (2015). Hybrid laser-etching-process for wafer texturing[J]. Energy Procedia, 77: 766-773. [5] T. Abe Y. Miyasaka R. Watanabe Random texturing process for multicrystalline silicon solar cells using plasmaless dry etching[J] J. Vacuum Sci. Technol. NanotechNol. Microelectr, Mater. Process. Measure. Phenomena. 34 5 2016 051401 Abe T, Miyasaka Y, Watanabe R, et al (2016). Random texturing process for multicrystalline silicon solar cells using plasmaless dry etching[J]. Journal of Vacuum Science & Technology B, Nanotechnology and Microelectronics: Materials, Processing, Measurement, and Phenomena, 34(5): 051401. [6] S. Wang X. Gou S. Zhou Effect of surface structure on electrical performance of industrial diamond wire sawing multicrystalline Si solar cells[J] Int. J. Photoenergy 2018 2018 1 4 10.1155/2018/7947015 Wang S, Gou X, Zhou S, et al (2018). Effect of Surface Structure on Electrical Performance of Industrial Diamond Wire Sawing Multicrystalline Si Solar Cells[J]. International Journal of Photoenergy, 2018. [7] M. Lippold F. Buchholz C. Gondek Texturing of SiC-slurry and diamond wire sawn silicon wafers by HF–HNO3–H2SO4 mixtures[J] Sol. Energy Mater. Sol. Cell. 127 2014 104 110 Lippold M, Buchholz F, Gondek C, et al (2014). Texturing of SiC-slurry and diamond wire sawn silicon wafers by HF-HNO3-H2SO4 mixtures[J]. Solar Energy Materials and Solar Cells, 127: 104-110. [8] J. Zhang Y. Peng X. Ye Ultrasonication pretreatment of diamond wire sawn multi-crystalline silicon wafers for texturing[J] Mater. Sci. Semicond. Process. 74 2018 292 296 Zhang J, Peng Y, Ye X, et al (2018). Ultrasonication pretreatment of diamond wire sawn multi-crystalline silicon wafers for texturing[J]. Materials Science in Semiconductor Processing, 74: 292-296. [9] T.C. Wang H.Y. Lee C.T. Lee Investigated performance improvement of the micro-pressure sandblast-treated multi-crystalline Si wafer sliced using diamond wire sawing[J] Sol. Energy 161 2018 220 225 Wang T C, Lee H Y, Lee C T, et al (2018). Investigated performance improvement of the micro-pressure sandblast-treated multi-crystalline Si wafer sliced using diamond wire sawing[J]. Solar Energy, 161: 220-225. [10] Y. Jiang H. Shen T. Pu Hybrid process for texturization of diamond wire sawn multicrystalline silicon solar cell[J] Phys. Status Solidi Rapid Res. Lett. 10 12 2016 870 873 Jiang Y, Shen H, Pu T, et al (2016). Hybrid process for texturization of diamond wire sawn multicrystalline silicon solar cell[J]. physica status solidi (RRL)-Rapid Research Letters, 10(12): 870-873. [11] G. Sheng Y.X. Zou S. Li Controllable nano-texturing of diamond wire sawing polysilicon wafers through low-cost copper catalyzed chemical etching[J] Mater. Lett. 221 2018 85 88 Sheng G, Zou Y X, Li S, et al (2018). Controllable nano-texturing of diamond wire sawing polysilicon wafers through low-cost copper catalyzed chemical etching[J]. Mater. Lett., 221: 85-88. [12] Z. Huang N. Geyer P. Werner Metal‐assisted chemical etching of silicon: a review: in memory of prof. Ulrich gösele[J] Adv. Mater. 23 2 2011 285 308 Huang Z, Geyer N, Werner P, et al (2011). Metal-assisted chemical etching of silicon: a review: in memory of prof. Ulrich gosele[J]. Adv. Mater., 23(2): 285-308. [13] F. Es G. Baytemir M. Kulakci Multi‐crystalline silicon solar cells with metal‐assisted nano‐texturing using HNO3 as hole injection agent[J] Phys. Status Solidi Rapid Res. Lett. 10 12 2016 866 869 Es F, Baytemir G, Kulakci M, et al (2016). Multi-crystalline silicon solar cells with metal-assisted nano-texturing using HNO3 as hole injection agent[J]. Phys. Status Solidi Rapid Res. Lett., 10(12): 866-869. [14] J. Zha T. Wang C. Pan Constructing submicron textures on mc-Si solar cells via copper-catalyzed chemical etching[J] Appl. Phys. Lett. 110 9 2017 093901 Zha J, Wang T, Pan C, et al (2017). Constructing submicron textures on mc-Si solar cells via copper-catalyzed chemical etching[J]. Applied Physics Letters, 110(9): 093901. [15] K. Gao H. Shen Y. Liu Enhanced etching rate of black silicon by Cu/Ni Co-assisted chemical etching process[J] Mater. Sci. Semicond. Process. 88 2018 250 255 Gao K, Shen H, Liu Y, et al (2018). Enhanced etching rate of black silicon by Cu/Ni Co-assisted chemical etching process[J]. Materials Science in Semiconductor Processing, 88: 250-255. [16] J. Oh H.C. Yuan H.M. Branz An 18.2%-efficient black-silicon solar cell achieved through control of carrier recombination in nanostructures[J] Nat. Nanotechnol. 7 11 2012 743 Oh J, Yuan H C, Branz H M (2012). An 18.2%-efficient black-silicon solar cell achieved through control of carrier recombination in nanostructures[J]. Nature nanotechnology, 7(11): 743. [17] N. Han J.K. Johnson P.A. Bradley Cell attachment to hydrogel-electrospun fiber mat composite materials[J] J. Funct. Biomater. 3 3 2012 497 513 Han N, Johnson J K, Bradley P A, et al (2012). Cell attachment to hydrogel-electrospun fiber mat composite materials[J]. Journal of functional biomaterials, 3(3): 497-513. [18] A.P. Tiwari M.K. Joshi J. Lee Heterogeneous electrospun polycaprolactone/polyethylene glycol membranes with improved wettability, biocompatibility, and mineralization[J] Colloid. Surface. Physicochem. Eng. Aspect. 520 2017 105 113 Tiwari A P, Joshi M K, Lee J, et al (2017). Heterogeneous electrospun polycaprolactone/polyethylene glycol membranes with improved wettability, biocompatibility, and mineralization[J]. Colloids and Surfaces A: Physicochemical and Engineering Aspects, 520: 105-113. [19] L.L. Ma Y.C. Zhou N. Jiang Wide-band “black silicon” based on porous silicon[J] Appl. Phys. Lett. 88 17 2006 171907 Ma L L, Zhou Y C, Jiang N, et al (2006). Wide-band “black silicon” based on porous silicon[J]. Applied physics letters, 88(17): 171907. [20] Y. Liu J. Zhang L. Wang An innovative light trapping structure fabrication method on diamond‐wire‐sawing multi‐crystalline silicon wafers[J] Chemistry 3 26 2018 7561 7564 Liu Y, Zhang J, Wang L, et al (2018). An Innovative Light Trapping Structure Fabrication Method on Diamond-Wire-Sawing Multi-Crystalline Silicon Wafers[J]. ChemistrySelect, 3(26): 7561-7564.", "scopus-id": "85084949280", "coredata": {"eid": "1-s2.0-S1369800120302328", "dc:description": "Diamond-wire-sawn (DWS) technique has been widely applied in PV industry. However, this technique still has a big challenge when it is used for multi-crystalline silicon (mc-Si) because its reflectivity of DWS mc-Si etched by the conventional acid etching solution (HF/HNO3/H2O system) is quite higher. This paper proposes a metal-free additive texturization method, in which polyethylene glycol (PEG) is added to the HF/HNO3/H2O system to reduce the reaction rate of silicon wafers and improve the wettability of the etching liquid and the surface of mc-Si wafers. The etching points will gradually turn into nanopores instead of worm-like structures due to low reaction rates. Those nanopores form a gradually changed refractive index between silicon and air, which immensely reduces the surface reflectivity of mc-Si wafers. The mc-Si wafers processed in the experiment have an average surface reflectivity of about 16.9% in the wavelength range of 300–1100 nm, which is generally lower than the mc-Si wafers etched by the conventional acid etching process. This technical route has been applied to fabricate the 156 mm × 156 mm DWS mc-Si solar cells, and finally, the conversion efficiency of 19.39% has been obtained. Moreover, this approach matches well with the current PV industrial processes, showing a promising prospect.", "openArchiveArticle": "false", "prism:coverDate": "2020-11-01", "openaccessUserLicense": null, "prism:aggregationType": "Journal", "prism:url": "https://api.elsevier.com/content/article/pii/S1369800120302328", "dc:creator": [{"@_fa": "true", "$": "Li, Likai"}, {"@_fa": "true", "$": "Jin, Hao"}, {"@_fa": "true", "$": "Wang, Qi"}, {"@_fa": "true", "$": "Yang, Deren"}, {"@_fa": "true", "$": "Wang, Lei"}], "link": [{"@_fa": "true", "@rel": "self", "@href": "https://api.elsevier.com/content/article/pii/S1369800120302328"}, {"@_fa": "true", "@rel": "scidir", "@href": "https://www.sciencedirect.com/science/article/pii/S1369800120302328"}], "dc:format": "application/json", "openaccessType": null, "pii": "S1369-8001(20)30232-8", "prism:volume": "118", "articleNumber": "105187", "prism:publisher": "Elsevier Ltd.", "dc:title": "A metal-free additive texturization method used for diamond-wire-sawn multi-crystalline silicon wafers", "prism:copyright": "© 2020 Elsevier Ltd. All rights reserved.", "openaccess": "0", "prism:issn": "13698001", "dcterms:subject": [{"@_fa": "true", "$": "Silicon"}, {"@_fa": "true", "$": "Diamond-wire-sawn"}, {"@_fa": "true", "$": "Texturization"}, {"@_fa": "true", "$": "Metal-free additive"}, {"@_fa": "true", "$": "Nanostructure"}, {"@_fa": "true", "$": "Solar cell"}], "openaccessArticle": "false", "prism:publicationName": "Materials Science in Semiconductor Processing", "openaccessSponsorType": null, "prism:pageRange": "105187", "pubType": "fla", "prism:coverDisplayDate": "1 November 2020", "prism:doi": "10.1016/j.mssp.2020.105187", "prism:startingPage": "105187", "dc:identifier": "doi:10.1016/j.mssp.2020.105187", "openaccessSponsorName": null}, "objects": {"object": [{"@category": "standard", "@height": "580", "@width": "811", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1369800120302328-gr3.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "189241", "@ref": "gr3", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "289", "@width": "388", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1369800120302328-gr2.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "42647", "@ref": "gr2", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "237", "@width": "691", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1369800120302328-gr5.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "84487", "@ref": "gr5", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "390", "@width": "811", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1369800120302328-gr4.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "133219", "@ref": "gr4", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "375", "@width": "535", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1369800120302328-gr7.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "73750", "@ref": "gr7", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "289", "@width": "388", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1369800120302328-gr6.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "49918", "@ref": "gr6", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "285", "@width": "388", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1369800120302328-gr8.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "44707", "@ref": "gr8", "@mimetype": "image/jpeg"}, {"@category": "standard", "@height": "239", "@width": "691", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1369800120302328-gr1.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "78276", "@ref": "gr1", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "157", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1369800120302328-gr3.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "28986", "@ref": "gr3", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "163", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1369800120302328-gr2.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "14599", "@ref": "gr2", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "75", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1369800120302328-gr5.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "21140", "@ref": "gr5", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "105", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1369800120302328-gr4.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "21396", "@ref": "gr4", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "153", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1369800120302328-gr7.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "24946", "@ref": "gr7", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "163", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1369800120302328-gr6.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "15828", "@ref": "gr6", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "161", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1369800120302328-gr8.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "14677", "@ref": "gr8", "@mimetype": "image/gif"}, {"@category": "thumbnail", "@height": "76", "@width": "219", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1369800120302328-gr1.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "16686", "@ref": "gr1", "@mimetype": "image/gif"}, {"@category": "high", "@height": "2569", "@width": "3591", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1369800120302328-gr3_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "1414944", "@ref": "gr3", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "1283", "@width": "1720", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1369800120302328-gr2_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "190882", "@ref": "gr2", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "1049", "@width": "3059", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1369800120302328-gr5_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "552079", "@ref": "gr5", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "1729", "@width": "3591", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1369800120302328-gr4_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "923597", "@ref": "gr4", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "1659", "@width": "2370", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1369800120302328-gr7_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "503332", "@ref": "gr7", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "1282", "@width": "1721", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1369800120302328-gr6_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "235005", "@ref": "gr6", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "1263", "@width": "1721", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1369800120302328-gr8_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "213566", "@ref": "gr8", "@mimetype": "image/jpeg"}, {"@category": "high", "@height": "1058", "@width": "3059", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1369800120302328-gr1_lrg.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-HIGH-RES", "@size": "627732", "@ref": "gr1", "@mimetype": "image/jpeg"}, {"@category": "standard", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1369800120302328-am.pdf?httpAccept=%2A%2F%2A", "@multimediatype": "Acrobat PDF file", "@type": "AAM-PDF", "@size": "2220308", "@ref": "am", "@mimetype": "application/pdf"}]}, "link": {"@rel": "abstract", "@href": "https://api.elsevier.com/content/abstract/scopus_id/85084949280"}}